      *VERSION CAPAS                                                            
       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID.                                                              
           ZM4EHA06.                                                            
       AUTHOR.                                                                  
           PROGRAMADOR:SOFTTEK( ING. LUIS MIGUEL LUGO MARTINEZ ).               
           ANALISTA   :SOFTTEK( ING. MA. GERALDINE DIAZ CEBALLOS O)             
       INSTALLATION.                                                            
           PROBURSA, S.A. DE C.V.                                               
       DATE-WRITTEN.                                                            
           26/ENE/90.                                                           
      ******************************************************************        
      *   MODIFICADO  SEPTIEMBRE, 2005   SOFTTEK.                               
      *             - ACTUALIZAR ICONCEPT EN TABLAS TITSOLI, TITPRES,           
      *               SOLGRAN Y CAPAS.                                          
      *             - ACTUALIZAR PRECIOS EN TABLA PRECIO                        
      *             - PREPARAR PROGRAMA PARA NUEVAS TENENCIAS                   
      *----                                                                     
      ******************************************************************        
      *   MODIFICADO  DICIEMBRE , 2005   GETRONICS.                             
      *             - SE CAMBIA RUTINA DE CALCULO DE DIAS HABILES,              
      *               ZM6RG001 X RUTINA ZM6RG042                                
      *   OSCAR URBANO FDZ.                                                     
      *----                                                                     
      ******************************************************************        
      *   MODIFICADO: MAYO  2006.       (GETRONICS).                            
      *             - SE MODIFICA PARA PERMITIR EN EVENTO SPLIT Y               
      *               REVERSPLIT PERMITA DAR DE ALTA EMISORA OTORGANTE.         
      *   OSCAR URBANO FDZ.                                                     
      *----                                                                     
      ******************************************************************        
      *   MODIFICADO: SEPTIEMBRE 2007.                                          
      *             - CUANDO ES UN DIVIDENDO OPCIONAL SE CAMBIA EL              
      *               ACCESO A CONCEPT.                                         
      *   OSCAR URBANO FDZ.   (AZARTIA).                                        
      *----                                                                     
      ******************************************************************        
      *   MODIFICADO: JUNIO 2008.                                               
      *             - SE ACTUALIZAN GARANTIAS DE LA TABLA ZMDT701               
      *   OSCAR URBANO FDZ.   (AZERTIA).                                        
      *----                                                                     
      *----                                                                     
      ******************************************************************        
      *   MODIFICADO: 08-ABR-2010                                               
      *             - ACTUALIZAR EL SBLOQUEO DE CONCEPT CON EL VALOR            
      *               DEL PARAMETRO DEL PROGRAMA ZM2OH918.                      
      *   IGNACIO CARLIN HERNANDEZ                                              
      *   SNG-001                                                               
      *----                                                                     
      ******************************************************************        
      *   MODIFICADO : 09-JULIO-2013                                            
      *   AUTOR      : JOSE OSCAR SEGURA PEREZ                                  
      *   MARCA      : JOSP                                                     
      *   OBJETIVO   : PARA LOS PROCESOS DE SPLIT Y REVERSPLIT SE               
      *                AJUSTA PARA QUE LA MISMA AFECTACION EN LA                
      *                CARTERA, SE REALIZE EN LA TABLA ZMDT701,                 
      *                CUANDO EXISTA UN CREDITO VIGENTE Y ASI EVITAR            
      *                PROBLEMA AL VENCIMIENTO DEL CREDITO.                     
      *----                                                                     
      ******************************************************************        
      *   MODIFICADO : 14-MARZO-2014                                            
      *   AUTOR      : SOFTTEK(REPG)                                            
      *   MARCA      : @STK-01                                                  
      *   OBJETIVO   : SE AGREGAN VARIABLES Y SE MODIFICA PARRAFO               
      *                110-0200-INS-CARTERA PARA OMITIR LLAMADO A LA            
      *                RUTINA ZM6CR200 Y ASI DAR DE ALTA EN LAS TABLAS          
      *                OPERAVA Y CARTERA.                                       
      *----                                                                     
      *            *        *       *                           -------*        
      * ANS-1.1.0-x  XM01480 09052014 ELIMINAR ACTUALIZACION DE CADA   *        
      *                               3000 REGISTROS EN TABLAS DB2 PARA*        
      *                               EVITAR CONTENCION. EL NUEVO PRO--*        
      *                               GRAMA: ZM4EHA07 EFECTUARA LOS    *        
      *                               EVENTOS DE ACTUALIZACION DE CADA *        
      *                               RENGLON SEGUIDOS DE LA OPERACION *        
      *                               COMMIT.                          *        
      *            *        *       *                                  *        
      *----------------------------------------------------------------*        
      * MARCA    FECHA             DESCRIPCION                         *        
      * -------- --------- ------------------------------------------- *        
      * O-1.2.2  DD-MES-AA SE AGREGA LA VAR. FACTOR_CC Y OPCION EN     *        
      *                    CURSOR C500-EJEACCI.                        *        
      *                    SE COMENTA EL PARRAFO 551-OBT-PARAM-H06. ASI*        
      *                    MISMO INHABILTANDO EL PARRAFO 551-0150-LEE. *        
      *                                                                *        
      *----------------------------------------------------------------*        
      * MARCA    FECHA              DESCRIPCION                                 
      * ------  ---------- --------------------------------------------*        
      * XMYECC  2018-02-19 CORRECCION DE PRECIO EN 0, MUEVE W110-MCPPBP*        
      *                    A A5-MCPROEXI Y A5-MPRECIO                  *        
      *----------------------------------------------------------------*        
      /                                                                         
       ENVIRONMENT DIVISION.                                                    
       CONFIGURATION SECTION.                                                   
       SOURCE-COMPUTER.                                                         
           IBM-4381.                                                            
       OBJECT-COMPUTER.                                                         
           IBM-4381.                                                            
      *                                                                         
       INPUT-OUTPUT SECTION.                                                    
       FILE-CONTROL.                                                            
      *----                                                                     
      *    TARJETA DE PARAMETROS DE ENTRADA                                     
      *----                                                                     
           SELECT ARCH-PT-PARAM        ASSIGN TO UT-S-ZMHA06A1.                 
      *----                                                                     
      *    ARCHIVOS DE SALIDA                                                   
      *----                                                                     
           SELECT REPO-R1-CASPRE       ASSIGN TO UT-S-ZMHA06R1.                 
      *    PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           SELECT REPO-R2-BCMPRE       ASSIGN TO UT-S-ZMHA06R2.                 
      *                                                                         
      *---- ARCHIVOS DE SALIDA PARA ACTUALIZACION DE BASE DE DATOS              
      *---- CON COMMIT POR REGISTRO EN PROCESO DEFINITIVO (PRG.ZM4EHA07)        
      *                                                                         
           SELECT ARCH-A3-CURSORES     ASSIGN TO UT-S-ZMHA06A3                  
                                       FILE STATUS IS W000-ARCH-A3-ST.          
           SELECT ARCH-A4-CARTERA      ASSIGN TO UT-S-ZMHA06A4                  
                                       FILE STATUS IS W000-ARCH-A4-ST.          
           SELECT ARCH-A5-OPERAVA      ASSIGN TO UT-S-ZMHA06A5                  
                                       FILE STATUS IS W000-ARCH-A5-ST.          
           SELECT ARCH-A6-ZMDT701      ASSIGN TO UT-S-ZMHA06A6                  
                                       FILE STATUS IS W000-ARCH-A6-ST.          
      *                                                                         
       DATA DIVISION.                                                           
      *                                                                         
       FILE SECTION.                                                            
      *----                                                                     
      *    ARCHIVOS DE PARAMETROS, REPORTES                                     
      *----                                                                     
       FD  ARCH-PT-PARAM                                                        
           LABEL RECORD STANDARD                                                
           RECORDING MODE IS F                                                  
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS 96 CHARACTERS.                                       
      *                                                                         
       01 WS-REG-PARAM       PIC X(96).                                         
      *                                                                         
       FD  REPO-R1-CASPRE                                                       
           RECORDING MODE F                                                     
           RECORD CONTAINS 131 CHARACTERS                                       
           BLOCK CONTAINS 0 RECORDS                                             
           LABEL RECORD STANDARD.                                               
       01  R1-REG                      PIC X(131).                              
      *----                                                                     
      *    PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
       FD  REPO-R2-BCMPRE                                                       
           RECORDING MODE F                                                     
           RECORD CONTAINS 131 CHARACTERS                                       
           BLOCK CONTAINS 0 RECORDS                                             
           LABEL RECORD STANDARD.                                               
       01  R2-REG                      PIC X(131).                              
      *----                                                                     
      *                                                                         
      ******************************************************************        
      *  ARCHIVOS DE SALIDA CON DATOS PARA EL PROGRAMA ZM4EHA07        *        
      ******************************************************************        
       FD  ARCH-A3-CURSORES                                                     
           RECORDING MODE F                                                     
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS  71 CHARACTERS                                       
           LABEL RECORD STANDARD.                                               
       01  REG-TA3-CURSORES            PIC  X(071).                             
      *                                                                         
       FD  ARCH-A4-CARTERA                                                      
           RECORDING MODE F                                                     
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS 144 CHARACTERS                                       
           LABEL RECORD STANDARD.                                               
       01  REG-TA4-CARTERA             PIC  X(144).                             
      *                                                                         
       FD  ARCH-A5-OPERAVA                                                      
           RECORDING MODE F                                                     
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS 199 CHARACTERS                                       
           LABEL RECORD STANDARD.                                               
       01  REG-TA5-OPERAVA             PIC  X(199).                             
      *                                                                         
       FD  ARCH-A6-ZMDT701                                                      
           RECORDING MODE F                                                     
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS  71 CHARACTERS                                       
           LABEL RECORD STANDARD.                                               
       01  REG-TA6-ZMDT701             PIC  X(071).                             
      *----                                                                     
       WORKING-STORAGE SECTION.                                                 
      *----                                                                     
       01  WS-FECHA-INPC               PIC  X(10) VALUE '0001-01-01'.           
       01  FILLER REDEFINES WS-FECHA-INPC.                                      
           05 WS-INPC-SSAA             PIC 9(4).                                
           05 WS-INPC-G1               PIC X.                                   
           05 WS-INPC-MM               PIC 99.                                  
           05 WS-INPC-G2               PIC X.                                   
           05 WS-INPC-DD               PIC 99.                                  
      *----                                                                     
                                                                                
      * VARIABLES PARA OBTENER EL CONSECUTIVO DEL FOLIO.                        
       01 RUT-ZM6RG012                 PIC  X(08) VALUE 'ZM6RG012'.             
       01 W000-SIGFOLIO                PIC S9(10)V COMP-3 VALUE 0.              
       01 ZG11-REGISTRO.                                                        
               COPY    ZMWBV011.                                                
      *                                                                         
       01  WS-SBLOQUEO                 PIC X(01).                               
      *----                                                                     
      *    SWITCHES DE ESTADO (1 = 'FIN' , 0 = 'NO FIN')                        
      *----                                                                     
       01  S000-EDO-FD                 PIC X(01).                               
       01  S500-EDO-EJEACCI            PIC X(01).                               
       01  S520-EDO-CARTERA            PIC X(01).                               
       01  S595-EDO                    PIC X(01).                               
       01  S570-LEC-EFECTUADA          PIC X(01).                               
       01  S580-EDO-CARTERA            PIC X(01).                               
       01  S700-EDO-R1                 PIC X(01).                               
      *----                                                                     
       01  S000-PRIM-VEZ               PIC X(1)        VALUE '0'.               
       01  S010-SI                     PIC X(01).                               
       01  S140-EDO-PRECIO-SI          PIC X(01).                               
       01  S535-EDO-AGPOCON            PIC X(01).                               
       01  S010-WARR                   PIC X(01).                               
       01  S000-DIV-OPC                PIC X(01)       VALUE SPACES.            
      /                                                                         
      *----                                                                     
      *    CONSTANTES                                                           
      *----                                                                     
       01  W000-PROG                   PIC X(08)     VALUE 'ZM4EHA06'.          
       01  W000-IOPERA-C               PIC S9(05)      VALUE +1904.             
       01  W000-IOPERA-S               PIC S9(05)      VALUE +1900.             
       01  W000-IOPERA-SC              PIC S9(05)      VALUE +1901.             
       01  W000-IOPERA-R               PIC S9(05)      VALUE +1902.             
       01  W000-IOPERA-RC              PIC S9(05)      VALUE +1903.             
      /                                                                         
       01  W000-SUCURSAL               PIC X(03)       VALUE SPACES.            
      *                                                                         
       01  W000-ARCH-A3-ST             PIC X(02)       VALUE SPACES.            
       01  W000-ARCH-A4-ST             PIC X(02)       VALUE SPACES.            
       01  W000-ARCH-A5-ST             PIC X(02)       VALUE SPACES.            
       01  W000-ARCH-A6-ST             PIC X(02)       VALUE SPACES.            
      *                                                                         
       01  W100-ITIPOFOL               PIC X(02)       VALUE '11'.              
       01  W100-NUM-ERROR              PIC S9(09)      COMP-3                   
                                                       VALUE 0.                 
       01  W100-NUM-FOLIO              PIC S9(09)      COMP-3                   
                                                       VALUE 0.                 
      /                                                                         
      *                                                                         
      *----                                                                     
      * VARIABLES DE LA RUTINA DE FECHAS (ZM6RG042)                             
      *----                                                                     
           COPY  ZMWBV492.                                                      
      /                                                                         
      *     FECHAS-HORAS COMPILACION                                            
      *----                                                                     
       COPY ZMWBV004.                                                           
      /                                                                         
      *----                                                                     
      *    VARIABLES DE TRABAJO                                                 
      *----                                                                     
       01  R2-NUM-HOJA                 PIC S9(9)       COMP.                    
       01  R2-NUM-LIN                  PIC S9(9)       COMP.                    
      *                                                                         
      *TMP INI                                                                  
       01  WS-SW-PORC-COSTO-PROM       PIC  X(01)       VALUE 'N'.              
       01  W000-PORCPP-N               PIC  9(03)V9(06) VALUE ZEROS.            
       01  FILLER REDEFINES W000-PORCPP-N.                                      
           05 W000-PORCPP-X            PIC  X(09).                              
       01  W000-PORCPP-E               PIC  ---9.999999.                        
      *TMP FIN                                                                  
      *                                                                         
       01  W000-MCPROEXI               PIC S9(10)V9(8) COMP-3.                  
       01  W000-MCPPFA                 PIC S9(10)V9(8) COMP-3.                  
       01  W000-MCPPBP                 PIC S9(10)V9(8) COMP-3.                  
      *                                                                         
                                                                                
       01  W000-AUXILIAR               PIC S9(10)V9(5) COMP-3.                  
       01  W032-ICONCEPT               PIC S9(5)      COMP-3.                   
       01  WS-CTA-RESERVA-EMP1         PIC  9(7) VALUE 0.                       
       01  WS-CTA-RESERVA-EMP2         PIC  9(7) VALUE 0.                       
       01  W032-ISEC                   PIC S9(2)      COMP-3.                   
                                                                                
       01  WA06-FECHA-HOY              PIC X(10).                               
       01  WA06-FSIST                  PIC X(26).                               
       01  WA06-FECHA-SISTEMA.                                                  
           05 WA06-FSIST-DIA           PIC X(10).                               
           05 FILLER                   PIC X(01) VALUE '-'.                     
           05 WA06-FSIST-HORA          PIC X(15).                               
      *                                                                         
       01  W000-FACTOR                 PIC S9(07)V9(04) VALUE 0.                
       01  W000-INPC-OPE               PIC S9(07)V9(08) VALUE 0.                
       01  W000-INPC-CAR               PIC S9(07)V9(08) VALUE 0.                
       01  W000-FECHA                  PIC X(10) VALUE SPACES.                  
       01  W000-CTITULOS-INI           PIC S9(15)      COMP-3.                  
                                                                                
      *----                                                                     
      *    PARA EDICION DE CUENTA EN IMPRESION                                  
      *----                                                                     
       01  W050-ICUENTA                PIC 9(07).                               
       01  W050-ICUENTA-RED REDEFINES W050-ICUENTA.                             
           05 W050-ICUENTA-N           PIC 9(06).                               
           05 W050-ICUENTA-D           PIC 9(01).                               
      *----                                                                     
      *    VARIABLES DE TRABAJO PARA REALIZACION PERIODICA DE COMMITS.          
      *----                                                                     
      *O-1.2.2.INI                                                              
       01  W070-AUX-ICONCEPT           PIC 9(05).                               
      *O-1.2.2.FIN                                                              
      *                                                                         
       01  W070-RESULT                 PIC S9(15)       COMP-3.                 
       01  W070-RESULT-DEC             PIC S9(10)V9(05) COMP-3.                 
      *                                                                         
       01  W110-CARTERA.                                                        
           05  W110-ICUENTA            PIC S9(07)      COMP-3.                  
           05  W110-SCUENTA            PIC X(01).                               
           05  W110-ICONCEPT           PIC S9(05)      COMP-3.                  
           05  W110-SCONCEPT           PIC X(01).                               
           05  W110-IEMISORA           PIC X(07).                               
           05  W110-ISERIE             PIC X(08).                               
           05  W110-ICUPON             PIC S9(03)      COMP-3.                  
           05  W110-FCARTERA           PIC X(10).                               
           05  W110-FULTCOMP           PIC X(10).                               
           05  W110-ITIPOCAR           PIC X(01).                               
           05  W110-ITIPOSDO           PIC X(01).                               
           05  W110-ITIPOTEN           PIC X(01).                               
           05  W110-IREF               PIC S9(09)      COMP-3.                  
           05  W110-AREND              PIC S9999V9999  COMP-3.                  
           05  W110-CTITULOS           PIC S9(15)      COMP-3.                  
           05  W110-MVALMERC           PIC S9(07)V9(8) COMP-3.                  
           05  W110-MCPROEXI           PIC S9(07)V9(8) COMP-3.                  
           05  W110-ICONCEXP           PIC S9(05)      COMP-3.                  
           05  W110-IDIACAR            PIC S9(03)      COMP-3.                  
           05  W110-ICVEOPES           PIC S9(03)      COMP-3.                  
           05  W110-IFOLOPES           PIC S9(09)      COMP-3.                  
           05  W110-DIV                PIC S9(13)V9(2) COMP-3.                  
           05  W110-MCPPFA             PIC S9(07)V9(8) COMP-3.                  
           05  W110-MCPPBP             PIC S9(07)V9(8) COMP-3.                  
           05  W110-FULACCPP           PIC X(10).                               
           05  W110-TOT-TITOTOR        PIC S9(15)      COMP-3.                  
      *                                                                         
       01  W000-AUX-ITVBMV             PIC X(03).                               
       01  W000-AUX-SBLOQUEO           PIC X(01).                               
       01  W520-ITIPOPAR               PIC X(03).                               
       01  W520-IPARAMAR               PIC X(19).                               
       01  W520-DATOSPAR.                                                       
           05 W520-P47ICONC            PIC 9(05).                               
           05 FILLER                   PIC X(53)       VALUE SPACES.            
      *                                                                         
       01  W560-DATOSPAR.                                                       
           05 W560-ICUENTA             PIC 9(07).                               
           05 FILLER                   PIC X(51)       VALUE SPACES.            
      *                                                                         
       01  W570-ULTLLA.                                                         
           05 W570-ICONCEPT            PIC S9(05)      COMP-3.                  
           05 W570-ICUENTA             PIC S9(07)      COMP-3.                  
           05 W570-ITIPOTEN            PIC X(01).                               
           05 W570-IFOLOPES            PIC S9(15)      COMP-3.                  
           05 W570-ICVEOPES            PIC S9(03)      COMP-3.                  
       01  W570-EDATOS-C.                                                       
           05 W570-IDATO1              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO2              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO3              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO4              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO5              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO6              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO7              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO8              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO9              PIC X(254)      VALUE SPACES.            
           05 W570-IDATO10             PIC X(254)      VALUE SPACES.            
           05 W570-IDATO11             PIC X(254)      VALUE SPACES.            
       01  W570-EDATOS.                                                         
      *    PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           05 W570-TITOT-1-EMP1        PIC S9(15)      COMP-3.                  
           05 W570-TITOT-1-EMP2        PIC S9(15)      COMP-3.                  
           05 W570-TITOT-2-EMP1        PIC S9(15)      COMP-3.                  
           05 W570-TITOT-2-EMP2        PIC S9(15)      COMP-3.                  
           05 W570-TITOT-3-EMP1        PIC S9(15)      COMP-3.                  
           05 W570-TITOT-3-EMP2        PIC S9(15)      COMP-3.                  
           05 W570-TITOT-4-EMP1        PIC S9(15)      COMP-3.                  
           05 W570-TITOT-4-EMP2        PIC S9(15)      COMP-3.                  
           05 W570-CTITULOS-EMP1       PIC S9(15)      COMP-3.                  
           05 W570-CTITULOS-EMP2       PIC S9(15)      COMP-3.                  
           05 W570-CLI-PROC-EMP1       PIC S9(9)       COMP.                    
           05 W570-CLI-PROC-EMP2       PIC S9(9)       COMP.                    
      *----                                                                     
      *    PARA MENSAJES DE ERROR SQL                                           
      *----                                                                     
       COPY ZMWBV002.                                                           
      /                                                                         
      *----                                                                     
      *    IDENTIDADES                                                          
      *----                                                                     
       01  I050-ID-PROC.                                                        
           05  I050-ICUENTA-PROC       PIC 9(7).                                
           05  I050-ITIPOTEN           PIC X(1).                                
       01  I580-ID-LEI.                                                         
           05  I580-ICUENTA-LEI        PIC 9(7).                                
           05  I580-ITIPOTEN           PIC X(1).                                
       01  I140-ID-FPRECIO-LEI         PIC X(10).                               
       01  I140-ID-FPRECIO-ANT         PIC X(10).                               
       01  I530-ID-IEMISORA-OTORGA     PIC X(7).                                
       01  I530-ID-ISERIE-OTORGA       PIC X(8).                                
       01  I530-ID-ICUPON-OTORGA       PIC S9(03)    COMP-3.                    
                                                                                
      *----                                                                     
      *    ACUMULADORES                                                         
      *----                                                                     
       01  A000-DIF                    PIC 9(02)       COMP.                    
       01  A000-I                      PIC 9(02)       COMP.                    
       01  A000-CONT                   PIC 9(02)       COMP.                    
       01  A000-CONT2                  PIC 9(02)       COMP.                    
       01  A000-INDICE                 PIC 9(02)       COMP.                    
       01  A085-CONT-TVC               PIC 9(02)       COMP.                    
       01  A087-CONT-TVC               PIC 9(02)       COMP.                    
       01  A000-TOTAL.                                                          
           05  A000-CTITCLIE           PIC S9(15)      COMP-3.                  
      *    PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           05  A000-CTITCART-EMP1      PIC S9(15)      COMP-3.                  
           05  A000-CTITCART-EMP2      PIC S9(15)      COMP-3.                  
       01  A000-CLIE-PROC-EMP1         PIC S9(9)       COMP.                    
       01  A000-CLIE-PROC-EMP2         PIC S9(9)       COMP.                    
       01  A990-CIF-CTL.                                                        
           05  A990-REG-LEI-CARTERA    PIC S9(9)       COMP.                    
           05  A990-REG-ESC-R1         PIC S9(9)       COMP.                    
           05  A990-REG-ESC-R2         PIC S9(9)       COMP.                    
           05  A990-NUM-ACT-ORDENES    PIC S9(9)       COMP.                    
       01  A990-CIFRA                  PIC 9(9)+.                               
                                                                                
      *                                                                         
       01 T000-DEPOSITOS.                                                       
          05 R200-VARIABLES            OCCURS 4 TIMES.                          
             10 R200-EDO-CART          PIC X(01).                               
             10 R200-TITOTOR           PIC S9(15).                              
             10 R200-SIGFOLIO          PIC S9(09).                              
             10 R200-IOPERA            PIC S9(05).                              
             10 R200-EOPERA            PIC X(15).                               
             10 R200-ICUENTA           PIC S9(07).                              
             10 R200-ICONCEPT          PIC S9(05).                              
             10 R200-MCPPFA            PIC S9(07)V9(8).                         
             10 R200-MCPPBP            PIC S9(07)V9(8).                         
             10 R200-P05FECHO          PIC X(10).                               
             10 R200-IEMPR             PIC X(03).                               
             10 R200-ITIPOTEN          PIC X(01).                               
      *                                                                         
          05 WSV-OPERAVA               OCCURS 4 TIMES.                          
             10 OPER-IREF              PIC S9(09)V.                             
             10 OPER-IOPERA            PIC S9(05)V.                             
             10 OPER-IUSUARIO          PIC X(8).                                
             10 OPER-EOPERA            PIC X(15).                               
             10 OPER-ICUENTA1          PIC S9(07)V.                             
             10 OPER-ICONCEP2          PIC S9(05)V.                             
             10 OPER-TITOTOR           PIC S9(13)V99.                           
             10 OPER-CTITULOS          PIC S9(13)V99.                           
             10 OPER-MCPROEXI          PIC S9(07)V9(08).                        
             10 OPER-FOPERA            PIC X(10).                               
             10 OPER-FLIQUIDA          PIC X(10).                               
             10 OPER-IRUTA             PIC X(3).                                
             10 OPER-SLIQUID           PIC X(1).                                
             10 OPER-IFOLOPES          PIC S9(09)V.                             
             10 OPER-ICVEOPES          PIC S9(03)V.                             
             10 OPER-ITIPOTEN          PIC X(1).                                
             10 OPER-ICUENTA           PIC S9(07).                              
             10 OPER-IOCONCEP          PIC S9(05)V.                             
             10 OPER-IOEMISOR          PIC X(07).                               
             10 OPER-IOSERIE           PIC X(08).                               
             10 OPER-ICUPON            PIC S9(3).                               
             10 OPER-FCARTERA          PIC X(10).                               
             10 OPER-FULTCOMP          PIC X(10).                               
             10 OPER-ITIPOSDO          PIC X(01).                               
             10 OPER-TITOTOR1          PIC S9(15) COMP-3.                       
      *                                                                         
      *----                                                                     
      *    TOTALES                                                              
      *----                                                                     
       01  T000-TITSOTORG.                                                      
           05  T000-OTORGADOS          OCCURS 4 TIMES.                          
               10  T000-CTITOT-I       PIC S9(15)      COMP-3.                  
               10  T000-CTITOT-G       PIC S9(15)      COMP-3.                  
      *    PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
               10  T000-TITOT-I-EMP1   PIC S9(15)      COMP-3.                  
               10  T000-TITOT-I-EMP2   PIC S9(15)      COMP-3.                  
               10  T000-TITOT-G        PIC S9(15)      COMP-3.                  
               10  T000-RESERVA        PIC S9(15)      COMP-3.                  
       01  T000-EXI                    PIC X(01).                               
       01  T000-NUM-ELEM               PIC S9(9)       COMP.                    
       01  T000-MAX-ELEM               PIC S9(9)       COMP                     
                                       VALUE +4.                                
      *----                                                                     
      *    EMISORAS OTORGADAS (EJEACCI).                                        
      *----                                                                     
       01  T010-REGS-EJEACCI.                                                   
           05 T010-CTITOTOR            PIC S9(10)V9(5) COMP-3.                  
           05 T010-CCUPONES            PIC S9(5)V9(10) COMP-3.                  
           05 T010-SCAPITAL            PIC X(01).                               
           05 T010-ICRITED             PIC X(02).                               
           05 T010-EMISORAS            OCCURS 4 TIMES.                          
              10 T010-IOCONCEP         PIC S9(5)       COMP-3.                  
              10 T010-IOEMISOR         PIC X(07).                               
              10 T010-IOSERIE          PIC X(08).                               
              10 T010-IOCUPON          PIC S9(3)       COMP-3.                  
              10 T010-POTORG           PIC S9(3)V9(6)  COMP-3.                  
              10 T010-PORCPP           PIC S9(3)V9(6)  COMP-3.                  
       01  T010-EXI                    PIC X(01).                               
       01  T010-NUM-ELEM               PIC S9(9)       COMP.                    
       01  T010-MAX-ELEM               PIC S9(9)       COMP                     
                                       VALUE +4.                                
      *----                                                                     
      *    EMISORAS OTORGADAS POR CADA CUENTA (O CONTRATO).                     
      *----                                                                     
       01  T050-VARS-CUENTA.                                                    
           05  T050-REGS-CUENTA        OCCURS 30 TIMES.                         
               10 T050-ITIPOTEN        PIC X(01).                               
               10 T050-IDIACAR         PIC S9(03)      COMP-3.                  
               10 T050-CTITULOS        PIC S9(15)      COMP-3.                  
               10 T050-IFOLOPES        PIC S9(15)      COMP-3.                  
               10 T050-ICVEOPES        PIC S9(03)      COMP-3.                  
               10 T050-MCPROEXI        PIC S9(07)V9(8) COMP-3.                  
               10 T050-MCPPFA          PIC S9(07)V9(8) COMP-3.                  
               10 T050-MCPPBP          PIC S9(07)V9(8) COMP-3.                  
               10 T050-FULACCPP        PIC X(10).                               
               10 T050-EMIS-OTORGADAS  OCCURS 4 TIMES.                          
                  15 T050-IOCONCEP     PIC S9(05)      COMP-3.                  
                  15 T050-TITOTOR      PIC S9(15)      COMP-3.                  
       01  T050-EXI                    PIC X(01).                               
       01  T050-NUM-ELEM               PIC S9(9)       COMP.                    
       01  T050-MAX-ELEM               PIC S9(9)       VALUE +30.               
       01  W050-TITOTOR                PIC S9(15)      COMP-3.                  
      *                                                                         
      *----                                                                     
      *    SWITCH DEL PARAMETRO DE EMPRESA.                                     
      *----                                                                     
      *                                                                         
       01 S000-EDO-PARAM              PIC X(01) VALUE '0'.                      
       01 S000-EDO-APLIDER            PIC X(01) VALUE '0'.                      
       01 WS-EMPRESA                  PIC X(03) VALUE SPACES.                   
       01 WS-EMPRESA2                 PIC X(03) VALUE SPACES.                   
       01 WS-IEMPR-CTA                PIC X(03) VALUE SPACES.                   
       01 WS-IEMPR-SUC                PIC X(03) VALUE SPACES.                   
      *                                                                         
       COPY ZMWSH800.                                                           
      *                                                                         
      ******************************************************************        
      * REGISTROS DE SALIDA PARA ACTUALIZACION DE BASE DE DATOS        *        
      *    VALORES POSIBLES  PARA TIPOPER:                             *        
      *            'D'  BORRAR RENGLONES                               *        
      *            'U'  ACTUALIZAR RENGLONES                           *        
      *            'I'  INSERTAR NUEVOS RENGLONES                      *        
      ******************************************************************        
      *                                                                         
      *--- DEFINICION DE REGISTRO PARA PROCESAR LOS CURSORES DE LAS             
      *---  TABLAS: TITSOLI, TITPRES, SOLGRAN, ZMDT160 Y ZMDT161                
       01  A3-REG.                                                              
           05 A3-ICONCEPT              PIC S9(05)V           COMP-3.            
           05 A3-ISUCCASA              PIC  X(03).                              
           05 A3-IOCONCEP              PIC S9(05)V           COMP-3.            
           05 A3-IOEMISOR              PIC  X(07).                              
           05 A3-IOSERIE               PIC  X(08).                              
           05 A3-IOCUPON               PIC S9(03)V           COMP-3.            
           05 A3-CCUPONES              PIC S9(05)V9(10)      COMP-3.            
           05 A3-CTITOTOR              PIC S9(10)V9(05)      COMP-3.            
           05 A3-POTORG                PIC S9(03)V9(06)      COMP-3.            
           05 A3-ITIPODER              PIC  9(03).                              
           05 A3-ICRITED               PIC  X(02).                              
           05 A3-TCCUPONES             PIC S9(05)V9(10)      COMP-3.            
           05 A3-TCTITOTOR             PIC S9(10)V9(05)      COMP-3.            
           05 A3-ESTATUS-REG           PIC  X(03).                              
      *                                                                         
      *--- DEFINICION DE REGISTRO PARA ACTUALIZAR LA TABLA CARTERA              
       01  A4-REG.                                                              
           05 A4-ICUENTA               PIC S9(07)V           COMP-3.            
           05 A4-SCUENTA               PIC  X(01).                              
           05 A4-ICONCEPT              PIC S9(05)V           COMP-3.            
           05 A4-SCONCEPT              PIC  X(01).                              
           05 A4-IEMISORA              PIC  X(07).                              
           05 A4-ISERIE                PIC  X(08).                              
           05 A4-ICUPON                PIC S9(03)V           COMP-3.            
           05 A4-FCARTERA              PIC  X(10).                              
           05 A4-FULTCOMP              PIC  X(10).                              
           05 A4-ITIPOCAR              PIC  X(01).                              
           05 A4-ITIPOSDO              PIC  X(01).                              
           05 A4-ITIPOTEN              PIC  X(01).                              
           05 A4-IREF                  PIC S9(09)V           COMP-3.            
           05 A4-AREND                 PIC S9(04)V9(04)      COMP-3.            
           05 A4-FVEN                  PIC  X(10).                              
           05 A4-CDIAPZO               PIC S9(03)V           COMP-3.            
           05 A4-CTITEFE               PIC S9(13)V9(02)      COMP-3.            
           05 A4-MVALMERC              PIC S9(07)V9(08)      COMP-3.            
           05 A4-MCPROEXI              PIC S9(07)V9(08)      COMP-3.            
           05 A4-ICONCEXP              PIC S9(05)V           COMP-3.            
           05 A4-IDIACAR               PIC S9(03)V           COMP-3.            
           05 A4-ICVEOPES              PIC S9(03)V           COMP-3.            
           05 A4-IFOLOPES              PIC S9(09)V           COMP-3.            
           05 A4-ISUBFOL               PIC S999V             COMP-3.            
           05 A4-IFOLADM               PIC S9(09)V           COMP-3.            
           05 A4-FULACCPP              PIC  X(10).                              
           05 A4-MCPPFA                PIC S9(07)V9(08)      COMP-3.            
           05 A4-MCPPBP                PIC S9(07)V9(08)      COMP-3.            
           05 A4-TIPOPER-REG           PIC  X(01).                              
           05 A4-ESTATUS-REG           PIC  X(03).                              
      *                                                                         
      *--- DEFINICION DE REGISTRO PARA ACTUALIZAR LA TABLA OPERAVA              
       01  A5-REG.                                                              
           05 A5-IOPERA                PIC S9(05)V           COMP-3.            
           05 A5-IREF                  PIC S9(09)V           COMP-3.            
           05 A5-ISEC                  PIC S9(02)V           COMP-3.            
           05 A5-ITRANS                PIC  X(01).                              
           05 A5-IDOCTO                PIC S9(07)V           COMP-3.            
           05 A5-IUSUARIO              PIC  X(08).                              
           05 A5-EOPERA                PIC  X(15).                              
           05 A5-ETRANS                PIC  X(15).                              
           05 A5-ICUENTA1              PIC S9(07)V           COMP-3.            
           05 A5-ICONCEP1              PIC S9(05)V           COMP-3.            
           05 A5-CANT1                 PIC S9(13)V9(02)      COMP-3.            
           05 A5-ICUENTA2              PIC S9(07)V           COMP-3.            
           05 A5-ICONCEP2              PIC S9(05)V           COMP-3.            
           05 A5-CANT2                 PIC S9(13)V9(02)      COMP-3.            
           05 A5-ACOSCASA              PIC S9(04)V9(04)      COMP-3.            
           05 A5-ACOSFPRO              PIC S9(04)V9(04)      COMP-3.            
           05 A5-ACOSPROM              PIC S9(04)V9(04)      COMP-3.            
           05 A5-MCPROEXI              PIC S9(07)V9(08)      COMP-3.            
           05 A5-FREG                  PIC  X(26).                              
           05 A5-FOPERA                PIC  X(10).                              
           05 A5-FVENC                 PIC  X(10).                              
           05 A5-FLIQUIDA              PIC  X(10).                              
           05 A5-IRUTA                 PIC  X(03).                              
           05 A5-SLIQUID               PIC  X(01).                              
           05 A5-SESTATUS              PIC  X(01).                              
           05 A5-MPRECIO               PIC S9(07)V9(08)      COMP-3.            
           05 A5-MSOLOPER              PIC S9(13)V9(02)      COMP-3.            
           05 A5-ITIPOTEN              PIC  X(01).                              
           05 A5-ICVEOPES              PIC S9(03)V           COMP-3.            
           05 A5-IFOLOPES              PIC S9(09)V           COMP-3.            
           05 A5-SCORTO                PIC  X(01).                              
           05 A5-IEMPR                 PIC  X(03).                              
           05 A5-TIPOPER-REG           PIC  X(01).                              
           05 A5-ESTATUS-REG           PIC  X(03).                              
      *                                                                         
      *--- DEFINICION DE REGISTRO PARA ACTUALIZAR LA TABLA ZMDT701              
       01  A6-REG.                                                              
           05 A6-LLV-NCTAMUV           PIC S9(07)V           COMP-3.            
           05 A6-LLV-ICONCEPT          PIC S9(05)V           COMP-3.            
           05 A6-ICONCEPT              PIC S9(05)V           COMP-3.            
           05 A6-IEMISORA              PIC  X(07).                              
           05 A6-ISERIE                PIC  X(08).                              
           05 A6-CTITULOS              PIC S9(15)V           COMP-3.            
           05 A6-TOT-TITOTOR           PIC S9(15)V           COMP-3.            
           05 A6-TFREG                 PIC  X(26).                              
           05 A6-ITIPOTEN              PIC  X(01).                              
           05 A6-ESTATUS-REG           PIC  X(03).                              
      ******************************************************************        
      * TERMINA DEFINICION DE REGISTROS PARA ACTUALIZACION DE LA BD    *        
      ******************************************************************        
      *                                                                         
      *----                                                                     
      *    ESTE COPY SE USA EN PAREJA CON EL COPY: ZMWBP074.                    
      *    ESTOS COPYS SIRVEN PARA LA OBTENCION DEL CASILLERO.                  
      *----                                                                     
      *                                                                         
           EXEC SQL                                                             
                INCLUDE ZMWBV471                                                
           END-EXEC.                                                            
      /                                                                         
      *----                                                                     
      *    TABLAS                                                               
      *----                                                                     
      *    DEFINICION DE WORKINGS PARA TABLAS.                                  
      *----                                                                     
       01  T550-DATOSPAR.                                                       
           05 T550-NUM-ELEM            PIC 9(02).                               
           05 T550-TIPOTEN             OCCURS 56 TIMES.                         
              10 T550-ITIPOTEN         PIC X(01).                               
                                                                                
       01  T085-DATOSPAR-ITIPOVAL.                                              
           05 FILLER                   PIC X(02).                               
           05 T085-NUM-ELEM-TVC        PIC 9(02).                               
           05 T085-TIPOVAL-C           OCCURS 09 TIMES.                         
              10 T085-ITIPOVAL-C       PIC 9(06).                               
                                                                                
       01  T087-DATOSPAR-ITIPOVAL.                                              
           05 FILLER                   PIC X(02).                               
           05 T087-NUM-ELEM-TVC        PIC 9(02).                               
           05 T087-TIPOVAL-C           OCCURS 09 TIMES.                         
              10 T087-ITIPOVAL-C       PIC 9(06).                               
      *----                                                                     
      *    TABLA T47                                                            
      *----                                                                     
           EXEC SQL                                                             
              INCLUDE ZMWBV309                                                  
           END-EXEC.                                                            
      *----                                                                     
      *    TABLA ABREVIATURA DE MESES                                           
      *----                                                                     
       COPY ZMWBV003.                                                           
      /                                                                         
      *----                                                                     
      *    VARIABLES DE IMPRESION                                               
      *----                                                                     
      *----                                                                     
      *    RENGLONES REPORTE                                                    
      *----                                                                     
       01  R1-TITULO.                                                           
           05 R1-TIT-TIPODER           PIC X(10).                               
           05 FILLER                   PIC X(04)       VALUE ' DE '.            
           05 R1-TIT-IEMISORA          PIC X(7).                                
           05 FILLER                   PIC X(01)       VALUE ' '.               
           05 R1-TIT-ISERIE            PIC X(8).                                
           05 FILLER                   PIC X(01)       VALUE ' '.               
           05 R1-TIT-ICUPON            PIC ZZ9.                                 
       01  R1-TIT-TIPODER-C            PIC X(10)       VALUE                    
              '     CANJE'.                                                     
       01  R1-TIT-TIPODER-S            PIC X(10)       VALUE                    
              '     SPLIT'.                                                     
       01  R1-TIT-TIPODER-R            PIC X(10)       VALUE                    
              'REVERSPLIT'.                                                     
      *                                                                         
           EXEC SQL                                                             
                INCLUDE ZMWBV000                                                
           END-EXEC.                                                            
      *                                                                         
       01  R1-04-ENCA.                                                          
           05 FILLER                   PIC X(21)       VALUE SPACES.            
           05 R1-04-TIPOPRO            PIC X(25).                               
           05 FILLER                   PIC X(31)       VALUE SPACES.            
           05 FILLER                   PIC X(23)       VALUE                    
              '              CRITERIO '.                                        
           05 R1-TIT-ICRITED           PIC X(02).                               
       01  R1-04-TIPOPRO-P             PIC X(25)       VALUE                    
              '* PRELIMINAR *           '.                                      
       01  R1-04-TIPOPRO-D             PIC X(25)       VALUE                    
              '* DEFINITIVO *           '.                                      
      *                                                                         
       01  R1-05-ENCA.                                                          
           05  FILLER                   PIC X(05)     VALUE ' DAR '.            
           05  R1-05-DAR                PIC ZZZZZ9.999999.                      
           05  F1LLER                   PIC X(19)     VALUE                     
           ' ACCIONES POR CADA '.                                               
           05  R1-05-CADA               PIC ZZZZZ9.999999.                      
           05  FILLER                   PIC X(18)     VALUE                     
           ' ACCIONES         '.                                                
           05  R1-05-CAPI               PIC X(18).                              
      *                                                                         
       01  R1-07-ENCA.                                                          
           05  FILLER                   PIC X(22)     VALUE                     
           'SU  PRO   CONTRATO    '.                                            
           05  FILLER                   PIC X(16)     VALUE                     
           'N  O  M  B  R  E'.                                                  
           05  FILLER                   PIC X(09)     VALUE SPACES.             
           05  FILLER                   PIC X(16)     VALUE                     
           'T  CANT.RETIRADA'.                                                  
           05  FILLER                   PIC X(03)     VALUE SPACES.             
           05  R1-07-CANT-1             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-07-IEMI-1             PIC X(07).                              
           05  FILLER                   PIC X(03)     VALUE SPACES.             
           05  R1-07-CANT-2             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-07-IEMI-2             PIC X(07).                              
           05  FILLER                   PIC X(03)     VALUE SPACES.             
           05  R1-07-CANT-3             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-07-IEMI-3             PIC X(07).                              
           05  FILLER                   PIC X(03)     VALUE SPACES.             
           05  R1-07-CANT-4             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-07-IEMI-4             PIC X(07).                              
      *                                                                         
       01  R1-08-ENCA.                                                          
           05  FILLER                   PIC X(22)     VALUE                     
           'CUR MO                '.                                            
           05  FILLER                   PIC X(16)     VALUE SPACES.             
           05  FILLER                   PIC X(09)     VALUE SPACES.             
           05  FILLER                   PIC X(16)     VALUE                     
           'E               '.                                                  
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-08-ISER-1             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-08-ICUP-1             PIC ZZZ.                                
           05  FILLER                   PIC X(07)     VALUE SPACES.             
           05  R1-08-ISER-2             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-08-ICUP-2             PIC ZZZ.                                
           05  FILLER                   PIC X(07)     VALUE SPACES.             
           05  R1-08-ISER-3             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-08-ICUP-3             PIC ZZZ.                                
           05  FILLER                   PIC X(07)     VALUE SPACES.             
           05  R1-08-ISER-4             PIC X(05).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-08-ICUP-4             PIC ZZZ.                                
      *                                                                         
       01  R1-09-ENCA.                                                          
           05  FILLER                   PIC X(22)     VALUE                     
           'SAL TOR               '.                                            
           05  FILLER                   PIC X(16)     VALUE SPACES.             
           05  FILLER                   PIC X(09)     VALUE SPACES.             
           05  FILLER                   PIC X(16)     VALUE                     
           'N %DIS. TIT ==> '.                                                  
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCTJ-1-E.                                                  
               10  R1-09-PCTJ-1         PIC ZZ9.999999.                         
           05  R1-09-SIGN-1             PIC X(02)     VALUE SPACES.             
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCTJ-2-E.                                                  
               10  R1-09-PCTJ-2         PIC ZZ9.999999.                         
           05  R1-09-SIGN-2             PIC X(02)     VALUE SPACES.             
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCTJ-3-E.                                                  
               10  R1-09-PCTJ-3         PIC ZZ9.999999.                         
           05  R1-09-SIGN-3             PIC X(02)     VALUE SPACES.             
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCTJ-4-E.                                                  
               10  R1-09-PCTJ-4         PIC ZZ9.999999.                         
           05  R1-09-SIGN-4             PIC X(02)     VALUE SPACES.             
      *                                                                         
       01  R1-09-ENCA-PCPP.                                                     
           05  FILLER                   PIC X(22)     VALUE SPACES.             
           05  FILLER                   PIC X(16)     VALUE SPACES.             
           05  FILLER                   PIC X(09)     VALUE SPACES.             
           05  FILLER                   PIC X(16)     VALUE                     
           '  %DIS. CPP ==> '.                                                  
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCPP-1-E.                                                  
               10  R1-09-PCPP-1         PIC ZZ9.999999.                         
           05  R1-09-SIGN-1-PCPP        PIC X(02)     VALUE SPACES.             
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCPP-2-E.                                                  
               10  R1-09-PCPP-2         PIC ZZ9.999999.                         
           05  R1-09-SIGN-2-PCPP        PIC X(02)     VALUE SPACES.             
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCPP-3-E.                                                  
               10  R1-09-PCPP-3         PIC ZZ9.999999.                         
           05  R1-09-SIGN-3-PCPP        PIC X(02)     VALUE SPACES.             
           05  FILLER                   PIC X(05)     VALUE SPACES.             
           05  R1-09-PCPP-4-E.                                                  
               10  R1-09-PCPP-4         PIC ZZ9.999999.                         
           05  R1-09-SIGN-4-PCPP        PIC X(02)     VALUE SPACES.             
      *                                                                         
       01  R1-10-DETA.                                                          
           05  R1-10-ISUC               PIC XXX.                                
           05  FILLER                   PIC X(01)     VALUE SPACES.             
           05  R1-10-IPROM              PIC ZZZ9.                               
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-10-ICUENTA-N          PIC ZZZZZ9.                             
           05  FILLER                   PIC X(01)     VALUE '-'.                
           05  R1-10-ICUENTA-D          PIC 9.                                  
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-10-NABREV             PIC X(25).                              
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-10-TIPOTEN            PIC X(01).                              
           05  FILLER                   PIC X(01)     VALUE SPACES.             
           05  R1-10-CTIT               PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(01)     VALUE SPACES.             
           05  R1-10-CTITOT1            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-10-CTITOT2            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-10-CTITOT3            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-10-CTITOT4            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
      *                                                                         
       01  R1-11-TOT1.                                                          
           05  FILLER                   PIC X(01)     VALUE SPACES.             
           05  R1-11-NUM-REGS           PIC ZZZ,ZZ9.                            
           05  FILLER                   PIC X(41)     VALUE                     
               '   CLIENTES PROCESADOS        TOTALES:   '.                     
           05  R1-11-TOTTIT             PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(01)     VALUE SPACES.             
           05  R1-11-TITOT1             PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-11-TITOT2             PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-11-TITOT3             PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-11-TITOT4             PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
      *                                                                         
       01  R1-12-TOT2.                                                          
           05  FILLER                   PIC X(38)     VALUE                     
               'TOTAL RESERVA DE PROMOTORES (CONTRATO '.                        
           05  R1-12-ICTARES-N          PIC ZZZZZ9.                             
           05  FILLER                   PIC X(01)     VALUE '-'.                
           05  R1-12-ICTARES-D          PIC 9.                                  
           05  FILLER                   PIC X(02)     VALUE '):'.               
           05  FILLER                   PIC X(17)     VALUE SPACES.             
           05  R1-12-RESTOT1            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-12-RESTOT2            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-12-RESTOT3            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
           05  FILLER                   PIC X(02)     VALUE SPACES.             
           05  R1-12-RESTOT4            PIC ZZ,ZZZ,ZZZ,ZZZ-.                    
      /                                                                         
      *----                                                                     
      *     RUTINA QUE PROPORCIONA EL NUEVO NUMERO DE FOLIO.                    
      *     PARA OBTENER: ICONCEPT, ICONTAB                                     
      *----                                                                     
       01  NF-NUMERO-FOLIO.                                                     
       COPY ZMWBV216.                                                           
      *----                                                                     
      *     RUTINA QUE PROPORCIONA EL NUEVO NUMERO DE FOLIO.                    
      *     PARA OBTENER: IREF (VTB521O)                                        
      *----                                                                     
       01  OP-NUMERO-FOLIO.                                                     
           05  OP-SIGFOLIO              PIC S9(9) COMP-3.                       
      *----                                                                     
      *     PARAMETROS PARA LA RUTINA DE CANCELACION DE ORDENES.                
      *----                                                                     
       COPY ZMWBV032.                                                           
      *                                                                         
      *----                                                                     
      *     RUTINA COSTO PROMEDIO                                               
      *----                                                                     
       COPY ZMWBV200.                                                           
      /                                                                         
      *----                                                                     
      *     PARAMETROS PARA VARIABLES DEL SISTEMA                               
      *----                                                                     
           EXEC SQL                                                             
              INCLUDE ZMWBV356                                                  
           END-EXEC.                                                            
      *----                                                                     
      *    VARIABLES PARA MANEJO DE NULOS                                       
      *----                                                                     
           EXEC SQL                                                             
              INCLUDE ZNCONCEP                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZNCUENTA                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZNCAMCON                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZNPRECIO                                                  
           END-EXEC.                                                            
      *----------------------------                                             
      *     VARIABLES DE NULOS PARA LA TABLA VALORSB                            
      *----------------------------                                             
       01  NL-VALORSB-REG.                                                      
           05  NL-VALORSB-IEMISORA       PIC S9(04) COMP.                       
           05  NL-VALORSB-ISERIE         PIC S9(04) COMP.                       
           05  NL-VALORSB-ICUPON         PIC S9(04) COMP.                       
           05  NL-VALORSB-IINDICE        PIC S9(04) COMP.                       
           05  NL-VALORSB-CINDICE        PIC S9(04) COMP.                       
      *----------------------------                                             
      *    VARIABLES DE NULOS PARA LA TABLA PERIOWR                             
      *----------------------------                                             
       01  NL-PERIOWR-REG.                                                      
           05  NL-PERIOWR-FVIGEN         PIC S9(04) COMP.                       
           05  NL-PERIOWR-FVENC          PIC S9(04) COMP.                       
      *                                                                         
       01  RUT-ZM6RG080                  PIC X(8) VALUE 'ZM6RG080'.             
       01  RUT-ZM6RH971                  PIC X(8) VALUE 'ZM6RH971'.             
       01  RUT-ZM6RG415                  PIC X(8) VALUE 'ZM6RG415'.             
       01  RUT-ZM6RG042                  PIC X(8) VALUE 'ZM6RG042'.             
       01  RUT-ZM6CR200                  PIC X(8) VALUE 'ZM6CR200'.             
                                                                                
      /                                                                         
      *----                                                                     
      *    INCLUDE'S A ESTRUCTURA REGISTRO DE TABLAS DE DB2                     
      *----                                                                     
           EXEC SQL                                                             
              INCLUDE SQLCA                                                     
           END-EXEC.                                                            
      *                                                                         
           EXEC SQL                                                             
              INCLUDE ZEMPRESA                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZREGEMOP                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZCONCEPT                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZAPLIDER                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZPETROBO                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZTASASRF                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZEJEACCI                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZCUENTA                                                   
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZCARTERA                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZTIPCAMB                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZPARAM                                                    
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZCAMCONC                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZPRECIO                                                   
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZDEFOPER                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZCTLPROC                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZGPOCONC                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZAGPOCON                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZWARRANT                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZVALORSB                                                  
           END-EXEC.                                                            
           EXEC SQL                                                             
              INCLUDE ZPERIOWR                                                  
           END-EXEC.                                                            
      /                                                                         
      *----                                                                     
      *    DECLARACION DE CURSORES: EJEACCI, PRECIO Y CARTERA.                  
      *    REGEMOP                                                              
      *----                                                                     
      *                                                                         
           EXEC SQL                                                             
              DECLARE  C500-EJEACCI CURSOR FOR                                  
              SELECT   IOEMISOR, IOSERIE, IOCUPON,                              
                       CTITOTOR, CCUPONES, SCAPITAL,                            
      *O-1.2.2.INI                                                              
      *                POTORG, FSIST, ICRITED                                   
                       POTORG, FSIST, ICRITED, FACTOR_CC,                       
                       OPCION                                                   
      *O-1.2.2.FIN                                                              
              FROM     EJEACCI                                                  
              WHERE    ICONCEPT = :DCLEJEACCI.ICONCEPT AND                      
                       ITIPODER = :DCLEJEACCI.ITIPODER                          
              ORDER BY FSIST                                                    
           END-EXEC.                                                            
      *                                                                         
           EXEC SQL                                                             
              DECLARE  C540-PRECIO CURSOR FOR                                   
              SELECT   ICONCEPT, IEMISORA, ISERIE,   ICUPON,                    
                       FPRECIO,  HPRECIO,  MPRECOMP, MPREVTA,                   
                       MVALCURV, ACURVA,   MINTCORR, CDIASTRA,                  
                       AREND,    ARENDS,   ARENDP,   ARENDPS,                   
                       ACOSCASA, ACOSFPRO, ICONCEXP                             
              FROM     PRECIO                                                   
              WHERE    ICONCEPT = :DCLPRECIO.ICONCEPT                           
              ORDER BY FPRECIO DESC, HPRECIO DESC                               
           END-EXEC.                                                            
      *                                                                         
           EXEC SQL                                                             
              DECLARE  C140-PRECIO-SI CURSOR FOR                                
              SELECT   ICONCEPT, VALUE(IEMISORA,' '), VALUE(ISERIE,' '),        
                       VALUE(ICUPON,0), FPRECIO, HPRECIO, MPRECOMP,             
                       VALUE(MPREVTA,0),  VALUE(MVALCURV,0),                    
                       VALUE(ACURVA,0),   VALUE(MINTCORR,0),                    
                       VALUE(CDIASTRA,0),  VALUE(AREND,0),                      
                       VALUE(ARENDS,0),   VALUE(ARENDP,0),                      
                       VALUE(ARENDPS,0),  VALUE(ACOSCASA,0),                    
                       VALUE(ACOSFPRO,0), ICONCEXP                              
              FROM     PRECIO                                                   
              WHERE    ICONCEPT = :DCLPRECIO.ICONCEPT                           
              AND      FPRECIO  >= :DCLPRECIO.FPRECIO                           
              ORDER BY FPRECIO DESC, HPRECIO DESC                               
           END-EXEC.                                                            
      *                                                                         
           EXEC SQL                                                             
              DECLARE   C580-CARTERA CURSOR FOR                                 
              SELECT   A.ICONCEPT, VALUE(A.CTITEFE,0), A.ICUENTA,               
                       A.ITIPOSDO, A.ITIPOTEN, A.IDIACAR,                       
                       A.MCPROEXI, VALUE(A.ICVEOPES,0),                         
                       VALUE(A.IFOLOPES,0), FULACCPP, MCPPFA,                   
                       MCPPBP                                                   
              FROM     CARTERA A, CUENTA B                                      
              WHERE    A.ICONCEPT = :DCLCARTERA.ICONCEPT   AND                  
                      (A.IDIACAR  = 1 OR                                        
                       A.ITIPOTEN IN ('E', 'J', 'H', 'S','O', 'G')) AND         
                     ((A.ICUENTA > :DCLCARTERA.ICUENTA)   OR                    
                      (A.ICUENTA  = :DCLCARTERA.ICUENTA    AND                  
                       A.ITIPOTEN > :DCLCARTERA.ITIPOTEN)  OR                   
                      (A.ICUENTA  = :DCLCARTERA.ICUENTA    AND                  
                       A.ITIPOTEN = :DCLCARTERA.ITIPOTEN   AND                  
                       A.IFOLOPES > :DCLCARTERA.IFOLOPES)  OR                   
                      (A.ICUENTA  = :DCLCARTERA.ICUENTA    AND                  
                       A.ITIPOTEN = :DCLCARTERA.ITIPOTEN   AND                  
                       A.IFOLOPES = :DCLCARTERA.IFOLOPES   AND                  
                       A.ICVEOPES > :DCLCARTERA.ICVEOPES)) AND                  
                       A.ICUENTA  =  B.ICUENTA             AND                  
                       B.ISUCCASA <> :W000-SUCURSAL        AND                  
                       A.CTITEFE  <> 0                                          
              ORDER BY A.ICUENTA, A.ITIPOTEN DESC, A.IDIACAR,                   
                       A.IFOLOPES, A.ICVEOPES                                   
           END-EXEC.                                                            
      *                                                                         
           EXEC SQL                                                             
                DECLARE C520-CARTERA CURSOR FOR                                 
                SELECT CTITEFE,                                                 
                       MCPROEXI,                                                
                       FULACCPP,                                                
                       MCPPFA,                                                  
                       MCPPBP                                                   
                FROM   CARTERA                                                  
                WHERE  ICUENTA  = :W110-ICUENTA  AND                            
                       ICONCEPT = :W110-ICONCEPT AND                            
                       ITIPOTEN = :W110-ITIPOTEN AND                            
                       IDIACAR  = :W110-IDIACAR  AND                            
                       IFOLOPES = :W110-IFOLOPES AND                            
                       ICVEOPES = :W110-ICVEOPES                                
           END-EXEC.                                                            
           EXEC SQL                                                             
               DECLARE C521-TASASRF CURSOR FOR                                  
               SELECT  ICONCEPT,                                                
                       ISEC,                                                    
                       CMESPAGO,                                                
                       SANONAT,                                                 
                       IULTMES,                                                 
                       ATASBRUT,                                                
                       SVIGEN,                                                  
                       FAMORTIZ,                                                
                       PAMORTIZ,                                                
                       SIMPTO,                                                  
                       DVIGTAS,                                                 
                       FVENCTA,                                                 
                       ATASNOMI                                                 
               FROM TASASRF                                                     
               WHERE ICONCEPT = :DCLTASASRF.ICONCEPT                            
               ORDER BY ISEC DESC                                               
           END-EXEC.                                                            
           EXEC SQL                                                             
               DECLARE C522-PETROBO CURSOR FOR                                  
               SELECT  ICONCEPT,                                                
                       ISEC,                                                    
                       PPETROCE,                                                
                       MPRECBAR,                                                
                       ARENDI,                                                  
                       CMESPAGO,                                                
                       SVIGEN,                                                  
                       FAMORTIZ,                                                
                       SIMPTO                                                   
               FROM PETROBO                                                     
               WHERE ICONCEPT = :DCLPETROBO.ICONCEPT                            
               ORDER BY ISEC DESC                                               
           END-EXEC.                                                            
           EXEC SQL                                                             
               DECLARE C523-WARRANT CURSOR FOR                                  
               SELECT  ICONCEPT,                                                
                       ITIPOWAR,                                                
                       STIPOEJE,                                                
                       MPRIMAW,                                                 
                       CTITINF,                                                 
                       CTITLOT,                                                 
                       CTITSUP,                                                 
                       ITIPSUB,                                                 
                       MPROSUB,                                                 
                       IAGECOL,                                                 
                       IREPCOM,                                                 
                       ICUENTA,                                                 
                       ECARESP                                                  
               FROM WARRANT                                                     
               WHERE ICONCEPT = :DCLWARRANT.ICONCEPT                            
               ORDER BY ICONCEPT                                                
           END-EXEC.                                                            
      *----                                                                     
           EXEC SQL                                                             
               DECLARE C524-VALORSB CURSOR FOR                                  
               SELECT  ICONCEPT,                                                
                       ICONCEP1,                                                
                       IEMISORA,                                                
                       ISERIE,                                                  
                       ICUPON,                                                  
                       IINDICE,                                                 
                       CINDICE,                                                 
                       PPORPAR                                                  
               FROM VALORSB                                                     
               WHERE ICONCEPT = :DCLVALORSB.ICONCEPT                            
               ORDER BY ICONCEP1                                                
           END-EXEC.                                                            
      *----                                                                     
           EXEC SQL                                                             
               DECLARE C525-PERIOWR CURSOR FOR                                  
               SELECT  ICONCEPT,                                                
                       FVIGEN,                                                  
                       FVENC                                                    
               FROM PERIOWR                                                     
               WHERE ICONCEPT = :DCLPERIOWR.ICONCEPT                            
               ORDER BY ICONCEPT                                                
           END-EXEC.                                                            
      /                                                                         
      *----                                                                     
      *    PROCEDURE DIVISION.                                                  
      *    000-INICIO PROGRAMA ESTANDAR                                         
      *----                                                                     
           EXEC SQL                                                             
              INCLUDE ZMWBP025                                                  
           END-EXEC.                                                            
           PERFORM 010-INICIO.                                                  
       000-0200-CICLO.                                                          
           IF S580-EDO-CARTERA = '1'                                            
             GO TO 000-9000-TERMINA.                                            
           PERFORM 050-PROCESA-CARTERA                                          
           GO TO 000-0200-CICLO.                                                
       000-9000-TERMINA.                                                        
           PERFORM 200-TERMINA                                                  
       COPY ZMWBP023.                                                           
      /                                                                         
       010-INICIO SECTION.                                                      
       010-0100-INICIO.                                                         
           MOVE ' '                    TO S700-EDO-R1                           
           MOVE ' '                    TO S000-EDO-PARAM                        
           MOVE ' '                    TO I140-ID-FPRECIO-LEI                   
           MOVE ' '                    TO I140-ID-FPRECIO-ANT                   
           OPEN INPUT ARCH-PT-PARAM                                             
           MOVE '0'                    TO S000-EDO-PARAM                        
           READ ARCH-PT-PARAM   INTO Z800-REG-DATOS  AT END                     
                MOVE '1' TO S000-EDO-PARAM                                      
           END-READ                                                             
           IF S000-EDO-PARAM = '1'                                              
             DISPLAY W000-PROG '  NO EXISTEN PARAMETROS DE ENTRADA '            
             PERFORM 980-ABORTA                                                 
           ELSE                                                                 
              MOVE  WS-REG-PARAM  (48:1)                                        
                    TO  WS-SBLOQUEO                                             
              DISPLAY W000-PROG '  Z800-REG-DATOS (' Z800-REG-DATOS ')'         
              INSPECT Z800-PAR-EMP-OPER REPLACING ALL                           
                                  LOW-VALUES BY SPACES                          
              MOVE Z800-PAR-EMP-OPER          TO WS-EMPRESA                     
              EVALUATE Z800-PAR-EMP-OPER                                        
                  WHEN SPACES                                                   
                       MOVE 'CBP'             TO WS-EMPRESA2                    
                  WHEN 'CBP'                                                    
                       MOVE SPACES            TO WS-EMPRESA2                    
                  WHEN OTHER                                                    
                       MOVE Z800-PAR-EMP-OPER TO WS-EMPRESA2                    
              END-EVALUATE                                                      
           END-IF.                                                              
           CLOSE ARCH-PT-PARAM                                                  
           MOVE ' '                    TO  S000-EDO-PARAM.                      
      *                                                                         
           OPEN  OUTPUT  ARCH-A3-CURSORES                                       
              IF W000-ARCH-A3-ST      NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL ABRIR ARCHIVO ARCH-A3-CURSORES'             
                 DISPLAY W000-PROG ' FILE STATUS :' W000-ARCH-A3-ST             
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
           OPEN  OUTPUT  ARCH-A4-CARTERA                                        
              IF W000-ARCH-A4-ST      NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL ABRIR ARCHIVO ARCH-A4-CARTERA'              
                 DISPLAY W000-PROG ' FILE STATUS :' W000-ARCH-A4-ST             
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
           OPEN  OUTPUT  ARCH-A5-OPERAVA                                        
              IF W000-ARCH-A5-ST      NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL ABRIR ARCHIVO ARCH-A5-OPERAVA'              
                 DISPLAY W000-PROG ' FILE STATUS :' W000-ARCH-A5-ST             
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
           OPEN  OUTPUT  ARCH-A6-ZMDT701                                        
              IF W000-ARCH-A6-ST      NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL ABRIR ARCHIVO ARCH-A6-ZMDT701'              
                 DISPLAY W000-PROG ' FILE STATUS :' W000-ARCH-A6-ST             
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
      *                                                                         
      *----                                                                     
      *    RUTINA QUE TRAE LA FECHA DEL PROCESO.                                
      *----                                                                     
           CALL RUT-ZM6RG415           USING VS-P05-PARAM                       
      *----                                                                     
      *    MUEVE VARIABLES AL ENCABEZADO.                                       
      *----                                                                     
           IF Z800-ITIPOPRO = 'P'                                               
             MOVE R1-04-TIPOPRO-P      TO R1-04-TIPOPRO.                        
           IF Z800-ITIPOPRO = 'D'                                               
             MOVE R1-04-TIPOPRO-D      TO R1-04-TIPOPRO.                        
           IF Z800-ITIPODER = 9                                                 
             MOVE R1-TIT-TIPODER-C     TO R1-TIT-TIPODER.                       
           IF Z800-ITIPODER = 10                                                
             MOVE R1-TIT-TIPODER-S     TO R1-TIT-TIPODER.                       
           IF Z800-ITIPODER = 11                                                
             MOVE R1-TIT-TIPODER-R     TO R1-TIT-TIPODER.                       
       010-0150-ACTUALIZA-APLIDER.                                              
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLAPLIDER                
           MOVE Z800-ITIPODER          TO ITIPODER OF DCLAPLIDER                
           MOVE ' '                    TO ITIPOPRO OF DCLAPLIDER                
           MOVE W000-PROG              TO IUSERAUT OF DCLAPLIDER                
           MOVE SPACES                 TO ITERM    OF DCLAPLIDER                
      *--- BUSCA SI ES CANJE NORMAL O DIVIDENDO OPCIONAL                        
           MOVE 'DVO'                  TO ITIPOPAR OF DCLPARAM                  
           MOVE Z800-ICONCEPT          TO IPARAM   OF DCLPARAM                  
           PERFORM 565-LEE-PARAM                                                
           PERFORM 600-ACTUALIZA-APLIDER.                                       
       010-0155-CHECA-SI.                                                       
           MOVE '0'                    TO S010-SI                               
           MOVE '0'                    TO S010-WARR                             
           MOVE Z800-ICONCEPT       TO ICONCEPT OF DCLCONCEPT                   
           PERFORM 530-LEE-CONCEPT                                              
           IF ITIPOEMI OF DCLCONCEPT = 'SI1'                                    
              MOVE '1'              TO S010-SI                                  
           END-IF                                                               
      *----                                                                     
      *      ALMACENA DATOS DE CONCEPT DE LA EMISORA QUE OTORGA                 
      *----                                                                     
           MOVE IEMISORA OF DCLCONCEPT TO I530-ID-IEMISORA-OTORGA               
                                          IOEMISOR OF DCLAPLIDER                
                                          INEMISOR OF DCLAPLIDER                
           MOVE ISERIE   OF DCLCONCEPT TO I530-ID-ISERIE-OTORGA                 
                                          IOSERIE  OF DCLAPLIDER                
                                          INSERIE  OF DCLAPLIDER                
           MOVE ICUPON   OF DCLCONCEPT TO I530-ID-ICUPON-OTORGA                 
                                          IOCUPON  OF DCLAPLIDER                
                                          INCUPON  OF DCLAPLIDER                
           MOVE P05FECHO               TO FEJERCIC OF DCLAPLIDER                
           DISPLAY 'FEJERCIC>>' FEJERCIC OF DCLAPLIDER                          
           MOVE SPACES   TO   S000-EDO-APLIDER                                  
           PERFORM 568-LEE-APLIDER.                                             
       010-0200-ABRE-CRS-EJEACCI.                                               
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLEJEACCI                
      *O-1.2.2.INI                                                              
           MOVE Z800-IEMISORA          TO IOEMISOR OF DCLEJEACCI                
           MOVE Z800-ISERIE            TO IOSERIE  OF DCLEJEACCI                
           MOVE Z800-ICUPON            TO IOCUPON  OF DCLEJEACCI                
      *O-1.2.2.FIN                                                              
           MOVE ITIPODER OF DCLAPLIDER TO ITIPODER OF DCLEJEACCI                
           EXEC SQL                                                             
               OPEN C500-EJEACCI                                                
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               DISPLAY W000-PROG ' ERROR AL ABRIR CURSOR C500-EJEACCI'          
               DISPLAY ' ICONCEPT (' ICONCEPT OF DCLEJEACCI ')'                 
               DISPLAY ' ITIPODER (' ITIPODER OF DCLEJEACCI ')'                 
      *O-1.2.2.INI                                                              
               DISPLAY ' IOEMISOR (' IOEMISOR OF DCLEJEACCI ')'                 
               DISPLAY ' IOSERIE  (' IOSERIE  OF DCLEJEACCI ')'                 
               DISPLAY ' IOCUPON  (' IOCUPON  OF DCLEJEACCI ')'                 
      *O-1.2.2.FIN                                                              
               PERFORM 970-SQL-ERROR.                                           
           MOVE '0'                    TO S500-EDO-EJEACCI                      
           MOVE 0                      TO T010-NUM-ELEM                         
           PERFORM 500-LEE-EJEACCI.                                             
       010-0250-CICLO-LECT-EJEACCI.                                             
           IF S500-EDO-EJEACCI = '1'                                            
             GO TO 010-0300-CONTINUA.                                           
           ADD  1 TO T010-NUM-ELEM                                              
      *O-1.2.2.INI                                                              
      *    PERFORM 551-OBT-PARAM-H06                                            
      *O-1.2.2.FIN                                                              
           MOVE IOEMISOR OF DCLEJEACCI TO T010-IOEMISOR(T010-NUM-ELEM)          
           MOVE IOSERIE  OF DCLEJEACCI TO T010-IOSERIE (T010-NUM-ELEM)          
           MOVE IOCUPON  OF DCLEJEACCI TO T010-IOCUPON (T010-NUM-ELEM)          
           MOVE POTORG   OF DCLEJEACCI TO T010-POTORG  (T010-NUM-ELEM)          
      *TMP INI                                                                  
      *****MOVE PORCPP   OF DCLEJEACCI TO T010-PORCPP  (T010-NUM-ELEM)          
                                                                                
      *O-1.2.2.INI                                                              
      *    MOVE W000-PORCPP-N          TO T010-PORCPP  (T010-NUM-ELEM)          
                                                                                
           IF OPCION    OF DCLEJEACCI = 'E'                                     
              MOVE 'S'               TO WS-SW-PORC-COSTO-PROM                   
              MOVE FACTOR-CC OF DCLEJEACCI TO W000-PORCPP-N                     
              MOVE W000-PORCPP-N         TO T010-PORCPP  (T010-NUM-ELEM)        
           ELSE                                                                 
              MOVE 'N'                     TO WS-SW-PORC-COSTO-PROM             
           END-IF                                                               
                                                                                
           IF WS-SW-PORC-COSTO-PROM = 'N'                                       
              MOVE POTORG OF DCLEJEACCI  TO W000-PORCPP-N                       
              MOVE W000-PORCPP-N         TO T010-PORCPP  (T010-NUM-ELEM)        
           END-IF                                                               
      *O-1.2.2.FIN                                                              
                                                                                
      *TMP FIN                                                                  
           PERFORM 020-MOV-VALS-EJEACCI                                         
           MOVE IOEMISOR OF DCLEJEACCI TO IEMISORA OF DCLCONCEPT                
           MOVE IOSERIE  OF DCLEJEACCI TO ISERIE   OF DCLCONCEPT                
           MOVE IOCUPON  OF DCLEJEACCI TO ICUPON   OF DCLCONCEPT                
           MOVE P05FECHO               TO FALTA    OF DCLCONCEPT                
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           MOVE 0                   TO T000-TITOT-I-EMP1(T010-NUM-ELEM)         
                                       T000-TITOT-I-EMP2(T010-NUM-ELEM)         
           MOVE 0                      TO T000-TITOT-G(T010-NUM-ELEM)           
           MOVE 0                      TO T000-RESERVA(T010-NUM-ELEM)           
           IF S010-SI = '1'                                                     
              PERFORM 513-LEE-CONCEPT-SI                                        
              PERFORM 130-OBTEN-PRECIO-SI                                       
           ELSE                                                                 
              IF S000-EDO-APLIDER = '0'                                         
                 PERFORM  510-LEE-CONCEPT                                       
              ELSE                                                              
                 PERFORM  515-ALT-CONCEPT                                       
              END-IF                                                            
           END-IF                                                               
           IF Z800-ITIPOPRO = 'D'                                               
              PERFORM 150-GRABA-A3-CURSORES                                     
           END-IF                                                               
           PERFORM 500-LEE-EJEACCI                                              
           GO TO 010-0250-CICLO-LECT-EJEACCI.                                   
       010-0300-CONTINUA.                                                       
           EXEC SQL                                                             
                CLOSE C500-EJEACCI                                              
           END-EXEC.                                                            
           MOVE ' '                    TO S500-EDO-EJEACCI                      
           IF T010-SCAPITAL = 'N'                                               
              MOVE SPACES               TO R1-05-CAPI                           
           ELSE                                                                 
              MOVE 'POR CAPITALIZACION' TO R1-05-CAPI.                          
           IF Z800-ITIPODER = 9                                                 
              MOVE W000-IOPERA-C        TO IOPERA OF DCLDEFOPER                 
              GO TO 010-0350-INICIALIZA-VARS.                                   
           IF Z800-ITIPODER = 10                                                
              AND T010-SCAPITAL = 'N'                                           
              MOVE W000-IOPERA-S        TO IOPERA OF DCLDEFOPER                 
              GO TO 010-0350-INICIALIZA-VARS.                                   
           IF Z800-ITIPODER = 10                                                
              AND T010-SCAPITAL = 'S'                                           
              MOVE W000-IOPERA-SC       TO IOPERA OF DCLDEFOPER                 
              GO TO 010-0350-INICIALIZA-VARS.                                   
           IF Z800-ITIPODER = 11                                                
              AND T010-SCAPITAL = 'N'                                           
              MOVE W000-IOPERA-R        TO IOPERA OF DCLDEFOPER                 
              GO TO 010-0350-INICIALIZA-VARS.                                   
           IF Z800-ITIPODER = 11                                                
              AND T010-SCAPITAL = 'S'                                           
              MOVE W000-IOPERA-RC       TO IOPERA OF DCLDEFOPER                 
              GO TO 010-0350-INICIALIZA-VARS.                                   
       010-0350-INICIALIZA-VARS.                                                
           PERFORM 505-LEE-DEFOPER                                              
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLCONCEPT                
           PERFORM 530-LEE-CONCEPT                                              
           MOVE IEMISORA OF DCLCONCEPT TO R1-TIT-IEMISORA                       
           MOVE ISERIE   OF DCLCONCEPT TO R1-TIT-ISERIE                         
           MOVE ICUPON   OF DCLCONCEPT TO R1-TIT-ICUPON                         
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLPRECIO                 
           PERFORM 540-LEE-PRECIO                                               
      *                                                                         
           OPEN OUTPUT REPO-R1-CASPRE                                           
      *--- PROVISONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES                
                       REPO-R2-BCMPRE                                           
           MOVE '0'                    TO S700-EDO-R1                           
           MOVE R1-MAX-LIN             TO R1-NUM-LIN                            
                                          R2-NUM-LIN                            
           MOVE 0                      TO R1-NUM-HOJA                           
                                          R2-NUM-HOJA                           
           MOVE LOW-VALUES             TO I050-ID-PROC                          
           MOVE LOW-VALUES             TO I580-ID-LEI                           
      *----                                                                     
      *    LEE CONSTANTES DEL PROGRAMA.                                         
      *----                                                                     
           MOVE SPACES                 TO T47-REG                               
           MOVE 1                      TO T47-SEC                               
           PERFORM 550-LEE-PARAMT47                                             
           MOVE T47-DATOSPAR           TO T550-DATOSPAR.                        
                                                                                
           MOVE SPACES                 TO T47-REG                               
           MOVE 2                      TO T47-SEC                               
           PERFORM 550-LEE-PARAMT47                                             
           MOVE T47-DATOSPAR           TO T085-DATOSPAR-ITIPOVAL.               
                                                                                
           MOVE SPACES                 TO T47-REG                               
           MOVE 3                      TO T47-SEC                               
           PERFORM 550-LEE-PARAMT47                                             
           MOVE T47-DATOSPAR           TO T087-DATOSPAR-ITIPOVAL.               
                                                                                
      *--  PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           MOVE 0                      TO A000-CTITCART-EMP1                    
                                          A000-CTITCART-EMP2.                   
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
       010-0400-LEE-ICTA-RESPROM.                                               
           INITIALIZE                     DCLPARAM                              
           MOVE 'P65'                  TO ITIPOPAR OF DCLPARAM                  
           MOVE Z800-PAR-SUC-OPER      TO IPARAM OF DCLPARAM                    
           PERFORM 560-LEE-PARAMP65                                             
           MOVE W560-ICUENTA           TO WS-CTA-RESERVA-EMP1                   
           INITIALIZE                     DCLPARAM                              
           MOVE 'P65'                  TO ITIPOPAR OF DCLPARAM                  
           MOVE 'T08'                  TO IPARAM   OF DCLPARAM                  
           PERFORM 560-LEE-PARAMP65                                             
           MOVE W560-ICUENTA           TO WS-CTA-RESERVA-EMP2.                  
       010-0450-CANCELA-ORDENES.                                                
           IF Z800-ITIPOPRO = 'D'                                               
              MOVE IEMISORA OF DCLCONCEPT TO CA-IEMISORA                        
              MOVE ISERIE   OF DCLCONCEPT TO CA-ISERIE                          
              MOVE ICUPON   OF DCLCONCEPT TO CA-ICUPON                          
              CALL RUT-ZM6RH971        USING CA-REG                             
              MOVE CA-NUM-ACT             TO A990-NUM-ACT-ORDENES               
           ELSE                                                                 
              MOVE 0                      TO A990-NUM-ACT-ORDENES.              
       010-0500-INICIA-PROCESO.                                                 
           PERFORM 040-ABRE-CURSOR                                              
           PERFORM 580-LEE-CARTERA.                                             
       010-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       020-MOV-VALS-EJEACCI SECTION.                                            
       020-0100-INICIO.                                                         
           IF T010-NUM-ELEM = 1                                                 
             MOVE CTITOTOR OF DCLEJEACCI                                        
                                       TO R1-05-DAR                             
             MOVE CCUPONES OF DCLEJEACCI                                        
                                       TO R1-05-CADA                            
             MOVE ICRITED  OF DCLEJEACCI                                        
                                       TO R1-TIT-ICRITED                        
             MOVE CTITOTOR OF DCLEJEACCI                                        
                                       TO T010-CTITOTOR                         
             MOVE CCUPONES OF DCLEJEACCI                                        
                                       TO T010-CCUPONES                         
             MOVE SCAPITAL OF DCLEJEACCI                                        
                                       TO T010-SCAPITAL                         
             MOVE ICRITED  OF DCLEJEACCI                                        
                                       TO T010-ICRITED                          
             MOVE 'CANT.'              TO R1-07-CANT-1                          
             MOVE IOEMISOR OF DCLEJEACCI                                        
                                       TO R1-07-IEMI-1                          
             MOVE IOSERIE OF DCLEJEACCI                                         
                                       TO R1-08-ISER-1                          
             MOVE IOCUPON OF DCLEJEACCI                                         
                                       TO R1-08-ICUP-1                          
             MOVE POTORG OF DCLEJEACCI TO R1-09-PCTJ-1                          
             MOVE SPACES               TO R1-09-PCTJ-2-E                        
             MOVE SPACES               TO R1-09-PCTJ-3-E                        
             MOVE SPACES               TO R1-09-PCTJ-4-E                        
             MOVE ' %'                 TO R1-09-SIGN-1                          
      *TMP INI                                                                  
      *******MOVE PORCPP OF DCLEJEACCI TO R1-09-PCPP-1                          
             MOVE W000-PORCPP-N        TO R1-09-PCPP-1                          
      *TMP FIN                                                                  
             MOVE SPACES               TO R1-09-PCPP-2-E                        
             MOVE SPACES               TO R1-09-PCPP-3-E                        
             MOVE SPACES               TO R1-09-PCPP-4-E                        
             MOVE ' %'                 TO R1-09-SIGN-1-PCPP                     
             GO TO 020-9900-FIN.                                                
           IF T010-NUM-ELEM = 2                                                 
             MOVE 'CANT.'              TO R1-07-CANT-2                          
             MOVE IOEMISOR OF DCLEJEACCI                                        
                                       TO R1-07-IEMI-2                          
             MOVE IOSERIE OF DCLEJEACCI                                         
                                       TO R1-08-ISER-2                          
             MOVE IOCUPON OF DCLEJEACCI                                         
                                       TO R1-08-ICUP-2                          
             MOVE POTORG OF DCLEJEACCI TO R1-09-PCTJ-2                          
             MOVE ' %'                 TO R1-09-SIGN-2                          
      *TMP INI                                                                  
      *******MOVE PORCPP OF DCLEJEACCI TO R1-09-PCPP-2                          
             MOVE W000-PORCPP-N        TO R1-09-PCPP-2                          
      *TMP FIN                                                                  
             MOVE ' %'                 TO R1-09-SIGN-2-PCPP                     
             GO TO 020-9900-FIN.                                                
           IF T010-NUM-ELEM = 3                                                 
             MOVE 'CANT.'              TO R1-07-CANT-3                          
             MOVE IOEMISOR OF DCLEJEACCI                                        
                                       TO R1-07-IEMI-3                          
             MOVE IOSERIE OF DCLEJEACCI                                         
                                       TO R1-08-ISER-3                          
             MOVE IOCUPON OF DCLEJEACCI                                         
                                       TO R1-08-ICUP-3                          
             MOVE POTORG OF DCLEJEACCI TO R1-09-PCTJ-3                          
             MOVE ' %'                 TO R1-09-SIGN-3                          
      *TMP INI                                                                  
      *******MOVE PORCPP OF DCLEJEACCI TO R1-09-PCPP-3                          
             MOVE W000-PORCPP-N        TO R1-09-PCPP-3                          
      *TMP FIN                                                                  
             MOVE ' %'                 TO R1-09-SIGN-3-PCPP                     
             GO TO 020-9900-FIN.                                                
           IF T010-NUM-ELEM = 4                                                 
             MOVE 'CANT.'              TO R1-07-CANT-4                          
             MOVE IOEMISOR OF DCLEJEACCI                                        
                                       TO R1-07-IEMI-4                          
             MOVE IOSERIE OF DCLEJEACCI                                         
                                       TO R1-08-ISER-4                          
             MOVE IOCUPON OF DCLEJEACCI                                         
                                       TO R1-08-ICUP-4                          
             MOVE POTORG OF DCLEJEACCI TO R1-09-PCTJ-4                          
             MOVE ' %'                 TO R1-09-SIGN-4                          
      *TMP INI                                                                  
      *******MOVE PORCPP OF DCLEJEACCI TO R1-09-PCPP-4                          
             MOVE W000-PORCPP-N        TO R1-09-PCPP-4                          
      *TMP FIN                                                                  
             MOVE ' %'                 TO R1-09-SIGN-4-PCPP                     
             GO TO 020-9900-FIN.                                                
       020-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       030-ALTA-ESC-OTORGADA SECTION.                                           
       030-0100-INICIO.                                                         
      *----                                                                     
      *    OBTENCION DEL NUEVO ICONCEPT PARA LA EMISORA OTORGADA.               
      *----                                                                     
           MOVE '19'                   TO NF-ITIPOFOL                           
           CALL RUT-ZM6RG080           USING NF-NUMERO-FOLIO                    
           MOVE NF-SIGFOLIO            TO T010-IOCONCEP(T010-NUM-ELEM).         
      *----                                                                     
       030-0150-ALTA-CONCEPT.                                                   
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLAGPOCON                
           PERFORM 535-LEE-AGPOCON                                              
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLCONCEPT                
           PERFORM 530-LEE-CONCEPT                                              
           MOVE T010-IOEMISOR(T010-NUM-ELEM)                                    
                                       TO IEMISORA OF DCLCONCEPT                
           MOVE T010-IOSERIE(T010-NUM-ELEM)                                     
                                       TO ISERIE   OF DCLCONCEPT                
           MOVE T010-IOCUPON(T010-NUM-ELEM)                                     
                                       TO ICUPON   OF DCLCONCEPT                
           MOVE T010-IOCONCEP(T010-NUM-ELEM)                                    
                                       TO ICONCEPT OF DCLCONCEPT                
           MOVE P05FECHO               TO FCOLOCA  OF DCLCONCEPT                
           MOVE P05FECHO               TO FALTA    OF DCLCONCEPT                
           IF S000-DIV-OPC = '1'                                                
              MOVE 'PROCESO'           TO IUSERAUT OF DCLCONCEPT                
           ELSE                                                                 
              MOVE W000-PROG           TO IUSERAUT OF DCLCONCEPT                
           END-IF                                                               
           MOVE SPACES                 TO ITERM    OF DCLCONCEPT.               
      *----                                                                     
      *    OBTENCION DEL NUEVO ICONTAB PARA LA EMISORA OTORGADA.                
      *----                                                                     
           MOVE '20'                   TO NF-ITIPOFOL                           
           CALL RUT-ZM6RG080           USING NF-NUMERO-FOLIO                    
           MOVE NF-SIGFOLIO            TO ICONTAB  OF DCLCONCEPT                
           MOVE  WS-SBLOQUEO                                                    
                 TO  SBLOQUEO                                                   
                     OF  DCLCONCEPT                                             
           MOVE W000-AUX-ITVBMV        TO ITVBMV   OF DCLCONCEPT                
           PERFORM 620-ALTA-CONCEPT.                                            
              IF ITIPOVAL OF DCLCONCEPT = 55 OR                                 
                 ITIPOVAL OF DCLCONCEPT = 56                                    
                 MOVE '1'              TO S010-WARR                             
              END-IF.                                                           
           IF S535-EDO-AGPOCON = '0'                                            
              MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLAGPOCON             
              PERFORM 625-ALTA-AGPOCON.                                         
       030-0300-ALTA-CAMCONC.                                                   
           PERFORM 035-MOV-CONCCAMC                                             
           MOVE 'A'                    TO STIPOMOV OF DCLCAMCONC                
           PERFORM 630-ALTA-CAMCONC.                                            
       030-0400-ALTA-PRECIO.                                                    
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLPRECIO                 
           PERFORM 540-LEE-PRECIO                                               
           MOVE T010-IOCONCEP(T010-NUM-ELEM)                                    
                                       TO ICONCEPT OF DCLPRECIO                 
           MOVE T010-IOEMISOR(T010-NUM-ELEM)                                    
                                       TO IEMISORA OF DCLPRECIO                 
           MOVE T010-IOSERIE(T010-NUM-ELEM)                                     
                                       TO ISERIE   OF DCLPRECIO                 
           MOVE T010-IOCUPON(T010-NUM-ELEM)                                     
                                       TO ICUPON   OF DCLPRECIO                 
           COMPUTE MPRECOMP OF DCLPRECIO =                                      
               MPRECOMP OF DCLPRECIO * (T010-CCUPONES / T010-CTITOTOR)          
           COMPUTE MPREVTA  OF DCLPRECIO =                                      
               MPREVTA  OF DCLPRECIO * (T010-CCUPONES / T010-CTITOTOR)          
           PERFORM 640-ALTA-PRECIO.                                             
           PERFORM 032-CREA-REGEMOP.                                            
           IF S010-WARR = '1'                                                   
              GO TO 030-0800-WARRANT.                                           
       030-0500-PETROBO-OBLIG.                                                  
           PERFORM 085-VERIFICA-ITIPOVAL                                        
           IF A085-CONT-TVC NOT > T085-NUM-ELEM-TVC                             
              GO TO 030-9900-FIN.                                               
           PERFORM 087-VERIFICA-ITIPOVAL                                        
           IF A087-CONT-TVC NOT > T087-NUM-ELEM-TVC                             
              GO TO 030-0600-ALTA-PETROBO.                                      
              GO TO 030-0700-ALTA-TASASRF.                                      
       030-0600-ALTA-PETROBO.                                                   
           PERFORM 522-LEE-CREA-PETROBO                                         
           GO TO 030-9900-FIN.                                                  
       030-0700-ALTA-TASASRF.                                                   
           PERFORM 521-LEE-CREA-TASASRF                                         
           GO TO 030-9900-FIN.                                                  
       030-0800-WARRANT.                                                        
           IF S010-WARR = '1'                                                   
              PERFORM 523-LEE-CREA-WARRANT                                      
              PERFORM 524-LEE-CREA-VALORSB                                      
              PERFORM 525-LEE-CREA-PERIOWR.                                     
       030-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       032-CREA-REGEMOP SECTION.                                                
       032-0100-INICIO.                                                         
           MOVE Z800-ICONCEPT          TO W032-ICONCEPT                         
           MOVE 1                      TO W032-ISEC.                            
           MOVE W032-ISEC              TO ISEC OF DCLREGEMOP                    
           PERFORM 595-LECTURA-ACT-REGEMOP.                                     
      *                                                                         
       032-0200-CICLO.                                                          
           IF S595-EDO = '1'                                                    
              GO TO 032-9900-FIN.                                               
           MOVE 'B'                    TO SVIGEN   OF DCLREGEMOP                
           PERFORM 596-MODIFICAR-REGEMOP                                        
           MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLREGEMOP                
           MOVE FALTA    OF DCLCONCEPT TO FVIGEN   OF DCLREGEMOP                
           MOVE W000-PROG              TO IUSERAUT OF DCLREGEMOP                
           MOVE ' '                    TO ITERM    OF DCLREGEMOP                
           MOVE 'A'                    TO SVIGEN   OF DCLREGEMOP                
           PERFORM 697-CREA-REGEMOP.                                            
           ADD +1                      TO W032-ISEC.                            
           MOVE W032-ISEC              TO ISEC OF DCLREGEMOP                    
           PERFORM 595-LECTURA-ACT-REGEMOP                                      
           GO TO 032-0200-CICLO.                                                
       032-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       035-MOV-CONCCAMC SECTION.                                                
       035-0100-INICIO.                                                         
           MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLCAMCONC                
           MOVE ECONCEPT OF DCLCONCEPT TO ECONCEPT OF DCLCAMCONC                
           MOVE ITIPOCON OF DCLCONCEPT TO ITIPOCON OF DCLCAMCONC                
           MOVE MVALNOM  OF DCLCONCEPT TO MVALNOM  OF DCLCAMCONC                
           MOVE ICONCEXP OF DCLCONCEPT TO ICONCEXP OF DCLCAMCONC                
           MOVE IEMISORA OF DCLCONCEPT TO IEMISORA OF DCLCAMCONC                
           MOVE ISERIE   OF DCLCONCEPT TO ISERIE   OF DCLCAMCONC                
           MOVE ICUPON   OF DCLCONCEPT TO ICUPON   OF DCLCAMCONC                
           MOVE ICONTAB  OF DCLCONCEPT TO ICONTAB  OF DCLCAMCONC                
           MOVE ICTAPROV OF DCLCONCEPT TO ICTAPROV OF DCLCAMCONC                
           MOVE ICORRO   OF DCLCONCEPT TO ICORRO   OF DCLCAMCONC                
           MOVE ITIPOVAL OF DCLCONCEPT TO ITIPOVAL OF DCLCAMCONC                
           MOVE IVALBM   OF DCLCONCEPT TO IVALBM   OF DCLCAMCONC                
           MOVE FALTA    OF DCLCONCEPT TO FALTA    OF DCLCAMCONC                
           MOVE FBAJA    OF DCLCONCEPT TO FBAJA    OF DCLCAMCONC                
           MOVE FCOLOCA  OF DCLCONCEPT TO FCOLOCA  OF DCLCAMCONC                
           MOVE FVENC    OF DCLCONCEPT TO FVENC    OF DCLCAMCONC                
           MOVE CLOTEMIN OF DCLCONCEPT TO CLOTEMIN OF DCLCAMCONC                
           MOVE ABURSA   OF DCLCONCEPT TO ABURSA   OF DCLCAMCONC                
           MOVE AISR     OF DCLCONCEPT TO AISR     OF DCLCAMCONC                
           MOVE PCOMIS1  OF DCLCONCEPT TO PCOMIS1  OF DCLCAMCONC                
           MOVE MLIMCOM  OF DCLCONCEPT TO MLIMCOM  OF DCLCAMCONC                
           MOVE PCOMIS2  OF DCLCONCEPT TO PCOMIS2  OF DCLCAMCONC                
           MOVE SCOLOCA  OF DCLCONCEPT TO SCOLOCA  OF DCLCAMCONC                
           MOVE SCUBMAR  OF DCLCONCEPT TO SCUBMAR  OF DCLCAMCONC                
           MOVE ITIPOMER OF DCLCONCEPT TO ITIPOMER OF DCLCAMCONC                
           MOVE ITIPOEMI OF DCLCONCEPT TO ITIPOEMI OF DCLCAMCONC                
           MOVE ITIPOLP  OF DCLCONCEPT TO ITIPOLP  OF DCLCAMCONC                
           MOVE SBLOQUEO OF DCLCONCEPT TO SBLOQUEO OF DCLCAMCONC                
           MOVE SVALNOM  OF DCLCONCEPT TO SVALNOM  OF DCLCAMCONC                
           MOVE MVALNOMB OF DCLCONCEPT TO MVALNOMB OF DCLCAMCONC                
           MOVE SLIQEMI  OF DCLCONCEPT TO SLIQEMI  OF DCLCAMCONC                
           MOVE SCUSTOD  OF DCLCONCEPT TO SCUSTOD  OF DCLCAMCONC                
           MOVE ITIPOCLA OF DCLCONCEPT TO ITIPOCLA OF DCLCAMCONC                
           MOVE IUSERAUT OF DCLCONCEPT TO IUSERAUT OF DCLCAMCONC                
           MOVE ITERM    OF DCLCONCEPT TO ITERM    OF DCLCAMCONC                
           MOVE IISIN    OF DCLCONCEPT TO IISIN    OF DCLCAMCONC                
           MOVE SCOMIS   OF DCLCONCEPT TO SCOMIS   OF DCLCAMCONC.               
       035-0150-MOV-NULOS.                                                      
           MOVE NL-CONCEPT-ICONCEXP    TO NL-CAMCONC-ICONCEXP                   
           MOVE NL-CONCEPT-IEMISORA    TO NL-CAMCONC-IEMISORA                   
           MOVE NL-CONCEPT-ISERIE      TO NL-CAMCONC-ISERIE                     
           MOVE NL-CONCEPT-ICUPON      TO NL-CAMCONC-ICUPON                     
           MOVE NL-CONCEPT-ICTAPROV    TO NL-CAMCONC-ICTAPROV                   
           MOVE NL-CONCEPT-ICORRO      TO NL-CAMCONC-ICORRO                     
           MOVE NL-CONCEPT-ITIPOVAL    TO NL-CAMCONC-ITIPOVAL                   
           MOVE NL-CONCEPT-IVALBM      TO NL-CAMCONC-IVALBM                     
           MOVE NL-CONCEPT-FBAJA       TO NL-CAMCONC-FBAJA                      
           MOVE NL-CONCEPT-FVENC       TO NL-CAMCONC-FVENC                      
           MOVE NL-CONCEPT-ABURSA      TO NL-CAMCONC-ABURSA.                    
       035-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       040-ABRE-CURSOR SECTION.                                                 
       040-0100-INICIO.                                                         
           IF Z800-ITIPOPRO = 'P'                                               
              MOVE Z800-ICONCEPT       TO ICONCEPT OF DCLCARTERA                
              MOVE 0                   TO ICUENTA  OF DCLCARTERA                
              MOVE ' '                 TO ITIPOTEN OF DCLCARTERA                
              MOVE 0                   TO IFOLOPES OF DCLCARTERA                
              MOVE 0                   TO ICVEOPES OF DCLCARTERA                
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
              MOVE 0                   TO A000-CLIE-PROC-EMP1                   
                                          A000-CLIE-PROC-EMP2                   
              GO TO 040-0150-ABRE.                                              
           MOVE 'A06'                  TO IAPLICA  OF DCLCTLPROC                
           MOVE ' '                    TO ISUCCASA OF DCLCTLPROC                
           MOVE P05FECHO               TO FEVENTO  OF DCLCTLPROC                
           MOVE Z800-PAR-EMP-PERF      TO IEMPR    OF DCLCTLPROC                
           PERFORM 570-LEE-CTLPROC                                              
           IF S570-LEC-EFECTUADA = '1'                                          
              PERFORM 650-ALTA-CTLPROC                                          
           ELSE                                                                 
              MOVE IULTLLA OF DCLCTLPROC  TO W570-ULTLLA                        
              MOVE IDATO1  OF DCLCTLPROC  TO W570-IDATO1                        
              MOVE IDATO2  OF DCLCTLPROC  TO W570-IDATO2                        
              MOVE IDATO3  OF DCLCTLPROC  TO W570-IDATO3                        
              MOVE IDATO4  OF DCLCTLPROC  TO W570-IDATO4                        
              MOVE IDATO5  OF DCLCTLPROC  TO W570-IDATO5                        
              MOVE IDATO6  OF DCLCTLPROC  TO W570-IDATO6                        
              MOVE IDATO7  OF DCLCTLPROC  TO W570-IDATO7                        
              MOVE IDATO8  OF DCLCTLPROC  TO W570-IDATO8                        
              MOVE IDATO9  OF DCLCTLPROC  TO W570-IDATO9                        
              MOVE IDATO10 OF DCLCTLPROC  TO W570-IDATO10                       
              MOVE IDATO11 OF DCLCTLPROC  TO W570-IDATO11                       
              MOVE W570-EDATOS-C          TO W570-EDATOS.                       
      *O-1.2.2.INI                                                              
      *    MOVE W570-ICONCEPT          TO ICONCEPT OF DCLCARTERA                
           MOVE W570-ICONCEPT          TO W070-AUX-ICONCEPT                     
           MOVE W070-AUX-ICONCEPT      TO ICONCEPT OF DCLCARTERA                
      *O-1.2.2.FIN                                                              
           MOVE W570-ICUENTA           TO ICUENTA  OF DCLCARTERA                
           MOVE W570-ITIPOTEN          TO ITIPOTEN OF DCLCARTERA                
           MOVE W570-IFOLOPES          TO IFOLOPES OF DCLCARTERA                
           MOVE W570-ICVEOPES          TO ICVEOPES OF DCLCARTERA                
           MOVE W570-TITOT-1-EMP1      TO T000-TITOT-I-EMP1(1)                  
           MOVE W570-TITOT-1-EMP2      TO T000-TITOT-I-EMP2(1)                  
           MOVE W570-TITOT-2-EMP1      TO T000-TITOT-I-EMP1(2)                  
           MOVE W570-TITOT-2-EMP2      TO T000-TITOT-I-EMP2(2)                  
           MOVE W570-TITOT-3-EMP1      TO T000-TITOT-I-EMP1(3)                  
           MOVE W570-TITOT-3-EMP2      TO T000-TITOT-I-EMP2(3)                  
           MOVE W570-TITOT-4-EMP1      TO T000-TITOT-I-EMP1(4)                  
           MOVE W570-TITOT-4-EMP2      TO T000-TITOT-I-EMP2(4)                  
           MOVE W570-CLI-PROC-EMP1     TO A000-CLIE-PROC-EMP1                   
           MOVE W570-CLI-PROC-EMP2     TO A000-CLIE-PROC-EMP2                   
           MOVE W570-CTITULOS-EMP1     TO A000-CTITCART-EMP1                    
           MOVE W570-CTITULOS-EMP2     TO A000-CTITCART-EMP2.                   
        040-0150-ABRE.                                                          
           EXEC SQL                                                             
             OPEN C580-CARTERA                                                  
           END-EXEC                                                             
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG ' ERROR AL ABRIR CURSOR C580-CARTERA '           
             DISPLAY ' ICONCEPT(' ICONCEPT OF DCLCARTERA ')'                    
             DISPLAY ' ICUENTA (' ICUENTA  OF DCLCARTERA ')'                    
             DISPLAY ' ITIPOTEN(' ITIPOTEN OF DCLCARTERA ')'                    
             DISPLAY ' IFOLOPES(' IFOLOPES OF DCLCARTERA ')'                    
             DISPLAY ' ICVEOPES(' ICVEOPES OF DCLCARTERA ')'                    
             PERFORM 970-SQL-ERROR.                                             
           MOVE '0'                    TO S580-EDO-CARTERA.                     
       040-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       050-PROCESA-CARTERA SECTION.                                             
       050-0100-INICIO.                                                         
           MOVE I580-ID-LEI            TO I050-ID-PROC                          
           PERFORM 590-LEE-CUENTA.                                              
           MOVE IEMPR    OF DCLCUENTA  TO WS-IEMPR-CTA                          
           MOVE ISUCCASA OF DCLCUENTA  TO WS-IEMPR-SUC                          
           MOVE ISUCCASA OF DCLCUENTA  TO R1-10-ISUC                            
           MOVE IPROM    OF DCLCUENTA  TO R1-10-IPROM                           
           MOVE ICUENTA  OF DCLCUENTA  TO W050-ICUENTA                          
           MOVE W050-ICUENTA-N         TO R1-10-ICUENTA-N                       
           MOVE W050-ICUENTA-D         TO R1-10-ICUENTA-D                       
           MOVE NABREV                 TO R1-10-NABREV                          
           MOVE 0                      TO T050-NUM-ELEM                         
           MOVE 0                      TO W050-TITOTOR                          
           PERFORM 060-INICIALIZA.                                              
       050-0150-CICLO.                                                          
            IF I580-ID-LEI NOT = I050-ID-PROC                                   
            OR (I050-ITIPOTEN = 'T'                                             
              AND T050-NUM-ELEM > 0 )                                           
              GO TO 050-0200-VERIF-GLOBAL.                                      
              ADD 1 TO T050-NUM-ELEM.                                           
              IF T050-NUM-ELEM > T050-MAX-ELEM                                  
                 DISPLAY W000-PROG ' T050 EXCEDE CAPACIDAD: '                   
                 DISPLAY W000-PROG '(' T050-MAX-ELEM ')'                        
                 PERFORM 980-ABORTA.                                            
              MOVE 1                      TO A000-CONT                          
              PERFORM 070-PROCESA-REGISTRO                                      
            PERFORM 580-LEE-CARTERA                                             
            GO TO 050-0150-CICLO.                                               
       050-0200-VERIF-GLOBAL.                                                   
             IF WS-IEMPR-CTA = 'CBP' OR SPACES                                  
               COMPUTE A000-CTITCART-EMP1 =                                     
                       A000-CTITCART-EMP1 + A000-CTITCLIE                       
               PERFORM 080-VERIF-GLOBAL                                         
             ELSE                                                               
               COMPUTE A000-CTITCART-EMP2 =                                     
                       A000-CTITCART-EMP2 + A000-CTITCLIE                       
               PERFORM 081-VERIF-GLOBAL                                         
             END-IF.                                                            
       050-0250-REGISTRA.                                                       
           PERFORM 100-REGISTRA.                                                
       050-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       060-INICIALIZA SECTION.                                                  
       060-0100-INICIO.                                                         
           MOVE 0                      TO A000-CTITCLIE                         
           MOVE 1                      TO A000-CONT.                            
       060-0150-CICLO.                                                          
           IF A000-CONT > T010-NUM-ELEM                                         
             GO TO 060-9900-FIN.                                                
           MOVE 0                      TO T000-CTITOT-I(A000-CONT)              
           MOVE 0                      TO T000-CTITOT-G(A000-CONT)              
           ADD 1 TO A000-CONT                                                   
           GO TO 060-0150-CICLO.                                                
       060-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       070-PROCESA-REGISTRO SECTION.                                            
       070-0100-INICIO.                                                         
           MOVE ITIPOTEN OF DCLCARTERA TO T050-ITIPOTEN(T050-NUM-ELEM)          
           MOVE IDIACAR  OF DCLCARTERA TO T050-IDIACAR (T050-NUM-ELEM)          
           MOVE CTITEFE  OF DCLCARTERA TO T050-CTITULOS(T050-NUM-ELEM)          
           MOVE IFOLOPES OF DCLCARTERA TO T050-IFOLOPES(T050-NUM-ELEM)          
           MOVE ICVEOPES OF DCLCARTERA TO T050-ICVEOPES(T050-NUM-ELEM)          
           MOVE MCPROEXI OF DCLCARTERA TO T050-MCPROEXI(T050-NUM-ELEM)          
           MOVE MCPPFA   OF DCLCARTERA TO T050-MCPPFA(T050-NUM-ELEM)            
           MOVE MCPPBP   OF DCLCARTERA TO T050-MCPPBP(T050-NUM-ELEM)            
           MOVE FULACCPP OF DCLCARTERA TO T050-FULACCPP(T050-NUM-ELEM)          
              COMPUTE A000-CTITCLIE = A000-CTITCLIE +                           
                                   CTITEFE OF DCLCARTERA.                       
       070-0150-CICLO.                                                          
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 070-9900-FIN.                                               
           IF T010-ICRITED = 'TT'                                               
              COMPUTE W070-RESULT = T050-CTITULOS(T050-NUM-ELEM)                
                                  / T010-CCUPONES                               
              COMPUTE T050-TITOTOR(T050-NUM-ELEM, A000-CONT) =                  
                                    W070-RESULT                                 
                                  * T010-CTITOTOR                               
                                  * T010-POTORG(A000-CONT)                      
                                  / 100                                         
              GO TO 070-0200-CONTINUA.                                          
           IF T010-ICRITED = 'RR'                                               
              GO TO 070-0150-RR.                                                
           IF T010-ICRITED = 'TR'                                               
              GO TO 070-0160-TR.                                                
              GO TO 070-0200-CONTINUA.                                          
       070-0150-RR.                                                             
              COMPUTE W000-AUXILIAR =                                           
                 (T050-CTITULOS(T050-NUM-ELEM) / T010-CCUPONES)                 
              IF W000-AUXILIAR > 0                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR + 0.5                      
              ELSE                                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR - 0.5                      
              END-IF.                                                           
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              IF W000-AUXILIAR > 0                                              
                 COMPUTE T050-TITOTOR(T050-NUM-ELEM, A000-CONT)=                
                  W000-AUXILIAR + 0.5                                           
              ELSE                                                              
                 COMPUTE T050-TITOTOR(T050-NUM-ELEM, A000-CONT)=                
                  W000-AUXILIAR - 0.5.                                          
              GO TO 070-0200-CONTINUA.                                          
       070-0160-TR.                                                             
              COMPUTE W070-RESULT =                                             
                 T050-CTITULOS(T050-NUM-ELEM) / T010-CCUPONES                   
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              MOVE W000-AUXILIAR   TO                                           
                   T050-TITOTOR(T050-NUM-ELEM, A000-CONT)                       
              GO TO 070-0200-CONTINUA.                                          
       070-0200-CONTINUA.                                                       
           COMPUTE W050-TITOTOR = W050-TITOTOR +                                
                   T050-TITOTOR(T050-NUM-ELEM, A000-CONT)                       
           IF Z800-ITIPOPRO = 'D'                                               
              MOVE T010-IOCONCEP(A000-CONT)                                     
                             TO T050-IOCONCEP(T050-NUM-ELEM, A000-CONT).        
           COMPUTE T000-CTITOT-I(A000-CONT) = T000-CTITOT-I(A000-CONT) +        
                                 T050-TITOTOR(T050-NUM-ELEM, A000-CONT)         
           ADD 1 TO A000-CONT                                                   
           GO TO 070-0150-CICLO.                                                
       070-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       080-VERIF-GLOBAL SECTION.                                                
       080-0100-INICIO.                                                         
           MOVE 1                      TO A000-CONT.                            
       080-0150-CICLO.                                                          
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 080-9900-FIN.                                               
           IF T010-ICRITED = 'TT'                                               
              COMPUTE W070-RESULT = A000-CTITCLIE / T010-CCUPONES               
              COMPUTE T000-CTITOT-G(A000-CONT) =                                
                  W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                  / 100                                                         
              GO TO 080-0200-COMPARA.                                           
           IF T010-ICRITED = 'RR'                                               
              GO TO 080-0150-RR.                                                
           IF T010-ICRITED = 'TR'                                               
              GO TO 080-0160-TR.                                                
              GO TO 080-0200-COMPARA.                                           
       080-0150-RR.                                                             
              COMPUTE W000-AUXILIAR = (A000-CTITCLIE / T010-CCUPONES)           
              IF W000-AUXILIAR > 0                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR + 0.5                      
              ELSE                                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR - 0.5.                     
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              IF W000-AUXILIAR > 0                                              
                 COMPUTE T000-CTITOT-G(A000-CONT) =                             
                         W000-AUXILIAR + 0.5                                    
              ELSE                                                              
                 COMPUTE T000-CTITOT-G(A000-CONT) =                             
                         W000-AUXILIAR - 0.5.                                   
              GO TO 080-0200-COMPARA.                                           
       080-0160-TR.                                                             
              COMPUTE W070-RESULT = A000-CTITCLIE / T010-CCUPONES               
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              MOVE W000-AUXILIAR TO T000-CTITOT-G(A000-CONT)                    
              GO TO 080-0200-COMPARA.                                           
       080-0200-COMPARA.                                                        
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
      *                                       T000-CTITOT-G(A000-CONT).         
           COMPUTE T000-TITOT-I-EMP1(A000-CONT) =                               
                   T000-TITOT-I-EMP1(A000-CONT) +                               
                   T000-CTITOT-G(A000-CONT).                                    
           IF T000-CTITOT-G(A000-CONT) = T000-CTITOT-I(A000-CONT)               
              GO TO 080-0250-CONT-CICLO.                                        
           IF T000-CTITOT-G(A000-CONT) > T000-CTITOT-I(A000-CONT)               
              PERFORM 090-SUMA                                                  
              GO TO 080-0250-CONT-CICLO.                                        
           IF T000-CTITOT-G(A000-CONT) < T000-CTITOT-I(A000-CONT)               
              PERFORM 095-RESTA                                                 
              GO TO 080-0250-CONT-CICLO.                                        
       080-0250-CONT-CICLO.                                                     
           ADD 1 TO A000-CONT                                                   
           GO TO 080-0150-CICLO.                                                
       080-9900-FIN.                                                            
           EXIT.                                                                
       081-VERIF-GLOBAL SECTION.                                                
       081-0100-INICIO.                                                         
           MOVE 1                      TO A000-CONT.                            
       081-0150-CICLO.                                                          
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 081-9900-FIN.                                               
           IF T010-ICRITED = 'TT'                                               
              COMPUTE W070-RESULT = A000-CTITCLIE / T010-CCUPONES               
              COMPUTE T000-CTITOT-G(A000-CONT) =                                
                  W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                  / 100                                                         
              GO TO 081-0200-COMPARA.                                           
           IF T010-ICRITED = 'RR'                                               
              GO TO 081-0150-RR.                                                
           IF T010-ICRITED = 'TR'                                               
              GO TO 081-0160-TR.                                                
              GO TO 081-0200-COMPARA.                                           
       081-0150-RR.                                                             
              COMPUTE W000-AUXILIAR = (A000-CTITCLIE / T010-CCUPONES)           
              IF W000-AUXILIAR > 0                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR + 0.5                      
              ELSE                                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR - 0.5.                     
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              IF W000-AUXILIAR > 0                                              
                 COMPUTE T000-CTITOT-G(A000-CONT) =                             
                         W000-AUXILIAR + 0.5                                    
              ELSE                                                              
                 COMPUTE T000-CTITOT-G(A000-CONT) =                             
                         W000-AUXILIAR - 0.5.                                   
              GO TO 081-0200-COMPARA.                                           
       081-0160-TR.                                                             
              COMPUTE W070-RESULT = A000-CTITCLIE / T010-CCUPONES               
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              MOVE W000-AUXILIAR TO T000-CTITOT-G(A000-CONT)                    
              GO TO 081-0200-COMPARA.                                           
       081-0200-COMPARA.                                                        
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           COMPUTE T000-TITOT-I-EMP2(A000-CONT) =                               
                   T000-TITOT-I-EMP2(A000-CONT) +                               
                   T000-CTITOT-G(A000-CONT).                                    
           IF T000-CTITOT-G(A000-CONT) = T000-CTITOT-I(A000-CONT)               
              GO TO 081-0250-CONT-CICLO.                                        
           IF T000-CTITOT-G(A000-CONT) > T000-CTITOT-I(A000-CONT)               
              PERFORM 090-SUMA                                                  
              GO TO 081-0250-CONT-CICLO.                                        
           IF T000-CTITOT-G(A000-CONT) < T000-CTITOT-I(A000-CONT)               
              PERFORM 095-RESTA                                                 
              GO TO 081-0250-CONT-CICLO.                                        
       081-0250-CONT-CICLO.                                                     
           ADD 1 TO A000-CONT                                                   
           GO TO 081-0150-CICLO.                                                
       081-9900-FIN.                                                            
           EXIT.                                                                
      *----                                                                     
      *    1ER CONJ DE TIPOS DE VALOR                                           
      *----                                                                     
       085-VERIFICA-ITIPOVAL  SECTION.                                          
       085-0100-INICIO.                                                         
           MOVE 1                       TO  A085-CONT-TVC.                      
       085-0250-CONT-CICLO.                                                     
           IF  A085-CONT-TVC > T085-NUM-ELEM-TVC OR                             
               ITIPOVAL OF DCLCONCEPT = T085-ITIPOVAL-C(A085-CONT-TVC)          
               GO TO 085-9900-FIN.                                              
           ADD 1                        TO  A085-CONT-TVC                       
           GO TO 085-0250-CONT-CICLO.                                           
       085-9900-FIN.                                                            
           EXIT.                                                                
                                                                                
      *----                                                                     
      *    2O CONJ DE TIPOS DE VALOR                                            
      *----                                                                     
       087-VERIFICA-ITIPOVAL  SECTION.                                          
       087-0100-INICIO.                                                         
           MOVE 1                       TO  A087-CONT-TVC.                      
       087-0250-CONT-CICLO.                                                     
           IF  A087-CONT-TVC > T087-NUM-ELEM-TVC OR                             
               ITIPOVAL OF DCLCONCEPT = T087-ITIPOVAL-C(A087-CONT-TVC)          
               GO TO 087-9900-FIN.                                              
           ADD 1                        TO A087-CONT-TVC                        
           GO TO 087-0250-CONT-CICLO.                                           
       087-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       090-SUMA SECTION.                                                        
       090-0100-INICIO.                                                         
           MOVE 1                      TO A000-CONT2                            
           MOVE 1                      TO A000-INDICE.                          
       090-0150-CICLO.                                                          
           IF A000-INDICE > T050-NUM-ELEM                                       
              GO TO 090-0200-CONTINUA.                                          
           IF A000-CONT2   > T550-NUM-ELEM                                      
              DISPLAY W000-PROG ' A000-CONT2 EXCEDE CAPACIDAD: '                
              DISPLAY W000-PROG '(' T550-NUM-ELEM ')'                           
              PERFORM 980-ABORTA.                                               
           IF T050-ITIPOTEN(A000-INDICE) = T550-ITIPOTEN(A000-CONT2)            
              GO TO 090-0300-CALCULA.                                           
           ADD 1 TO A000-INDICE                                                 
           GO TO 090-0250-CONT-CICLO.                                           
       090-0200-CONTINUA.                                                       
           ADD  1 TO A000-CONT2                                                 
           MOVE 1                      TO A000-INDICE                           
           GO TO 090-0250-CONT-CICLO.                                           
       090-0250-CONT-CICLO.                                                     
           GO TO 090-0150-CICLO.                                                
       090-0300-CALCULA.                                                        
           COMPUTE A000-DIF =                                                   
                   T000-CTITOT-G(A000-CONT) - T000-CTITOT-I(A000-CONT)          
           IF T050-ITIPOTEN(A000-INDICE) NOT = 'T'                              
              COMPUTE T050-TITOTOR(A000-INDICE, A000-CONT) =                    
                   T050-TITOTOR(A000-INDICE, A000-CONT) + A000-DIF              
              GO TO 090-9900-FIN.                                               
           IF T050-ITIPOTEN(A000-INDICE) = 'T'                                  
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           IF WS-IEMPR-CTA = SPACES OR 'CBP'                                    
              COMPUTE T000-TITOT-I-EMP1(A000-CONT) =                            
                      T000-TITOT-I-EMP1(A000-CONT) + A000-DIF                   
           ELSE                                                                 
              COMPUTE T000-TITOT-I-EMP2(A000-CONT) =                            
                      T000-TITOT-I-EMP2(A000-CONT) + A000-DIF                   
           END-IF                                                               
              GO TO 090-9900-FIN.                                               
       090-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       095-RESTA SECTION.                                                       
       095-0100-INICIO.                                                         
           MOVE T550-NUM-ELEM          TO A000-CONT2                            
           MOVE 1                      TO A000-INDICE.                          
       095-0150-CICLO.                                                          
           IF A000-INDICE > T050-NUM-ELEM                                       
              GO TO 095-0200-CONTINUA.                                          
           IF A000-CONT2   = 0                                                  
              DISPLAY W000-PROG ' A000-CONT2 EXCEDE CAPACIDAD: '                
              DISPLAY W000-PROG '(' T550-NUM-ELEM ')'                           
              PERFORM 980-ABORTA.                                               
           IF T050-ITIPOTEN(A000-INDICE) = T550-ITIPOTEN(A000-CONT2)            
              GO TO 095-0300-CALCULA.                                           
           ADD  1 TO A000-INDICE                                                
           GO TO 095-0250-CONT-CICLO.                                           
       095-0200-CONTINUA.                                                       
           ADD -1 TO A000-CONT2                                                 
           MOVE 1                      TO A000-INDICE                           
           GO TO 095-0250-CONT-CICLO.                                           
       095-0250-CONT-CICLO.                                                     
           GO TO 095-0150-CICLO.                                                
       095-0300-CALCULA.                                                        
           COMPUTE A000-DIF =                                                   
                   T000-CTITOT-I(A000-CONT) - T000-CTITOT-G(A000-CONT)          
           IF T050-ITIPOTEN(A000-INDICE) NOT = 'T'                              
              COMPUTE T050-TITOTOR(A000-INDICE, A000-CONT) =                    
                   T050-TITOTOR(A000-INDICE, A000-CONT) - A000-DIF              
              GO TO 095-9900-FIN.                                               
           IF T050-ITIPOTEN(A000-INDICE) = 'T'                                  
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           IF WS-IEMPR-CTA = SPACES OR 'CBP'                                    
              COMPUTE T000-TITOT-I-EMP1(A000-CONT) =                            
                      T000-TITOT-I-EMP1(A000-CONT) - A000-DIF                   
           ELSE                                                                 
              COMPUTE T000-TITOT-I-EMP2(A000-CONT) =                            
                      T000-TITOT-I-EMP2(A000-CONT) - A000-DIF                   
           END-IF                                                               
              GO TO 095-9900-FIN.                                               
       095-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       100-REGISTRA SECTION.                                                    
       100-0100-INICIO.                                                         
           MOVE 1                      TO A000-CONT                             
           MOVE 1                      TO A000-INDICE.                          
       100-0150-CICLO.                                                          
           IF A000-INDICE > T050-NUM-ELEM                                       
              GO TO 100-9900-FIN.                                               
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 100-0250-INC-INDICE.                                        
           IF A000-CONT = 1                                                     
              MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                         
                                       TO R1-10-CTITOT1                         
              GO TO 100-0200-CONTINUA.                                          
           IF A000-CONT = 2                                                     
              MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                         
                                       TO R1-10-CTITOT2                         
              GO TO 100-0200-CONTINUA.                                          
           IF A000-CONT = 3                                                     
              MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                         
                                       TO R1-10-CTITOT3                         
              GO TO 100-0200-CONTINUA.                                          
           IF A000-CONT = 4                                                     
              MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                         
                                       TO R1-10-CTITOT4                         
              GO TO 100-0200-CONTINUA.                                          
       100-0200-CONTINUA.                                                       
      *----                                                                     
      *    ACTUALIZACION DE CARTERA Y OPERAVA PARA EMISORA OTORGADA             
      *----                                                                     
           IF Z800-ITIPOPRO = 'D'                                               
              PERFORM 110-EMIS-OTORGADA                                         
           END-IF.                                                              
      *----                                                                     
           ADD 1 TO A000-CONT                                                   
           GO TO 100-0300-CONT-CICLO.                                           
      *                                                                         
       100-0250-INC-INDICE.                                                     
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                       TO R1-10-TIPOTEN                         
           MOVE T050-CTITULOS(A000-INDICE)                                      
                                       TO R1-10-CTIT                            
      *--- PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES               
           IF WS-IEMPR-CTA = SPACES OR 'CBP'                                    
             MOVE W000-PROG                TO WS-CTRL-D-PROGRAMA                
             MOVE WS-IEMPR-CTA             TO WS-CTRL-D-EMPRESA                 
             MOVE WS-IEMPR-SUC             TO WS-CTRL-D-SUCURSAL                
             MOVE SPACES                   TO WS-CTRL-D-PROMOTOR-A              
                                               R1-01-CVE-CTLD                   
             PERFORM 9800-OBT-CASILLERO                                         
             MOVE WS-CTRL-D-CASILLERO      TO  R1-01-CVE-CTLD                   
      *---   PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES             
             ADD  1                        TO  R1-NUM-HOJA                      
             MOVE ZEROS                    TO  R1-NUM-HOJA                      
             IF (R1-NUM-LIN + 1) > R1-MAX-LIN                                   
                PERFORM 740-ENCABEZADO-ESTANDAR                                 
             END-IF                                                             
             WRITE R1-REG FROM R1-10-DETA                                       
             ADD 1 TO R1-NUM-LIN                                                
             ADD 1 TO A990-REG-ESC-R1                                           
           ELSE                                                                 
             MOVE W000-PROG                TO WS-CTRL-D-PROGRAMA                
             MOVE WS-IEMPR-CTA             TO WS-CTRL-D-EMPRESA                 
             MOVE 'T08'                    TO WS-CTRL-D-SUCURSAL                
             MOVE SPACES                   TO WS-CTRL-D-PROMOTOR-A              
                                              R1-01-CVE-CTLD                    
             PERFORM 9800-OBT-CASILLERO                                         
      *                                                                         
             IF S010-SI = '0'                                                   
                MOVE WS-CTRL-D-CASILLERO      TO R1-01-CVE-CTLD                 
             ELSE                                                               
                MOVE 'ADMONBCM'               TO R1-01-CVE-CTLD                 
             END-IF                                                             
      *---      PROVISIONALMENTE SE SEPARAN LAS EMPRESAS EN 2 REPORTES          
             ADD  1                        TO R1-NUM-HOJA                       
             MOVE ZEROS                    TO R2-NUM-HOJA                       
             IF (R2-NUM-LIN + 1) > R1-MAX-LIN                                   
                PERFORM 740-ENCABEZADO-ESTANDAR                                 
             END-IF                                                             
             WRITE R2-REG FROM R1-10-DETA                                       
             ADD 1 TO R2-NUM-LIN                                                
             ADD 1 TO A990-REG-ESC-R2                                           
           END-IF                                                               
      *----                                                                     
      *    ACTUALIZACION DE CARTERA Y OPERAVA DE LA EMISORA OTORGANTE           
      *----                                                                     
           IF Z800-ITIPOPRO = 'D'                                               
              PERFORM 120-EMIS-OTORGANTE                                        
           END-IF.                                                              
      *----                                                                     
           MOVE 1                      TO A000-CONT                             
           ADD 1 TO A000-INDICE                                                 
           GO TO 100-0300-CONT-CICLO.                                           
       100-0300-CONT-CICLO.                                                     
           GO TO 100-0150-CICLO.                                                
       100-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       110-EMIS-OTORGADA SECTION.                                               
       110-0100-INICIO.                                                         
           MOVE ICUENTA OF DCLCUENTA   TO W110-ICUENTA                          
           MOVE T050-IDIACAR(A000-INDICE)                                       
                                       TO W110-IDIACAR                          
           MOVE T050-IFOLOPES(A000-INDICE)                                      
                                       TO W110-IFOLOPES                         
           MOVE T050-ICVEOPES(A000-INDICE)                                      
                                       TO W110-ICVEOPES                         
           MOVE T050-IOCONCEP(A000-INDICE, A000-CONT)                           
                                       TO W110-ICONCEPT                         
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                       TO W110-ITIPOTEN                         
      *                                                                         
           IF T050-TITOTOR(A000-INDICE, A000-CONT) NOT EQUAL 0                  
              COMPUTE W000-MCPROEXI =                                           
                     (T050-MCPROEXI(A000-INDICE) *                              
                      T010-PORCPP  (A000-CONT)   *                              
                      T050-CTITULOS(A000-INDICE) ) /                            
                     (T050-TITOTOR(A000-INDICE, A000-CONT) * 100)               
              COMPUTE W000-MCPPFA   =                                           
                     (T050-MCPPFA  (A000-INDICE) *                              
                      T010-PORCPP  (A000-CONT)   *                              
                      T050-CTITULOS(A000-INDICE) ) /                            
                     (T050-TITOTOR(A000-INDICE, A000-CONT) * 100)               
              COMPUTE W000-MCPPBP   =                                           
                     (T050-MCPPBP  (A000-INDICE) *                              
                      T010-PORCPP  (A000-CONT)   *                              
                      T050-CTITULOS(A000-INDICE) ) /                            
                     (T050-TITOTOR(A000-INDICE, A000-CONT) * 100)               
           ELSE                                                                 
               MOVE 0 TO W000-MCPROEXI                                          
               MOVE 0 TO W000-MCPPFA                                            
               MOVE 0 TO W000-MCPPBP                                            
           END-IF                                                               
      *                                                                         
           PERFORM 520-LEE-CARTERA                                              
           IF S520-EDO-CARTERA = '0'                                            
              GO TO 110-0150-ACT-CARTERA.                                       
              GO TO 110-0200-INS-CARTERA.                                       
      *                                                                         
       110-0150-ACT-CARTERA.                                                    
           DISPLAY '110-0150-ACT-CARTERA'                                       
           DISPLAY 'W050-TITOTOR>>1' W050-TITOTOR                               
           IF W050-TITOTOR NOT EQUAL 0                                          
              MOVE 0 TO W110-DIV                                                
              COMPUTE W110-DIV = T050-TITOTOR(A000-INDICE, A000-CONT) +         
                      W110-CTITULOS                                             
              display 'W110-DIV>>1' W110-DIV                                    
              IF W110-DIV = 0                                                   
                 MOVE 0 TO W110-MCPROEXI                                        
                 MOVE 0 TO W110-MCPPBP                                          
              ELSE                                                              
               COMPUTE W110-MCPROEXI =                                          
               (  (W000-MCPROEXI * T050-TITOTOR(A000-INDICE, A000-CONT))        
                + (W110-CTITULOS * W110-MCPROEXI) )                             
                / (T050-TITOTOR(A000-INDICE, A000-CONT) + W110-CTITULOS)        
               COMPUTE W110-MCPPBP   =                                          
               (  (W000-MCPPBP   * T050-TITOTOR(A000-INDICE, A000-CONT))        
                + (W110-CTITULOS * W110-MCPPBP  ) )                             
                / (T050-TITOTOR(A000-INDICE, A000-CONT) + W110-CTITULOS)        
              END-IF                                                            
           ELSE                                                                 
              MOVE 0 TO W110-MCPROEXI                                           
              MOVE 0 TO W110-MCPPBP                                             
           END-IF.                                                              
           COMPUTE W110-CTITULOS = W110-CTITULOS +                              
                                   T050-TITOTOR(A000-INDICE, A000-CONT)         
      *                                                                         
           IF T050-TITOTOR(A000-INDICE, A000-CONT) NOT EQUAL 0                  
              INITIALIZE                      CR-REG                            
              MOVE IOPERA OF DCLDEFOPER TO CR-IOPERA                            
              MOVE 999999999            TO CR-IREF                              
              MOVE 1                    TO CR-ISEC                              
              MOVE 'D'                  TO CR-ITRANS                            
              MOVE EOPERA OF DCLDEFOPER TO CR-EOPERA                            
              MOVE 'RECIBO'             TO CR-ETRANS                            
              MOVE W110-ICUENTA         TO CR-ICUENTA1                          
              MOVE W110-ICONCEPT        TO CR-ICONCEP2                          
              MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                         
                                        TO CR-CANT2                             
              MOVE 0                    TO CR-CANT1                             
              PERFORM 115-FACTOR-COSTOP                                         
              MOVE T050-CTITULOS(T050-NUM-ELEM)                                 
                                        TO  W000-CTITULOS-INI                   
              DISPLAY 'W000-MCPPFA>ACT' W000-MCPPFA                             
                                                                                
              DISPLAY 'W000-FACTOR>ACT' W000-FACTOR                             
              DISPLAY 'W000-CTITULOS-INI>ACT' W000-CTITULOS-INI                 
              DISPLAY 'T050-TITOTOR>ACT'                                        
                                   T050-TITOTOR(A000-INDICE, A000-CONT)         
              COMPUTE CR-MPRECIO = W000-MCPPFA * W000-FACTOR                    
              DISPLAY 'CR-MPRECIO>>>ACT' CR-MPRECIO                             
              MOVE P05FECHO             TO CR-FOPERA                            
              MOVE P05FECHO             TO CR-FLIQUIDA                          
                                           W110-FULACCPP                        
              MOVE 'P'                  TO CR-TIPPROC                           
              MOVE IEMPR OF DCLCUENTA   TO CR-IEMPR                             
              MOVE W000-PROG            TO CR-IPROGRAM                          
              MOVE '0001-01-01'         TO CR-FVENC                             
              MOVE 0                    TO CR-IVA                               
              MOVE 0                    TO CR-INTERES                           
              MOVE 'C'                  TO CR-SESTATUS                          
              MOVE T050-ITIPOTEN(A000-INDICE)                                   
                                        TO CR-ITIPOTEN                          
      *                                                                         
              CALL RUT-ZM6CR200         USING CR-REG                            
      *                                                                         
              DISPLAY 'CR-REG DEPOSITO' CR-REG                                  
              MOVE CR-MCPROEXF          TO W110-MCPPFA                          
              DISPLAY 'ANTES DE INSERTAR'                                       
              DISPLAY 'W110-MCPPFA>ACT' W110-MCPPFA                             
              DISPLAY 'W110-CTITULOS>ACT' W110-CTITULOS                         
      *                                                                         
      *---    PERFORM 680-ACT-CARTERA                                           
              PERFORM 680-GRABA-A4-CARTERA                                      
           END-IF.                                                              
      *                                                                         
           MOVE W110-ICUENTA            TO ICUENTA  OF DCLCUENTA                
           PERFORM 515-LEE-CUENTA                                               
           IF IEMPR OF DCLCUENTA = 'BCM'                                        
              MOVE ZEROS                TO W110-TOT-TITOTOR                     
              MOVE 1                    TO A000-I                               
              PERFORM UNTIL A000-I > T010-NUM-ELEM                              
                 COMPUTE W110-TOT-TITOTOR = W110-TOT-TITOTOR +                  
                         T050-TITOTOR(A000-INDICE, A000-I)                      
                 ADD 1                  TO A000-I                               
              END-PERFORM                                                       
      *---    PERFORM 611-ACTUALIZA-ZMDT701                                     
              PERFORM 611-GRABA-A6-ZMDT701                                      
           END-IF.                                                              
      *                                                                         
           MOVE IOPERA OF DCLDEFOPER    TO OPER-IOPERA   (A000-CONT)            
           MOVE W000-PROG               TO OPER-IUSUARIO (A000-CONT)            
           MOVE EOPERA OF DCLDEFOPER    TO OPER-EOPERA   (A000-CONT)            
           MOVE W110-ICUENTA            TO OPER-ICUENTA1 (A000-CONT)            
           MOVE T010-IOCONCEP(A000-CONT)                                        
                                        TO OPER-ICONCEP2 (A000-CONT)            
           MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                            
                                        TO OPER-TITOTOR  (A000-CONT)            
           MOVE W000-MCPROEXI           TO OPER-MCPROEXI (A000-CONT)            
           MOVE P05FECHO                TO OPER-FOPERA   (A000-CONT)            
           MOVE P05FECHO                TO OPER-FLIQUIDA (A000-CONT)            
           MOVE IRUTA   OF DCLCUENTA    TO OPER-IRUTA    (A000-CONT)            
           MOVE SLIQUID OF DCLCUENTA    TO OPER-SLIQUID  (A000-CONT)            
           MOVE T050-IFOLOPES(A000-INDICE)                                      
                                        TO OPER-IFOLOPES (A000-CONT)            
           MOVE T050-ICVEOPES(A000-INDICE)                                      
                                        TO OPER-ICVEOPES (A000-CONT)            
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                        TO OPER-ITIPOTEN (A000-CONT)            
           MOVE W110-ICUENTA            TO OPER-ICUENTA  (A000-CONT)            
      *                                                                         
      *--- SE MUEVEN VALORES PARA REALIZAR DEPOSITO                             
           MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                            
                                        TO R200-TITOTOR  (A000-CONT)            
           MOVE IOPERA OF DCLDEFOPER    TO R200-IOPERA   (A000-CONT)            
           MOVE EOPERA OF DCLDEFOPER    TO R200-EOPERA   (A000-CONT)            
           MOVE W110-ICUENTA            TO R200-ICUENTA  (A000-CONT)            
           MOVE T010-IOCONCEP(A000-CONT)                                        
                                        TO R200-ICONCEPT (A000-CONT)            
           MOVE W000-MCPPFA             TO R200-MCPPFA   (A000-CONT)            
           MOVE W000-MCPPBP             TO R200-MCPPBP   (A000-CONT)            
           MOVE T050-CTITULOS(T050-NUM-ELEM)                                    
                                        TO OPER-CTITULOS (A000-CONT)            
           MOVE P05FECHO                TO R200-P05FECHO (A000-CONT)            
           MOVE IEMPR OF DCLCUENTA      TO R200-IEMPR    (A000-CONT)            
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                        TO R200-ITIPOTEN (A000-CONT)            
      *                                                                         
           MOVE T010-IOCONCEP(A000-CONT)                                        
                                        TO OPER-IOCONCEP (A000-CONT)            
           MOVE T010-IOEMISOR(A000-CONT)                                        
                                        TO OPER-IOEMISOR (A000-CONT)            
           MOVE T010-IOSERIE(A000-CONT) TO OPER-IOSERIE  (A000-CONT)            
           MOVE T010-IOCUPON(A000-CONT) TO OPER-ICUPON   (A000-CONT)            
           MOVE P05FECHO                TO OPER-FCARTERA (A000-CONT)            
           MOVE P05FECHO                TO OPER-FULTCOMP (A000-CONT)            
           MOVE ITIPOSDO OF DCLCARTERA  TO OPER-ITIPOSDO (A000-CONT)            
           MOVE 0                       TO W110-IREF                            
           MOVE 0                       TO W110-AREND                           
           MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                            
                                        TO OPER-TITOTOR  (A000-CONT)            
           MOVE W050-TITOTOR            TO OPER-TITOTOR1 (A000-CONT)            
           MOVE S520-EDO-CARTERA        TO R200-EDO-CART (A000-CONT).           
           GO TO 110-0250-CONTINUA.                                             
      *                                                                         
       110-0200-INS-CARTERA.                                                    
           DISPLAY '110-0200-INS-CARTERA'                                       
           MOVE IOPERA OF DCLDEFOPER    TO OPER-IOPERA   (A000-CONT)            
           MOVE W000-PROG               TO OPER-IUSUARIO (A000-CONT)            
           MOVE EOPERA OF DCLDEFOPER    TO OPER-EOPERA   (A000-CONT)            
           MOVE W110-ICUENTA            TO OPER-ICUENTA1 (A000-CONT)            
           MOVE T010-IOCONCEP(A000-CONT)                                        
                                        TO OPER-ICONCEP2 (A000-CONT)            
           MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                            
                                        TO OPER-TITOTOR  (A000-CONT)            
           MOVE W000-MCPROEXI           TO OPER-MCPROEXI (A000-CONT)            
           MOVE P05FECHO                TO OPER-FOPERA   (A000-CONT)            
           MOVE P05FECHO                TO OPER-FLIQUIDA (A000-CONT)            
           MOVE IRUTA   OF DCLCUENTA    TO OPER-IRUTA    (A000-CONT)            
           MOVE SLIQUID OF DCLCUENTA    TO OPER-SLIQUID  (A000-CONT)            
           MOVE T050-IFOLOPES(A000-INDICE)                                      
                                        TO OPER-IFOLOPES (A000-CONT)            
           MOVE T050-ICVEOPES(A000-INDICE)                                      
                                        TO OPER-ICVEOPES (A000-CONT)            
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                        TO OPER-ITIPOTEN (A000-CONT)            
           MOVE W110-ICUENTA            TO OPER-ICUENTA  (A000-CONT)            
      *                                                                         
      *--- SE MUEVEN VALORES PARA REALIZAR DEPOSITO                             
           MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                            
                                        TO R200-TITOTOR  (A000-CONT)            
           MOVE IOPERA OF DCLDEFOPER    TO R200-IOPERA   (A000-CONT)            
           MOVE EOPERA OF DCLDEFOPER    TO R200-EOPERA   (A000-CONT)            
           MOVE W110-ICUENTA            TO R200-ICUENTA  (A000-CONT)            
           MOVE T010-IOCONCEP(A000-CONT)                                        
                                        TO R200-ICONCEPT (A000-CONT)            
           MOVE W000-MCPPFA             TO R200-MCPPFA   (A000-CONT)            
           MOVE W000-MCPPBP             TO R200-MCPPBP   (A000-CONT)            
           MOVE T050-CTITULOS(T050-NUM-ELEM)                                    
                                        TO OPER-CTITULOS (A000-CONT)            
           MOVE P05FECHO                TO R200-P05FECHO (A000-CONT)            
           MOVE IEMPR OF DCLCUENTA      TO R200-IEMPR    (A000-CONT)            
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                        TO R200-ITIPOTEN (A000-CONT)            
      *                                                                         
           MOVE T010-IOCONCEP(A000-CONT)                                        
                                        TO OPER-IOCONCEP (A000-CONT)            
           MOVE T010-IOEMISOR(A000-CONT)                                        
                                        TO OPER-IOEMISOR (A000-CONT)            
           MOVE T010-IOSERIE(A000-CONT) TO OPER-IOSERIE  (A000-CONT)            
           MOVE T010-IOCUPON(A000-CONT) TO OPER-ICUPON   (A000-CONT)            
           MOVE P05FECHO                TO OPER-FCARTERA (A000-CONT)            
           MOVE P05FECHO                TO OPER-FULTCOMP (A000-CONT)            
           MOVE ITIPOSDO OF DCLCARTERA  TO OPER-ITIPOSDO (A000-CONT)            
           MOVE 0                       TO W110-IREF                            
           MOVE 0                       TO W110-AREND                           
           MOVE T050-TITOTOR(A000-INDICE, A000-CONT)                            
                                        TO OPER-TITOTOR  (A000-CONT)            
           MOVE W050-TITOTOR            TO OPER-TITOTOR1 (A000-CONT)            
           MOVE S520-EDO-CARTERA        TO R200-EDO-CART (A000-CONT).           
       110-0250-CONTINUA.                                                       
           EXEC SQL                                                             
                CLOSE C520-CARTERA                                              
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL CERRAR C520-CARTERA'                
              PERFORM 970-SQL-ERROR                                             
           END-IF.                                                              
       110-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       115-FACTOR-COSTOP  SECTION.                                              
       115-0100-INICIO.                                                         
           MOVE 0                        TO W000-FACTOR                         
           MOVE P05FECHO                 TO W000-FECHA                          
           PERFORM 516-LEE-TIPCAMB                                              
           IF SQLCODE = 0                                                       
              MOVE MTIPCAM OF DCLTIPCAMB TO W000-INPC-OPE                       
           ELSE                                                                 
              MOVE 1                     TO W000-FACTOR                         
           END-IF                                                               
           MOVE T050-FULACCPP(T050-NUM-ELEM)                                    
                                         TO W000-FECHA                          
           PERFORM 516-LEE-TIPCAMB                                              
           IF SQLCODE = 0                                                       
              MOVE MTIPCAM OF DCLTIPCAMB TO W000-INPC-CAR                       
           ELSE                                                                 
              MOVE 1                     TO W000-FACTOR                         
           END-IF                                                               
           IF W000-FACTOR = 0                                                   
              MOVE 1                     TO W000-FACTOR                         
              IF W000-INPC-CAR NOT = 0                                          
                 COMPUTE W000-FACTOR = W000-INPC-OPE / W000-INPC-CAR            
              END-IF                                                            
           END-IF.                                                              
       115-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *----                                                                     
       120-EMIS-OTORGANTE SECTION.                                              
       120-0100-INICIO.                                                         
           MOVE ICUENTA OF DCLCUENTA   TO W110-ICUENTA                          
      *----                                                                     
      *    RUTINA QUE OBTIENE EL SIGUIENTE IREF                                 
      *----                                                                     
           PERFORM 698-LEE-FOLIO                                                
           MOVE W000-SIGFOLIO          TO OP-SIGFOLIO                           
      *                                                                         
      *--- RETIRO                                                               
           INITIALIZE                     A5-REG                                
           MOVE OP-SIGFOLIO            TO A5-IREF                               
           MOVE IOPERA OF DCLDEFOPER   TO A5-IOPERA                             
           MOVE 'R'                    TO A5-ITRANS                             
           MOVE EOPERA OF DCLDEFOPER   TO A5-EOPERA                             
           MOVE 'RETIRO'               TO A5-ETRANS                             
           MOVE W110-ICUENTA           TO A5-ICUENTA1                           
           MOVE Z800-ICONCEPT          TO A5-ICONCEP2                           
           MOVE T050-CTITULOS(A000-INDICE)                                      
                                       TO A5-CANT2                              
XMYECC* --INI-XMYECC--                                                          
XMYECC*    MOVE MPRECOMP OF DCLPRECIO  TO A5-MCPROEXI                           
XMYECC     MOVE W000-MCPPBP            TO A5-MCPROEXI                           
XMYECC* --FIN-XMYECC--                                                          
           MOVE P05FECHO               TO A5-FOPERA                             
           MOVE P05FECHO               TO A5-FLIQUIDA                           
           MOVE IRUTA   OF DCLCUENTA   TO A5-IRUTA                              
           MOVE SLIQUID OF DCLCUENTA   TO A5-SLIQUID                            
XMYECC* --INI-XMYECC--                                                          
XMYECC*    MOVE 0                      TO A5-MPRECIO                            
XMYECC     MOVE W000-MCPPBP            TO A5-MPRECIO                            
XMYECC* --FIN-XMYECC--                                                          
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                       TO A5-ITIPOTEN                           
           MOVE T050-IFOLOPES(A000-INDICE)                                      
                                       TO A5-IFOLOPES                           
           MOVE T050-ICVEOPES(A000-INDICE)                                      
                                       TO A5-ICVEOPES                           
      *                                                                         
           MOVE W110-ICUENTA           TO ICUENTA  OF DCLCUENTA                 
           PERFORM 515-LEE-CUENTA                                               
           MOVE IEMPR   OF DCLCUENTA   TO A5-IEMPR                              
      *                                                                         
      *--- PERFORM 690-INS-OPERAVA                                              
           PERFORM 690-GRABA-A5-OPERAVA                                         
      *                                                                         
           INITIALIZE                     CR-REG                                
           MOVE IOPERA OF DCLDEFOPER   TO CR-IOPERA                             
           MOVE A5-IREF                TO CR-IREF                               
           MOVE 1                      TO CR-ISEC                               
           MOVE 'R'                    TO CR-ITRANS                             
           MOVE EOPERA OF DCLDEFOPER   TO CR-EOPERA                             
           MOVE 'RECIBO'               TO CR-ETRANS                             
           MOVE W110-ICUENTA           TO CR-ICUENTA1                           
           MOVE Z800-ICONCEPT          TO CR-ICONCEP2                           
           MOVE T050-CTITULOS(A000-INDICE)                                      
                                       TO CR-CANT2                              
           MOVE 0                      TO CR-CANT1                              
           MOVE ZEROES                 TO CR-MPRECIO                            
           MOVE P05FECHO               TO CR-FOPERA                             
           MOVE P05FECHO               TO CR-FLIQUIDA                           
           MOVE 'D'                    TO CR-TIPPROC                            
           MOVE IEMPR OF DCLCUENTA     TO CR-IEMPR                              
           MOVE W000-PROG              TO CR-IPROGRAM                           
           MOVE '0001-01-01'           TO CR-FVENC                              
           MOVE 0                      TO CR-IVA                                
           MOVE 0                      TO CR-INTERES                            
           MOVE 'C'                    TO CR-SESTATUS                           
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                       TO CR-ITIPOTEN                           
      *                                                                         
           CALL RUT-ZM6CR200           USING CR-REG                             
      *                                                                         
           DISPLAY 'CR-REG RETIRO' CR-REG                                       
                                                                                
      *REALIZA DEPOSITO(S)                                                      
           MOVE ICUENTA OF DCLCUENTA   TO W110-ICUENTA                          
           MOVE 1                      TO A000-CONT                             
           PERFORM UNTIL A000-CONT > T010-NUM-ELEM                              
              PERFORM 200-DEPOSITO                                              
              ADD 1                    TO A000-CONT                             
           END-PERFORM                                                          
      *                                                                         
           MOVE W110-ICUENTA           TO ICUENTA  OF DCLCUENTA                 
           MOVE T050-IDIACAR(A000-INDICE)                                       
                                       TO W110-IDIACAR                          
           MOVE T050-IFOLOPES(A000-INDICE)                                      
                                       TO W110-IFOLOPES                         
           MOVE T050-ICVEOPES(A000-INDICE)                                      
                                       TO W110-ICVEOPES                         
           MOVE Z800-ICONCEPT          TO W110-ICONCEPT                         
           MOVE T050-ITIPOTEN(A000-INDICE)                                      
                                       TO W110-ITIPOTEN                         
      *--- PERFORM 688-DEL-CARTERA.                                             
           PERFORM 688-GRABA-A4-CARTERA.                                        
       120-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       200-DEPOSITO SECTION.                                                    
       200-100-INICIO.                                                          
           INITIALIZE                           A5-REG                          
           PERFORM 698-LEE-FOLIO                                                
           MOVE W000-SIGFOLIO                TO OP-SIGFOLIO                     
           MOVE OP-SIGFOLIO                  TO OPER-IREF   (A000-CONT)         
           DISPLAY 'OPER-IREF>1' OPER-IREF (A000-CONT)                          
           MOVE OPER-IREF     (A000-CONT)    TO A5-IREF                         
           MOVE OPER-IOPERA   (A000-CONT)    TO A5-IOPERA                       
           MOVE 'D'                          TO A5-ITRANS                       
           MOVE OPER-EOPERA   (A000-CONT)    TO A5-EOPERA                       
           MOVE 'RECIBO'                     TO A5-ETRANS                       
           MOVE OPER-ICUENTA1 (A000-CONT)    TO A5-ICUENTA1                     
           MOVE OPER-ICONCEP2 (A000-CONT)    TO A5-ICONCEP2                     
           MOVE OPER-TITOTOR  (A000-CONT)    TO A5-CANT2                        
XMYECC* --INI-XMYECC--                                                          
XMYECC*    MOVE OPER-MCPROEXI (A000-CONT)    TO A5-MCPROEXI                     
XMYECC     MOVE W000-MCPPBP                  TO A5-MCPROEXI                     
XMYECC* --FIN-XMYECC--                                                          
           MOVE OPER-FOPERA   (A000-CONT)    TO A5-FOPERA                       
           MOVE OPER-FLIQUIDA (A000-CONT)    TO A5-FLIQUIDA                     
           MOVE OPER-IRUTA    (A000-CONT)    TO A5-IRUTA                        
           MOVE OPER-SLIQUID  (A000-CONT)    TO A5-SLIQUID                      
      *                                                                         
           MOVE OPER-IFOLOPES (A000-CONT)    TO A5-IFOLOPES                     
           MOVE OPER-ICVEOPES (A000-CONT)    TO A5-ICVEOPES                     
           MOVE OPER-ITIPOTEN (A000-CONT)    TO A5-ITIPOTEN                     
XMYECC* --INI-XMYECC--                                                          
XMYECC*    MOVE 0                            TO A5-MPRECIO                      
XMYECC     MOVE W000-MCPPBP                  TO A5-MPRECIO                      
XMYECC* --FIN-XMYECC--                                                          
      *                                                                         
           IF R200-TITOTOR (A000-CONT) NOT EQUAL 0                              
              INITIALIZE                        CR-REG                          
              MOVE R200-IOPERA   (A000-CONT) TO CR-IOPERA                       
              DISPLAY 'A5-IREF>2' A5-IREF                                       
              MOVE A5-IREF                   TO CR-IREF                         
              MOVE 1                         TO CR-ISEC                         
              MOVE 'D'                       TO CR-ITRANS                       
              MOVE R200-EOPERA   (A000-CONT) TO CR-EOPERA                       
              MOVE 'RECIBO'                  TO CR-ETRANS                       
              MOVE R200-ICUENTA  (A000-CONT) TO CR-ICUENTA1                     
              MOVE R200-ICONCEPT (A000-CONT) TO CR-ICONCEP2                     
              MOVE R200-TITOTOR  (A000-CONT) TO CR-CANT2                        
              MOVE 0                         TO CR-CANT1                        
              PERFORM 115-FACTOR-COSTOP                                         
              MOVE OPER-CTITULOS (A000-CONT) TO W000-CTITULOS-INI               
              MOVE R200-TITOTOR  (A000-CONT) TO W110-CTITULOS                   
              DISPLAY 'DEPOSITO>>>'                                             
              DISPLAY 'R200-MCPPFA' R200-MCPPFA (A000-CONT)                     
              DISPLAY 'R200-MCPPBP' R200-MCPPBP (A000-CONT)                     
              DISPLAY 'W000-FACTOR' W000-FACTOR                                 
              DISPLAY 'W000-CTITULOS-INI' W000-CTITULOS-INI                     
              DISPLAY 'W110-CTITULOS' W110-CTITULOS                             
              COMPUTE CR-MPRECIO = R200-MCPPFA (A000-CONT)                      
                                 * W000-FACTOR                                  
              MOVE R200-P05FECHO (A000-CONT) TO CR-FOPERA                       
              MOVE R200-P05FECHO (A000-CONT) TO CR-FLIQUIDA                     
              MOVE 'D'                       TO CR-TIPPROC                      
              MOVE IEMPR OF DCLCUENTA        TO CR-IEMPR                        
              MOVE W000-PROG                 TO CR-IPROGRAM                     
              MOVE '0001-01-01'              TO CR-FVENC                        
              MOVE 0                         TO CR-IVA                          
              MOVE 0                         TO CR-INTERES                      
              MOVE 'C'                       TO CR-SESTATUS                     
              MOVE R200-ITIPOTEN (A000-CONT) TO CR-ITIPOTEN                     
      *                                                                         
              CALL RUT-ZM6CR200           USING CR-REG                          
      *                                                                         
              DISPLAY 'CR-REG DEPOSITO 2' CR-REG                                
              MOVE CR-MCPROEXF               TO W110-MCPPFA                     
              MOVE R200-MCPPBP   (A000-CONT) TO W110-MCPPBP                     
           END-IF                                                               
      *                                                                         
           MOVE OPER-ICUENTA  (A000-CONT)    TO ICUENTA  OF DCLCUENTA           
           PERFORM 515-LEE-CUENTA                                               
           MOVE IEMPR   OF DCLCUENTA         TO A5-IEMPR                        
      *                                                                         
      *--- PERFORM 690-INS-OPERAVA                                              
           PERFORM 690-GRABA-A5-OPERAVA                                         
                                                                                
           MOVE 'C'                          TO W110-SCUENTA                    
           MOVE 'C'                          TO W110-SCONCEPT                   
           MOVE OPER-IOCONCEP (A000-CONT)    TO W110-ICONCEPT                   
           MOVE OPER-IOEMISOR (A000-CONT)    TO W110-IEMISORA                   
           MOVE OPER-IOSERIE  (A000-CONT)    TO W110-ISERIE                     
           MOVE OPER-ICUPON   (A000-CONT)    TO W110-ICUPON                     
           MOVE OPER-FCARTERA (A000-CONT)    TO W110-FCARTERA                   
           MOVE OPER-FULTCOMP (A000-CONT)    TO W110-FULTCOMP                   
           MOVE 'P'                          TO W110-ITIPOCAR                   
           MOVE OPER-ITIPOSDO (A000-CONT)    TO W110-ITIPOSDO                   
           MOVE 0                            TO W110-IREF                       
           MOVE 0                            TO W110-AREND                      
           MOVE OPER-TITOTOR  (A000-CONT)    TO W110-CTITULOS                   
           MOVE 0                            TO W110-MVALMERC                   
           MOVE OPER-MCPROEXI (A000-CONT)    TO W110-MCPROEXI                   
           MOVE 1                            TO W110-ICONCEXP                   
           IF OPER-TITOTOR1 (A000-CONT) NOT EQUAL 0                             
              IF R200-EDO-CART (A000-CONT) = '1'                                
      *---       PERFORM 685-INS-CARTERA                                        
                 PERFORM 685-GRABA-A4-CARTERA                                   
                 MOVE W110-ICUENTA           TO ICUENTA  OF DCLCUENTA           
                 PERFORM 515-LEE-CUENTA                                         
                 IF IEMPR OF DCLCUENTA = 'BCM'                                  
                    MOVE ZEROS               TO W110-TOT-TITOTOR                
                    MOVE 1                   TO A000-I                          
                    PERFORM UNTIL A000-I > T010-NUM-ELEM                        
                       COMPUTE W110-TOT-TITOTOR = W110-TOT-TITOTOR              
                                                + OPER-TITOTOR (A000-I)         
                       ADD 1                 TO A000-I                          
                    END-PERFORM                                                 
      *---          PERFORM 611-ACTUALIZA-ZMDT701                               
                    PERFORM 611-GRABA-A6-ZMDT701                                
                 END-IF                                                         
              END-IF                                                            
           END-IF.                                                              
       200-9900-FIN.                                                            
           EXIT.                                                                
      *                                                                         
       130-OBTEN-PRECIO-SI SECTION.                                             
       130-0100-INICIO.                                                         
           MOVE P05FECHO               TO FPRECIO OF DCLPRECIO                  
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLPRECIO                 
           MOVE '0'                    TO S140-EDO-PRECIO-SI                    
           EXEC SQL                                                             
                OPEN C140-PRECIO-SI                                             
           END-EXEC.                                                            
           IF NOT ( SQLCODE = 0 OR 100)                                         
               DISPLAY W000-PROG ' ERROR AL ABRIR EL CURSOR '                   
               DISPLAY W000-PROG ' C140-PRECIO-SI'                              
               DISPLAY ' ICONCEPT = ' ICONCEPT OF DCLPRECIO                     
               DISPLAY ' FPRECIO  = ' FPRECIO OF DCLPRECIO                      
               PERFORM 970-SQL-ERROR                                            
           END-IF.                                                              
           IF SQLCODE = 100                                                     
              MOVE '1'                 TO S140-EDO-PRECIO-SI                    
           ELSE                                                                 
              MOVE '0'                 TO S140-EDO-PRECIO-SI                    
           END-IF.                                                              
           IF S140-EDO-PRECIO-SI = '0'                                          
              PERFORM 140-LEE-PRECIO-SI                                         
              PERFORM 135-GRABA-PRECIO-SI UNTIL S140-EDO-PRECIO-SI = '1'        
           END-IF.                                                              
           EXEC SQL                                                             
                CLOSE C140-PRECIO-SI                                            
           END-EXEC.                                                            
           IF NOT ( SQLCODE = 0 OR 100)                                         
               DISPLAY W000-PROG ' ERROR AL CERRAR EL CURSOR '                  
               DISPLAY W000-PROG ' C140-PRECIO-SI'                              
               DISPLAY ' ICONCEPT = ' ICONCEPT OF DCLPRECIO                     
               DISPLAY ' FPRECIO  = ' FPRECIO OF DCLPRECIO                      
               PERFORM 970-SQL-ERROR                                            
           END-IF.                                                              
       130-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       135-GRABA-PRECIO-SI SECTION.                                             
       135-0100-INICIO.                                                         
           IF I140-ID-FPRECIO-LEI = I140-ID-FPRECIO-ANT                         
              GO TO 135-0200-CONTINUA.                                          
           MOVE T010-IOEMISOR(T010-NUM-ELEM)                                    
                                       TO IEMISORA OF DCLPRECIO                 
           MOVE T010-IOSERIE(T010-NUM-ELEM)                                     
                                       TO ISERIE   OF DCLPRECIO                 
           MOVE T010-IOCUPON(T010-NUM-ELEM)                                     
                                       TO ICUPON   OF DCLPRECIO                 
           MOVE T010-IOCONCEP(T010-NUM-ELEM)                                    
                                       TO ICONCEPT OF DCLPRECIO                 
           PERFORM 145-INSERT-PRECIO-SI.                                        
           MOVE FPRECIO OF DCLPRECIO TO I140-ID-FPRECIO-ANT.                    
       135-0200-CONTINUA.                                                       
           PERFORM 140-LEE-PRECIO-SI.                                           
       135-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       140-LEE-PRECIO-SI SECTION.                                               
       140-0100-INICIO.                                                         
              EXEC SQL                                                          
               FETCH C140-PRECIO-SI                                             
               INTO   :DCLPRECIO.ICONCEPT,                                      
                      :DCLPRECIO.IEMISORA,                                      
                      :DCLPRECIO.ISERIE,                                        
                      :DCLPRECIO.ICUPON,                                        
                      :DCLPRECIO.FPRECIO,                                       
                      :DCLPRECIO.HPRECIO,                                       
                      :DCLPRECIO.MPRECOMP,                                      
                      :DCLPRECIO.MPREVTA,                                       
                      :DCLPRECIO.MVALCURV,                                      
                      :DCLPRECIO.ACURVA,                                        
                      :DCLPRECIO.MINTCORR,                                      
                      :DCLPRECIO.CDIASTRA,                                      
                      :DCLPRECIO.AREND,                                         
                      :DCLPRECIO.ARENDS,                                        
                      :DCLPRECIO.ARENDP,                                        
                      :DCLPRECIO.ARENDPS,                                       
                      :DCLPRECIO.ACOSCASA,                                      
                      :DCLPRECIO.ACOSFPRO,                                      
                      :DCLPRECIO.ICONCEXP                                       
              END-EXEC                                                          
              IF NOT ( SQLCODE = 0 OR 100)                                      
                  DISPLAY W000-PROG ' ERROR AL LEER PRECIO '                    
                  DISPLAY W000-PROG ' 140-LEE-PRECIO-SI'                        
                  DISPLAY ' ICONCEPT = ' ICONCEPT OF DCLPRECIO                  
                  DISPLAY ' FPRECIO  = ' FPRECIO OF DCLPRECIO                   
                  PERFORM 970-SQL-ERROR                                         
              END-IF                                                            
              IF  SQLCODE = 0                                                   
                  MOVE FPRECIO OF DCLPRECIO TO I140-ID-FPRECIO-LEI              
              ELSE                                                              
                  MOVE '1'                  TO S140-EDO-PRECIO-SI               
              END-IF.                                                           
       140-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       145-INSERT-PRECIO-SI SECTION.                                            
       145-0100-INICIO.                                                         
           EXEC SQL                                                             
               INSERT INTO PRECIO                                               
                     (ICONCEPT,                                                 
                      IEMISORA,                                                 
                      ISERIE,                                                   
                      ICUPON,                                                   
                      FPRECIO,                                                  
                      HPRECIO,                                                  
                      MPRECOMP,                                                 
                      MPREVTA,                                                  
                      MVALCURV,                                                 
                      ACURVA,                                                   
                      MINTCORR,                                                 
                      CDIASTRA,                                                 
                      AREND,                                                    
                      ARENDS,                                                   
                      ARENDP,                                                   
                      ARENDPS,                                                  
                      ACOSCASA,                                                 
                      ACOSFPRO,                                                 
                      ICONCEXP)                                                 
               VALUES (:DCLPRECIO.ICONCEPT,                                     
                      :DCLPRECIO.IEMISORA,                                      
                      :DCLPRECIO.ISERIE,                                        
                      :DCLPRECIO.ICUPON,                                        
                      :DCLPRECIO.FPRECIO,                                       
                      CURRENT TIME,                                             
                      :DCLPRECIO.MPRECOMP,                                      
                      :DCLPRECIO.MPREVTA,                                       
                      :DCLPRECIO.MVALCURV,                                      
                      :DCLPRECIO.ACURVA,                                        
                      :DCLPRECIO.MINTCORR,                                      
                      :DCLPRECIO.CDIASTRA,                                      
                      :DCLPRECIO.AREND,                                         
                      :DCLPRECIO.ARENDS,                                        
                      :DCLPRECIO.ARENDP,                                        
                      :DCLPRECIO.ARENDPS,                                       
                      :DCLPRECIO.ACOSCASA,                                      
                      :DCLPRECIO.ACOSFPRO,                                      
                      :DCLPRECIO.ICONCEXP)                                      
           END-EXEC.                                                            
           IF NOT ( SQLCODE = 0 OR 100)                                         
             DISPLAY W000-PROG ' ERROR AL INSERTAR EN PRECIO '                  
             DISPLAY W000-PROG ' 145-INSERT-PRECIO-SI        '                  
             DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLPRECIO ') '          
             DISPLAY W000-PROG 'IEMISORA (' IEMISORA OF DCLPRECIO ') '          
             DISPLAY W000-PROG 'ISERIE   (' ISERIE   OF DCLPRECIO ') '          
             DISPLAY W000-PROG 'ICUPON   (' ICUPON   OF DCLPRECIO ') '          
             DISPLAY W000-PROG 'FPRECIO  (' FPRECIO  OF DCLPRECIO ') '          
             PERFORM 970-SQL-ERROR                                              
           END-IF.                                                              
           IF SQLCODE = 100                                                     
              MOVE '1'                  TO S140-EDO-PRECIO-SI                   
           ELSE                                                                 
              MOVE '0'                  TO S140-EDO-PRECIO-SI                   
           END-IF.                                                              
       145-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *                                                                         
       150-GRABA-A3-CURSORES SECTION.                                           
       150-0100-INICIO.                                                         
           INITIALIZE                     A3-REG                                
           MOVE Z800-ICONCEPT          TO A3-ICONCEPT                           
           MOVE Z800-ITIPODER          TO A3-ITIPODER                           
           MOVE W000-SUCURSAL          TO A3-ISUCCASA                           
           MOVE T010-CCUPONES          TO A3-CCUPONES                           
           MOVE T010-CTITOTOR          TO A3-CTITOTOR                           
           MOVE T010-ICRITED           TO A3-ICRITED                            
           MOVE T010-CCUPONES          TO A3-TCCUPONES                          
           MOVE T010-CTITOTOR          TO A3-TCTITOTOR                          
           MOVE T010-IOCONCEP (T010-NUM-ELEM)                                   
                                       TO A3-IOCONCEP                           
           MOVE T010-IOEMISOR (T010-NUM-ELEM)                                   
                                       TO A3-IOEMISOR                           
           MOVE T010-IOSERIE  (T010-NUM-ELEM)                                   
                                       TO A3-IOSERIE                            
           MOVE T010-IOCUPON  (T010-NUM-ELEM)                                   
                                       TO A3-IOCUPON                            
           MOVE T010-POTORG   (T010-NUM-ELEM)                                   
                                       TO A3-POTORG                             
      *                                                                         
           WRITE REG-TA3-CURSORES      FROM A3-REG                              
           IF    W000-ARCH-A3-ST       NOT  = '00'                              
              DISPLAY W000-PROG                                                 
                    ' *****  150-GRABA-A3-CURSORES ***** '                      
              DISPLAY W000-PROG                                                 
                    ' ERROR AL ESCRIBIR REG-TA3-CURSORES '                      
              DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A3-ST               
              PERFORM 980-ABORTA                                                
           END-IF.                                                              
       150-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *                                                                         
       200-TERMINA SECTION.                                                     
       200-0100-INICIO.                                                         
           EXEC SQL                                                             
                CLOSE C580-CARTERA                                              
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG ' ERROR AL CERRAR CURSOR C580-CARTERA '         
              PERFORM 970-SQL-ERROR.                                            
           MOVE ' '                    TO S580-EDO-CARTERA                      
           PERFORM 210-CALC-RESERVA                                             
           MOVE 1                      TO A000-CONT.                            
       200-0150-CICLO-ESC.                                                      
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 200-0250-CONTINUA.                                          
           IF A000-CONT = 1                                                     
              MOVE T000-TITOT-G(1)     TO R1-11-TITOT1                          
              MOVE T000-RESERVA(1)     TO R1-12-RESTOT1                         
              GO TO 200-0200-CONT-CICLO.                                        
           IF A000-CONT = 2                                                     
              MOVE T000-TITOT-G(2)     TO R1-11-TITOT2                          
              MOVE T000-RESERVA(2)     TO R1-12-RESTOT2                         
              GO TO 200-0200-CONT-CICLO.                                        
           IF A000-CONT = 3                                                     
              MOVE T000-TITOT-G(3)     TO R1-11-TITOT3                          
              MOVE T000-RESERVA(3)     TO R1-12-RESTOT3                         
              GO TO 200-0200-CONT-CICLO.                                        
           IF A000-CONT = 4                                                     
              MOVE T000-TITOT-G(4)     TO R1-11-TITOT4                          
              MOVE T000-RESERVA(4)     TO R1-12-RESTOT4                         
              GO TO 200-0200-CONT-CICLO.                                        
       200-0200-CONT-CICLO.                                                     
           ADD 1 TO A000-CONT                                                   
           GO TO 200-0150-CICLO-ESC.                                            
       200-0250-CONTINUA.                                                       
           MOVE WS-CTA-RESERVA-EMP1    TO W050-ICUENTA                          
           MOVE W050-ICUENTA-N         TO R1-12-ICTARES-N                       
           MOVE W050-ICUENTA-D         TO R1-12-ICTARES-D                       
           MOVE A000-CLIE-PROC-EMP1    TO R1-11-NUM-REGS                        
           MOVE A000-CTITCART-EMP1     TO R1-11-TOTTIT                          
           WRITE R1-REG              FROM R1-12-TOT2 AFTER 3                    
           WRITE R1-REG              FROM R1-11-TOT1 AFTER 2                    
           WRITE R1-REG              FROM R1-99-FIN  AFTER 2                    
           ADD 7 TO R1-NUM-LIN                                                  
           PERFORM 215-CALC-RESERVA                                             
           MOVE 1                      TO A000-CONT.                            
       205-0150-CICLO-ESC.                                                      
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 205-0250-CONTINUA.                                          
           IF A000-CONT = 1                                                     
              MOVE T000-TITOT-G(1)     TO R1-11-TITOT1                          
              MOVE T000-RESERVA(1)     TO R1-12-RESTOT1                         
              GO TO 205-0200-CONT-CICLO.                                        
           IF A000-CONT = 2                                                     
              MOVE T000-TITOT-G(2)     TO R1-11-TITOT2                          
              MOVE T000-RESERVA(2)     TO R1-12-RESTOT2                         
              GO TO 205-0200-CONT-CICLO.                                        
           IF A000-CONT = 3                                                     
              MOVE T000-TITOT-G(3)     TO R1-11-TITOT3                          
              MOVE T000-RESERVA(3)     TO R1-12-RESTOT3                         
              GO TO 205-0200-CONT-CICLO.                                        
           IF A000-CONT = 4                                                     
              MOVE T000-TITOT-G(4)     TO R1-11-TITOT4                          
              MOVE T000-RESERVA(4)     TO R1-12-RESTOT4                         
              GO TO 205-0200-CONT-CICLO.                                        
       205-0200-CONT-CICLO.                                                     
           ADD 1 TO A000-CONT                                                   
           GO TO 205-0150-CICLO-ESC.                                            
       205-0250-CONTINUA.                                                       
           MOVE WS-CTA-RESERVA-EMP2    TO W050-ICUENTA                          
           MOVE W050-ICUENTA-N         TO R1-12-ICTARES-N                       
           MOVE W050-ICUENTA-D         TO R1-12-ICTARES-D                       
           MOVE A000-CLIE-PROC-EMP2    TO R1-11-NUM-REGS                        
           MOVE A000-CTITCART-EMP2     TO R1-11-TOTTIT                          
           WRITE R2-REG              FROM R1-12-TOT2 AFTER 3                    
           WRITE R2-REG              FROM R1-11-TOT1 AFTER 2                    
           WRITE R2-REG              FROM R1-99-FIN  AFTER 2                    
           ADD 7 TO R2-NUM-LIN                                                  
      *                                                                         
           CLOSE   ARCH-A3-CURSORES                                             
              IF   W000-ARCH-A3-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A3-CURSORES'            
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A3-ST            
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
           CLOSE   ARCH-A4-CARTERA                                              
              IF   W000-ARCH-A4-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A4-CARTERA'             
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A4-ST            
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
           CLOSE   ARCH-A5-OPERAVA                                              
              IF   W000-ARCH-A5-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A5-OPERAVA'             
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A5-ST            
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
           CLOSE   ARCH-A6-ZMDT701                                              
              IF   W000-ARCH-A6-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A6-ZMDT701'             
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A6-ST            
                 PERFORM 980-ABORTA                                             
              END-IF                                                            
      *                                                                         
           CLOSE REPO-R1-CASPRE                                                 
                 REPO-R2-BCMPRE.                                                
           MOVE ' '                    TO S700-EDO-R1.                          
       200-0300-ACT-APLIDER.                                                    
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLAPLIDER                
           MOVE Z800-ITIPOPRO          TO ITIPOPRO OF DCLAPLIDER                
           MOVE W000-PROG              TO IUSERAUT OF DCLAPLIDER                
           MOVE SPACES                 TO ITERM    OF DCLAPLIDER                
           PERFORM 600-ACTUALIZA-APLIDER.                                       
       200-0400-BAJA-OTORGANTE.                                                 
           IF Z800-ITIPOPRO = 'D'                                               
              MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLCONCEPT             
              PERFORM 530-LEE-CONCEPT                                           
              MOVE P05FECHO               TO FBAJA    OF DCLCONCEPT             
              MOVE 0                      TO NL-CONCEPT-FBAJA                   
              MOVE '0'                    TO SBLOQUEO OF DCLCONCEPT             
              MOVE W000-PROG              TO IUSERAUT OF DCLCONCEPT             
              MOVE SPACES                 TO ITERM    OF DCLCONCEPT             
              IF ITIPOEMI OF DCLCONCEPT NOT = 'SI1'                             
                PERFORM 610-ACT-CONCEPT                                         
              END-IF                                                            
              MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLAGPOCON             
              PERFORM 535-LEE-AGPOCON                                           
              IF S535-EDO-AGPOCON = '0'                                         
                 PERFORM 615-BORRA-AGPOCON                                      
              END-IF                                                            
              PERFORM 035-MOV-CONCCAMC                                          
              MOVE 'B'                    TO STIPOMOV OF DCLCAMCONC             
      *                                                                         
      *---    PERFORM 630-ALTA-CAMCONC                                          
              PERFORM 630-ALTA-CAMCONC.                                         
      /                                                                         
       210-CALC-RESERVA SECTION.                                                
       210-0100-INICIO.                                                         
           MOVE 1                      TO A000-CONT.                            
       210-0150-CICLO.                                                          
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 210-9900-FIN.                                               
           IF T010-ICRITED = 'TT'                                               
              COMPUTE W070-RESULT = A000-CTITCART-EMP1 /                        
                                    T010-CCUPONES                               
              COMPUTE T000-TITOT-G(A000-CONT) =                                 
                  W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                  / 100                                                         
              GO TO 210-0200-CONT-CICLO.                                        
           IF T010-ICRITED = 'RR'                                               
              GO TO 210-0150-RR.                                                
           IF T010-ICRITED = 'TR'                                               
              GO TO 210-0160-TR.                                                
       210-0150-RR.                                                             
              COMPUTE W000-AUXILIAR = (A000-CTITCART-EMP1 /                     
                                       T010-CCUPONES)                           
              IF W000-AUXILIAR > 0                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR + 0.5                      
              ELSE                                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR - 0.5.                     
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              IF W000-AUXILIAR > 0                                              
                 COMPUTE T000-TITOT-G(A000-CONT) =                              
                         W000-AUXILIAR + 0.5                                    
              ELSE                                                              
                 COMPUTE T000-TITOT-G(A000-CONT) =                              
                         W000-AUXILIAR - 0.5.                                   
              GO TO 210-0200-CONT-CICLO.                                        
       210-0160-TR.                                                             
              COMPUTE W070-RESULT-DEC = A000-CTITCART-EMP1 /                    
                                    T010-CCUPONES                               
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT-DEC * T010-CTITOTOR *                             
                  T010-POTORG(A000-CONT) / 100)                                 
              MOVE W000-AUXILIAR TO T000-TITOT-G(A000-CONT)                     
              GO TO 210-0200-CONT-CICLO.                                        
       210-0200-CONT-CICLO.                                                     
           COMPUTE T000-RESERVA(A000-CONT) = T000-TITOT-G(A000-CONT) -          
                                   T000-TITOT-I-EMP1(A000-CONT).                
           IF T000-RESERVA(A000-CONT) > 0                                       
           AND Z800-ITIPOPRO = 'D'                                              
              MOVE WS-CTA-RESERVA-EMP1    TO ICUENTA OF DCLCARTERA              
                                             W110-ICUENTA                       
              PERFORM 220-ACT-CARTOP.                                           
           ADD 1 TO A000-CONT                                                   
           GO TO 210-0150-CICLO.                                                
       210-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       215-CALC-RESERVA SECTION.                                                
       215-0100-INICIO.                                                         
           MOVE 1                      TO A000-CONT.                            
       215-0150-CICLO.                                                          
           IF A000-CONT > T010-NUM-ELEM                                         
              GO TO 215-9900-FIN.                                               
           IF T010-ICRITED = 'TT'                                               
              COMPUTE W070-RESULT = A000-CTITCART-EMP2 /                        
                                    T010-CCUPONES                               
              COMPUTE T000-TITOT-G(A000-CONT) =                                 
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                  / 100)                                                        
              GO TO 215-0200-CONT-CICLO.                                        
           IF T010-ICRITED = 'RR'                                               
              GO TO 215-0150-RR.                                                
           IF T010-ICRITED = 'TR'                                               
              GO TO 215-0160-TR.                                                
       215-0150-RR.                                                             
              COMPUTE W000-AUXILIAR = (A000-CTITCART-EMP2 /                     
                                       T010-CCUPONES)                           
              IF W000-AUXILIAR > 0                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR + 0.5                      
              ELSE                                                              
                 COMPUTE W070-RESULT = W000-AUXILIAR - 0.5.                     
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT * T010-CTITOTOR * T010-POTORG(A000-CONT)          
                 / 100)                                                         
              IF W000-AUXILIAR > 0                                              
                 COMPUTE T000-TITOT-G(A000-CONT) =                              
                         W000-AUXILIAR + 0.5                                    
              ELSE                                                              
                 COMPUTE T000-TITOT-G(A000-CONT) =                              
                         W000-AUXILIAR - 0.5.                                   
              GO TO 215-0200-CONT-CICLO.                                        
       215-0160-TR.                                                             
              COMPUTE W070-RESULT-DEC = A000-CTITCART-EMP2 /                    
                                    T010-CCUPONES                               
              COMPUTE W000-AUXILIAR =                                           
                 (W070-RESULT-DEC * T010-CTITOTOR *                             
                  T010-POTORG(A000-CONT) / 100)                                 
              MOVE W000-AUXILIAR TO T000-TITOT-G(A000-CONT)                     
              GO TO 215-0200-CONT-CICLO.                                        
       215-0200-CONT-CICLO.                                                     
           COMPUTE T000-RESERVA(A000-CONT) = T000-TITOT-G(A000-CONT) -          
                                        T000-TITOT-I-EMP2(A000-CONT).           
           IF T000-RESERVA(A000-CONT) > 0                                       
           AND Z800-ITIPOPRO = 'D'                                              
              MOVE WS-CTA-RESERVA-EMP2    TO ICUENTA OF DCLCARTERA              
                                             W110-ICUENTA                       
              PERFORM 220-ACT-CARTOP.                                           
           ADD 1 TO A000-CONT                                                   
           GO TO 215-0150-CICLO.                                                
       215-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       220-ACT-CARTOP SECTION.                                                  
       220-0100-INICIO.                                                         
           PERFORM 590-LEE-CUENTA                                               
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLPRECIO                 
           PERFORM 540-LEE-PRECIO                                               
           MOVE 1                      TO W110-IDIACAR                          
           MOVE 0                      TO W110-IFOLOPES                         
           MOVE 0                      TO W110-ICVEOPES                         
           MOVE 'C'                    TO W110-ITIPOTEN                         
           MOVE Z800-ICONCEPT          TO W110-ICONCEPT                         
           PERFORM 520-LEE-CARTERA                                              
      *--- SE CAMBIA ICONCEPT ACTUAL EN CTA RESERVA                             
           MOVE T010-IOCONCEP(A000-CONT)                                        
                                       TO W110-ICONCEPT                         
           IF S520-EDO-CARTERA = '0'                                            
            GO TO 220-0150-ACT-CARTERA.                                         
           GO TO 220-0200-INS-CARTERA.                                          
       220-0150-ACT-CARTERA.                                                    
      *--- SE ENVIAN LOS TITULOS DE RESERVA PARA NO INFLAR MONTO                
           MOVE T000-RESERVA(A000-CONT)                                         
                                       TO W110-CTITULOS                         
           MOVE MPRECOMP OF DCLPRECIO  TO W110-MCPROEXI                         
      *                                                                         
      *--- PERFORM 681-ACT-CARTERA                                              
           PERFORM 681-GRABA-A4-CARTERA                                         
           GO TO 220-0250-CONTINUA.                                             
      *                                                                         
       220-0200-INS-CARTERA.                                                    
           MOVE 'C'                    TO W110-SCUENTA                          
           MOVE 'C'                    TO W110-SCONCEPT                         
           MOVE T010-IOEMISOR(A000-CONT)                                        
                                       TO W110-IEMISORA                         
           MOVE T010-IOSERIE(A000-CONT)                                         
                                       TO W110-ISERIE                           
           MOVE T010-IOCUPON(A000-CONT)                                         
                                       TO W110-ICUPON                           
           MOVE P05FECHO               TO W110-FCARTERA                         
           MOVE P05FECHO               TO W110-FULTCOMP                         
           MOVE 'P'                    TO W110-ITIPOCAR                         
           MOVE 'S'                    TO W110-ITIPOSDO                         
           MOVE 0                      TO W110-IREF                             
           MOVE 0                      TO W110-AREND                            
           MOVE T000-RESERVA(A000-CONT)                                         
                                       TO W110-CTITULOS                         
           MOVE 0                      TO W110-MVALMERC                         
           MOVE MPRECOMP OF DCLPRECIO  TO W110-MCPROEXI                         
           MOVE 1                      TO W110-ICONCEXP                         
           MOVE ZEROS                  TO W110-MCPPFA                           
           MOVE ZEROS                  TO W110-MCPPBP                           
      *                                                                         
      *--  PERFORM 685-INS-CARTERA                                              
           PERFORM 685-GRABA-A4-CARTERA.                                        
      *                                                                         
       220-0250-CONTINUA.                                                       
           EXEC SQL                                                             
                CLOSE C520-CARTERA                                              
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL CERRAR C520-CARTERA'                
              PERFORM 970-SQL-ERROR.                                            
      *----                                                                     
      *    RUTINA QUE OBTIENE EL SIGUIENTE IREF                                 
      *----                                                                     
           PERFORM 698-LEE-FOLIO                                                
           MOVE W000-SIGFOLIO            TO OP-SIGFOLIO                         
      *--- solo se modifica lo que requiere A5-REG                              
           INITIALIZE     A5-REG                                                
           MOVE OP-SIGFOLIO              TO A5-IREF                             
           MOVE IOPERA OF DCLDEFOPER     TO A5-IOPERA                           
           IF T000-RESERVA(A000-CONT) > 0                                       
              MOVE 'D'                   TO A5-ITRANS                           
              MOVE 'RECIBO'              TO A5-ETRANS                           
           ELSE                                                                 
              MOVE 'R'                   TO A5-ITRANS                           
              MOVE 'RETIRO'              TO A5-ETRANS                           
              COMPUTE W110-CTITULOS = W110-CTITULOS * (-1).                     
           MOVE EOPERA OF DCLDEFOPER     TO A5-EOPERA                           
           MOVE W110-ICUENTA             TO A5-ICUENTA1                         
           MOVE W110-ICONCEPT            TO A5-ICONCEP2                         
           MOVE T000-RESERVA(A000-CONT)  TO A5-CANT2                            
XMYECC* --INI-XMYECC--                                                          
XMYECC*    MOVE W110-MCPROEXI            TO A5-MCPROEXI                         
XMYECC     MOVE W000-MCPPBP              TO A5-MCPROEXI                         
XMYECC* --FIN-XMYECC--                                                          
           MOVE P05FECHO                 TO A5-FOPERA                           
           MOVE P05FECHO                 TO A5-FLIQUIDA                         
           MOVE IRUTA   OF DCLCUENTA     TO A5-IRUTA                            
           MOVE SLIQUID OF DCLCUENTA     TO A5-SLIQUID                          
XMYECC* --INI-XMYECC--                                                          
XMYECC*    MOVE 0                        TO A5-MPRECIO                          
XMYECC     MOVE W000-MCPPBP              TO A5-MPRECIO                          
XMYECC* --FIN-XMYECC--                                                          
           MOVE W110-IFOLOPES            TO A5-IFOLOPES                         
           MOVE W110-ITIPOTEN            TO A5-ITIPOTEN                         
           MOVE W110-ICVEOPES            TO A5-ICVEOPES                         
           MOVE W110-ICUENTA             TO ICUENTA  OF DCLCUENTA               
           PERFORM 515-LEE-CUENTA                                               
           MOVE IEMPR   OF DCLCUENTA     TO A5-IEMPR                            
      *                                                                         
      *--- PERFORM 690-INS-OPERAVA                                              
           PERFORM 690-GRABA-A5-OPERAVA.                                        
       220-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       500-LEE-EJEACCI SECTION.                                                 
       500-0100-INICIO.                                                         
           EXEC SQL                                                             
               FETCH C500-EJEACCI                                               
               INTO :DCLEJEACCI.IOEMISOR,                                       
                    :DCLEJEACCI.IOSERIE,                                        
                    :DCLEJEACCI.IOCUPON,                                        
                    :DCLEJEACCI.CTITOTOR,                                       
                    :DCLEJEACCI.CCUPONES,                                       
                    :DCLEJEACCI.SCAPITAL,                                       
                    :DCLEJEACCI.POTORG,                                         
                    :DCLEJEACCI.FSIST,                                          
      *O-1.2.2.INI                                                              
      *             :DCLEJEACCI.ICRITED                                         
                    :DCLEJEACCI.ICRITED,                                        
                    :DCLEJEACCI.FACTOR-CC,                                      
                    :DCLEJEACCI.OPCION                                          
      *O-1.2.2.FIN                                                              
               END-EXEC.                                                        
           IF SQLCODE NOT = 0                                                   
               AND SQLCODE NOT = 100                                            
                    DISPLAY W000-PROG ' ERROR EN EL FETCH C500-EJEACCI '        
                    DISPLAY ' ICONCEPT (' ICONCEPT OF DCLEJEACCI ')'            
                    DISPLAY ' ITIPODER (' ITIPODER OF DCLEJEACCI ')'            
      *O-1.2.2.INI                                                              
                    DISPLAY ' IOEMISOR (' IOEMISOR OF DCLEJEACCI ')'            
                    DISPLAY ' IOSERIE  (' IOSERIE  OF DCLEJEACCI ')'            
                    DISPLAY ' IOCUPON  (' IOCUPON  OF DCLEJEACCI ')'            
      *O-1.2.2.FIN                                                              
                    PERFORM 970-SQL-ERROR.                                      
           IF SQLCODE = 100                                                     
               MOVE '1'                TO S500-EDO-EJEACCI.                     
       500-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       505-LEE-DEFOPER SECTION.                                                 
       505-0100-INICIO.                                                         
           EXEC SQL                                                             
                SELECT EOPERA                                                   
                INTO   :DCLDEFOPER.EOPERA                                       
                FROM   DEFOPER                                                  
                WHERE  IOPERA = :DCLDEFOPER.IOPERA                              
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG ' NO SE LOCALIZO EN IOPERA EN DEFOPER '          
             DISPLAY W000-PROG ' 505-0100      '                                
             DISPLAY W000-PROG 'IOPERA (' IOPERA OF DCLDEFOPER ') '             
             PERFORM 970-SQL-ERROR.                                             
       505-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       515-LEE-CUENTA  SECTION.                                                 
       515-0100-INICIO.                                                         
           EXEC SQL                                                             
                SELECT IEMPR                                                    
                INTO   :DCLCUENTA.IEMPR                                         
                FROM   CUENTA                                                   
                WHERE  ICUENTA = :DCLCUENTA.ICUENTA                             
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG ' NO SE ENCONTRO EMPRESA EN CUENTA '             
             DISPLAY W000-PROG ' 515-0100      '                                
             DISPLAY W000-PROG 'ICUENTA (' ICUENTA OF DCLCUENTA ') '            
             PERFORM 970-SQL-ERROR.                                             
           IF SQLCODE = 0                                                       
             MOVE IEMPR OF DCLCUENTA      TO WS-IEMPR-CTA                       
           END-IF.                                                              
       515-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *----                                                                     
      *    LEE CONCEPT POR MEDIO DE: IEMISORA,                                  
      *                              ISERIE,                                    
      *                              ICUPON.                                    
      *----                                                                     
       510-LEE-CONCEPT SECTION.                                                 
       510-0100-INICIO.                                                         
           EXEC SQL                                                             
                SELECT ICONCEPT                                                 
                INTO   :DCLCONCEPT.ICONCEPT                                     
                FROM   CONCEPT                                                  
                WHERE  IEMISORA = :DCLCONCEPT.IEMISORA AND                      
                       ISERIE   = :DCLCONCEPT.ISERIE   AND                      
                       ICUPON   = :DCLCONCEPT.ICUPON   AND                      
                       FBAJA IS NULL                                            
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             AND SQLCODE NOT = 100                                              
             DISPLAY W000-PROG ' NO SE LOCALIZO EN CONCEPT LA ESC '             
             DISPLAY W000-PROG ' DADA DE ALTA 510-0100            '             
             DISPLAY W000-PROG 'IEMISORA (' IEMISORA OF DCLCONCEPT ') '         
             DISPLAY W000-PROG 'ISERIE   (' ISERIE   OF DCLCONCEPT ') '         
             DISPLAY W000-PROG 'ICUPON   (' ICUPON   OF DCLCONCEPT ') '         
             PERFORM 970-SQL-ERROR                                              
           ELSE                                                                 
             DISPLAY W000-PROG ' 510-LEE-CONCEPT '                              
           END-IF                                                               
           IF SQLCODE NOT = 0                                                   
           AND Z800-ITIPOPRO = 'D'                                              
                PERFORM 030-ALTA-ESC-OTORGADA                                   
                GO TO 510-9900-FIN.                                             
           IF ITIPODER OF DCLAPLIDER NOT = 9                                    
           MOVE ICONCEPT OF DCLCONCEPT TO T010-IOCONCEP(T010-NUM-ELEM).         
           IF ITIPODER OF DCLAPLIDER = 9 AND                                    
              (Z800-ITIPOPRO = 'D' OR Z800-ITIPOPRO = 'P')                      
           MOVE ICONCEPT OF DCLCONCEPT TO T010-IOCONCEP(T010-NUM-ELEM).         
       510-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *----                                                                     
      *LEE EMISORA DE SOCIEDADES DE INVERSION                                   
      *----                                                                     
      *----                                                                     
       513-LEE-CONCEPT-SI SECTION.                                              
       513-0100-INICIO.                                                         
           EXEC SQL                                                             
                SELECT ICONCEPT                                                 
                INTO   :DCLCONCEPT.ICONCEPT                                     
                FROM   CONCEPT                                                  
                WHERE  IEMISORA = :DCLCONCEPT.IEMISORA AND                      
                       ISERIE   = :DCLCONCEPT.ISERIE   AND                      
                       ICUPON   = :DCLCONCEPT.ICUPON   AND                      
                       FBAJA IS NULL                                            
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             AND SQLCODE NOT = 100                                              
             DISPLAY W000-PROG ' NO SE LOCALIZO EN CONCEPT LA ESC '             
             DISPLAY W000-PROG ' DADA DE ALTA 513-0100            '             
             DISPLAY W000-PROG 'IEMISORA (' IEMISORA OF DCLCONCEPT ') '         
             DISPLAY W000-PROG 'ISERIE   (' ISERIE   OF DCLCONCEPT ') '         
             DISPLAY W000-PROG 'ICUPON   (' ICUPON   OF DCLCONCEPT ') '         
             PERFORM 970-SQL-ERROR                                              
           ELSE                                                                 
             DISPLAY W000-PROG ' 513-LEE-CONCEPT-SI '                           
             DISPLAY 'S010-SI>>' S010-SI                                        
           END-IF                                                               
           IF SQLCODE NOT = 0                                                   
           AND Z800-ITIPOPRO = 'D'                                              
                PERFORM 030-ALTA-ESC-OTORGADA                                   
                GO TO 513-9900-FIN.                                             
           IF ITIPODER OF DCLAPLIDER NOT = 9                                    
           MOVE ICONCEPT OF DCLCONCEPT TO T010-IOCONCEP(T010-NUM-ELEM).         
           IF ITIPODER OF DCLAPLIDER = 9 AND                                    
              (Z800-ITIPOPRO = 'D' OR Z800-ITIPOPRO = 'P')                      
           MOVE ICONCEPT OF DCLCONCEPT TO T010-IOCONCEP(T010-NUM-ELEM).         
       513-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *----                                                                     
      *    DA DE ALTA CUANDO ES PARA MISMA EMISORA                              
      *----                                                                     
       515-ALT-CONCEPT SECTION.                                                 
       515-0100-INICIO.                                                         
           IF  Z800-ITIPOPRO = 'D'                                              
                PERFORM 030-ALTA-ESC-OTORGADA                                   
           END-IF.                                                              
       515-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *                                                                         
      *----                                                                     
      *    OBTIENE FACTOR INPC                                                  
      *----                                                                     
       516-LEE-TIPCAMB SECTION.                                                 
       516-0100-INICIO.                                                         
      *----                                                                     
           MOVE W000-FECHA              TO WS-FECHA-INPC                        
           MOVE 01                      TO WS-INPC-DD                           
           ADD  01                      TO WS-INPC-MM                           
           IF WS-INPC-MM > 12                                                   
              MOVE 01                   TO WS-INPC-MM                           
              ADD  01                   TO WS-INPC-SSAA                         
           END-IF                                                               
      *----                                                                     
           MOVE ZEROS                   TO MTIPCAM OF DCLTIPCAMB                
           EXEC SQL                                                             
             SELECT MTIPCAM                                                     
               INTO :DCLTIPCAMB.MTIPCAM                                         
               FROM TIPCAMB                                                     
              WHERE IDIVISA  = 'IN'                                             
                AND ICVEPUB  = 'PC'                                             
                AND FCAPTURA = (                                                
                    SELECT MAX(FCAPTURA)                                        
                      FROM TIPCAMB                                              
                     WHERE IDIVISA   = 'IN'                                     
                       AND ICVEPUB   = 'PC'                                     
                       AND FCAPTURA <= :WS-FECHA-INPC )                         
               WITH UR                                                          
           END-EXEC.                                                            
      *----                                                                     
           IF SQLCODE NOT = 0                                                   
             AND SQLCODE NOT = 100                                              
             DISPLAY W000-PROG ' NO SE LOCALIZO TIPCAMB'                        
             DISPLAY W000-PROG ' 516-LEE-TIPCAMB'                               
             DISPLAY W000-PROG 'IDIVISA  (' IDIVISA OF DCLTIPCAMB  ') '         
             DISPLAY W000-PROG 'ICVEPUB  (' ICVEPUB OF DCLTIPCAMB  ') '         
             DISPLAY W000-PROG 'FECHA    (' W000-FECHA             ') '         
             PERFORM 970-SQL-ERROR                                              
           ELSE                                                                 
             DISPLAY W000-PROG ' 516-LEE-TIPCAMB '                              
             DISPLAY 'MTIPCAM>>' MTIPCAM                                        
           END-IF.                                                              
       516-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       520-LEE-CARTERA SECTION.                                                 
       520-0100-INICIO.                                                         
           EXEC SQL                                                             
                OPEN C520-CARTERA                                               
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL ABRIR C520-CARTERA'                 
              PERFORM 970-SQL-ERROR.                                            
           EXEC SQL                                                             
                FETCH C520-CARTERA                                              
                INTO   :W110-CTITULOS,                                          
                       :W110-MCPROEXI,                                          
                       :W110-FULACCPP,                                          
                       :W110-MCPPFA,                                            
                       :W110-MCPPBP                                             
           END-EXEC.                                                            
           IF SQLCODE NOT = 0 AND SQLCODE NOT = 100                             
              DISPLAY W000-PROG '  ERROR AL LEER C520-CARTERA'                  
              DISPLAY W000-PROG 'ICUENTA  (' W110-ICUENTA  ')'                  
              DISPLAY W000-PROG 'ICONCEPT (' W110-ICONCEPT ')'                  
              DISPLAY W000-PROG 'ITIPOTEN (' W110-ITIPOTEN ')'                  
              DISPLAY W000-PROG 'IDIACAR  (' W110-IDIACAR  ')'                  
              DISPLAY W000-PROG 'IFOLOPES (' W110-IFOLOPES ')'                  
              DISPLAY W000-PROG 'ICVEOPES (' W110-ICVEOPES ')'                  
              PERFORM 970-SQL-ERROR.                                            
           IF SQLCODE = 0                                                       
              DISPLAY W000-PROG '<<ENCONTRE LEER C520-CARTERA'                  
              DISPLAY W000-PROG 'ICUENTA  (' W110-ICUENTA  ')'                  
              DISPLAY W000-PROG 'ICONCEPT (' W110-ICONCEPT ')'                  
              DISPLAY W000-PROG 'CTITEFE  (' W110-CTITULOS ')'                  
              DISPLAY W000-PROG 'MCPPFA   (' W110-MCPPFA   ')'                  
              DISPLAY W000-PROG 'MCPPBP   (' W110-MCPPBP   ')'                  
              MOVE '0'              TO S520-EDO-CARTERA.                        
           IF SQLCODE = 100                                                     
              MOVE '1'              TO S520-EDO-CARTERA.                        
       520-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       521-LEE-CREA-TASASRF SECTION.                                            
       521-0100-INICIO.                                                         
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLTASASRF                
           EXEC SQL                                                             
              OPEN C521-TASASRF                                                 
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL ABRIR C521-TASASRF'                 
              PERFORM 970-SQL-ERROR.                                            
            EXEC SQL                                                            
                FETCH C521-TASASRF                                              
                INTO   :DCLTASASRF.ICONCEPT,                                    
                       :DCLTASASRF.ISEC,                                        
                       :DCLTASASRF.CMESPAGO,                                    
                       :DCLTASASRF.SANONAT,                                     
                       :DCLTASASRF.IULTMES,                                     
                       :DCLTASASRF.ATASBRUT,                                    
                       :DCLTASASRF.SVIGEN,                                      
                       :DCLTASASRF.FAMORTIZ,                                    
                       :DCLTASASRF.PAMORTIZ,                                    
                       :DCLTASASRF.SIMPTO,                                      
                       :DCLTASASRF.DVIGTAS,                                     
                       :DCLTASASRF.FVENCTA,                                     
                       :DCLTASASRF.ATASNOMI                                     
             END-EXEC.                                                          
           IF SQLCODE NOT = 0 AND SQLCODE NOT = 100                             
              DISPLAY W000-PROG ' ERROR AL LEER TASASRF'                        
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLTASASRF ')'         
              PERFORM 970-SQL-ERROR.                                            
           IF SQLCODE = 100                                                     
              GO TO 521-0300-TERMINA.                                           
       521-0200-CREA-TASASRF.                                                   
           MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLTASASRF                
           MOVE 1                      TO ISEC OF DCLTASASRF                    
           MOVE W000-PROG              TO IUSERAUT OF DCLTASASRF                
           MOVE ' '                    TO ITERM OF DCLTASASRF.                  
           MOVE 'A'                    TO SVIGEN OF DCLTASASRF.                 
       521-0270-GRABA.                                                          
           EXEC SQL                                                             
               INSERT INTO TASASRF (ICONCEPT,ISEC, CMESPAGO,                    
                      SANONAT, IULTMES, ATASBRUT, SVIGEN, FAMORTIZ,             
                      PAMORTIZ, FSIST, IUSERAUT, ITERM, SIMPTO,                 
                      DVIGTAS, FVENCTA, ATASNOMI)                               
               VALUES (                                                         
                   :DCLTASASRF.ICONCEPT,                                        
                   :DCLTASASRF.ISEC,                                            
                   :DCLTASASRF.CMESPAGO,                                        
                   :DCLTASASRF.SANONAT,                                         
                   :DCLTASASRF.IULTMES,                                         
                   :DCLTASASRF.ATASBRUT,                                        
                   :DCLTASASRF.SVIGEN,                                          
                   :DCLTASASRF.FAMORTIZ,                                        
                   :DCLTASASRF.PAMORTIZ,                                        
                   CURRENT TIMESTAMP,                                           
                   :DCLTASASRF.IUSERAUT,                                        
                   :DCLTASASRF.ITERM,                                           
                   :DCLTASASRF.SIMPTO,                                          
                   :DCLTASASRF.DVIGTAS,                                         
                   :DCLTASASRF.FVENCTA,                                         
                   :DCLTASASRF.ATASNOMI)                                        
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL INSERTAR TASASRF'                   
              DISPLAY W000-PROG '  521-0270                 '                   
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLTASASRF ')'         
              DISPLAY W000-PROG 'ISEC     (' ISEC OF DCLTASASRF ')'             
              PERFORM 970-SQL-ERROR.                                            
       521-0300-TERMINA.                                                        
           EXEC SQL                                                             
              CLOSE C521-TASASRF                                                
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL CERRAR C521-TASASRF'                
              PERFORM 970-SQL-ERROR.                                            
       521-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       522-LEE-CREA-PETROBO SECTION.                                            
       522-0100-INICIO.                                                         
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLPETROBO                
           EXEC SQL                                                             
              OPEN C522-PETROBO                                                 
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL ABRIR C522-PETROBO'                 
              PERFORM 970-SQL-ERROR.                                            
            EXEC SQL                                                            
                FETCH C522-PETROBO                                              
                INTO   :DCLPETROBO.ICONCEPT,                                    
                       :DCLPETROBO.ISEC,                                        
                       :DCLPETROBO.PPETROCE,                                    
                       :DCLPETROBO.MPRECBAR,                                    
                       :DCLPETROBO.ARENDI,                                      
                       :DCLPETROBO.CMESPAGO,                                    
                       :DCLPETROBO.SVIGEN,                                      
                       :DCLPETROBO.FAMORTIZ,                                    
                       :DCLPETROBO.SIMPTO                                       
             END-EXEC.                                                          
           IF SQLCODE NOT = 0 AND SQLCODE NOT = 100                             
              DISPLAY W000-PROG ' ERROR AL LEER PETROBO'                        
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLPETROBO ')'         
              PERFORM 970-SQL-ERROR.                                            
           IF SQLCODE = 100                                                     
              GO TO 522-0300-TERMINA.                                           
       522-0200-CREA-PETROBO.                                                   
           MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLPETROBO                
           MOVE 1                      TO ISEC OF DCLPETROBO                    
           MOVE W000-PROG              TO IUSERAUT OF DCLPETROBO                
           MOVE ' '                    TO ITERM OF DCLPETROBO                   
           MOVE 'A'                    TO SVIGEN OF DCLPETROBO                  
           EXEC SQL                                                             
               INSERT INTO PETROBO (ICONCEPT,ISEC, PPETROCE,                    
                      MPRECBAR, ARENDI, CMESPAGO, SVIGEN,                       
                      FAMORTIZ, FSIST, IUSERAUT, ITERM, SIMPTO)                 
               VALUES (                                                         
                   :DCLPETROBO.ICONCEPT,                                        
                   :DCLPETROBO.ISEC,                                            
                   :DCLPETROBO.PPETROCE,                                        
                   :DCLPETROBO.MPRECBAR,                                        
                   :DCLPETROBO.ARENDI,                                          
                   :DCLPETROBO.CMESPAGO,                                        
                   :DCLPETROBO.SVIGEN,                                          
                   :DCLPETROBO.FAMORTIZ,                                        
                   CURRENT TIMESTAMP,                                           
                   :DCLPETROBO.IUSERAUT,                                        
                   :DCLPETROBO.ITERM,                                           
                   :DCLPETROBO.SIMPTO)                                          
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL INSERTAR PETROBO'                   
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLPETROBO ')'         
              DISPLAY W000-PROG 'ISEC     (' ISEC OF DCLPETROBO ')'             
              PERFORM 970-SQL-ERROR.                                            
       522-0300-TERMINA.                                                        
           EXEC SQL                                                             
              CLOSE C522-PETROBO                                                
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL CERRAR C522-PETROBO'                
              PERFORM 970-SQL-ERROR.                                            
       522-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       523-LEE-CREA-WARRANT SECTION.                                            
       523-0100-INICIO.                                                         
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLWARRANT                
           EXEC SQL                                                             
              OPEN C523-WARRANT                                                 
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL ABRIR C523-WARRANT'                 
              PERFORM 970-SQL-ERROR.                                            
            EXEC SQL                                                            
                FETCH C523-WARRANT                                              
                INTO   :DCLWARRANT.ICONCEPT,                                    
                       :DCLWARRANT.ITIPOWAR,                                    
                       :DCLWARRANT.STIPOEJE,                                    
                       :DCLWARRANT.MPRIMAW,                                     
                       :DCLWARRANT.CTITINF,                                     
                       :DCLWARRANT.CTITLOT,                                     
                       :DCLWARRANT.CTITSUP,                                     
                       :DCLWARRANT.ITIPSUB,                                     
                       :DCLWARRANT.MPROSUB,                                     
                       :DCLWARRANT.IAGECOL,                                     
                       :DCLWARRANT.IREPCOM,                                     
                       :DCLWARRANT.ICUENTA,                                     
                       :DCLWARRANT.ECARESP                                      
             END-EXEC.                                                          
           IF SQLCODE NOT = 0 AND SQLCODE NOT = 100                             
              DISPLAY W000-PROG ' ERROR AL LEER WARRANT'                        
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLWARRANT ')'         
              PERFORM 970-SQL-ERROR.                                            
           IF SQLCODE = 100                                                     
              DISPLAY 'ERROR AL LEER WARRANT'                                   
              GO TO 523-0300-TERMINA.                                           
       523-0200-CREA-WARRANT.                                                   
           PERFORM 530-LEE-CONCEPT                                              
           MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLWARRANT                
           EXEC SQL                                                             
               INSERT INTO WARRANT (ICONCEPT,ITIPOWAR, STIPOEJE,                
                      MPRIMAW, CTITINF, CTITLOT, CTITSUP, ITIPSUB,              
                      MPROSUB, IAGECOL, IREPCOM, ICUENTA, ECARESP,              
                      FREG)                                                     
               VALUES (                                                         
                       :DCLWARRANT.ICONCEPT,                                    
                       :DCLWARRANT.ITIPOWAR,                                    
                       :DCLWARRANT.STIPOEJE,                                    
                       :DCLWARRANT.MPRIMAW,                                     
                       :DCLWARRANT.CTITINF,                                     
                       :DCLWARRANT.CTITLOT,                                     
                       :DCLWARRANT.CTITSUP,                                     
                       :DCLWARRANT.ITIPSUB,                                     
                       :DCLWARRANT.MPROSUB,                                     
                       :DCLWARRANT.IAGECOL,                                     
                       :DCLWARRANT.IREPCOM,                                     
                       :DCLWARRANT.ICUENTA,                                     
                       :DCLWARRANT.ECARESP,                                     
                       :DCLCONCEPT.FSIST)                                       
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL INSERTAR WARRANT'                   
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLWARRANT ')'         
              PERFORM 970-SQL-ERROR.                                            
       523-0300-TERMINA.                                                        
           EXEC SQL                                                             
              CLOSE C523-WARRANT                                                
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL CERRAR C523-WARRANT'                
              PERFORM 970-SQL-ERROR.                                            
       523-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       524-LEE-CREA-VALORSB SECTION.                                            
       524-0100-INICIO.                                                         
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLVALORSB                
           EXEC SQL                                                             
              OPEN C524-VALORSB                                                 
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL ABRIR C524-VALORSB'                 
              PERFORM 970-SQL-ERROR.                                            
            EXEC SQL                                                            
                FETCH C524-VALORSB                                              
                INTO   :DCLVALORSB.ICONCEPT,                                    
                       :DCLVALORSB.ICONCEP1,                                    
                       :DCLVALORSB.IEMISORA   :NL-VALORSB-IEMISORA,             
                       :DCLVALORSB.ISERIE     :NL-VALORSB-ISERIE,               
                       :DCLVALORSB.ICUPON     :NL-VALORSB-ICUPON,               
                       :DCLVALORSB.IINDICE    :NL-VALORSB-IINDICE,              
                       :DCLVALORSB.CINDICE    :NL-VALORSB-CINDICE,              
                       :DCLVALORSB.PPORPAR                                      
             END-EXEC.                                                          
           IF SQLCODE NOT = 0 AND SQLCODE NOT = 100                             
              DISPLAY W000-PROG ' ERROR AL LEER VALORSB'                        
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLVALORSB ')'         
              PERFORM 970-SQL-ERROR.                                            
           IF SQLCODE = 100                                                     
              GO TO 524-0300-TERMINA.                                           
       524-0200-CREA-VALORSB.                                                   
      *----                                                                     
      *    CHECA NULOS                                                          
      *----                                                                     
           IF NL-VALORSB-IEMISORA NOT = 0                                       
               MOVE ' '                TO IEMISORA OF DCLVALORSB.               
           IF NL-VALORSB-ISERIE   NOT = 0                                       
               MOVE ' '                TO ISERIE OF DCLVALORSB.                 
           IF NL-VALORSB-ICUPON   NOT = 0                                       
               MOVE 0                  TO ICUPON OF DCLVALORSB.                 
           IF NL-VALORSB-IINDICE  NOT = 0                                       
               MOVE ' '                TO IINDICE OF DCLVALORSB.                
           IF NL-VALORSB-CINDICE  NOT = 0                                       
               MOVE 0                  TO CINDICE OF DCLVALORSB.                
      *----                                                                     
           MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLVALORSB                
           EXEC SQL                                                             
               INSERT INTO VALORSB (ICONCEPT, ICONCEP1, IEMISORA,               
                      ISERIE, ICUPON, IINDICE, CINDICE, PPORPAR,                
                      FREG, IUSUARIO, IPROGRAM)                                 
               VALUES (                                                         
                       :DCLVALORSB.ICONCEPT,                                    
                       :DCLVALORSB.ICONCEP1,                                    
                       :DCLVALORSB.IEMISORA,                                    
                       :DCLVALORSB.ISERIE,                                      
                       :DCLVALORSB.ICUPON,                                      
                       :DCLVALORSB.IINDICE,                                     
                       :DCLVALORSB.CINDICE,                                     
                       :DCLVALORSB.PPORPAR,                                     
                       :DCLCONCEPT.FSIST,                                       
                       :DCLCONCEPT.IUSERAUT,                                    
                       'ZM4EHA06')                                              
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL INSERTAR VALORSB'                   
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLVALORSB ')'         
              PERFORM 970-SQL-ERROR.                                            
       524-0300-TERMINA.                                                        
           EXEC SQL                                                             
              CLOSE C524-VALORSB                                                
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL CERRAR C524-VALORSB'                
              PERFORM 970-SQL-ERROR.                                            
       524-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *----                                                                     
       525-LEE-CREA-PERIOWR SECTION.                                            
       525-0100-INICIO.                                                         
           MOVE Z800-ICONCEPT          TO ICONCEPT OF DCLPERIOWR                
           EXEC SQL                                                             
              OPEN C525-PERIOWR                                                 
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL ABRIR C525-PERIOWR'                 
              PERFORM 970-SQL-ERROR.                                            
            EXEC SQL                                                            
                FETCH C525-PERIOWR                                              
                INTO   :DCLPERIOWR.ICONCEPT,                                    
                       :DCLPERIOWR.FVIGEN   :NL-PERIOWR-FVIGEN,                 
                       :DCLPERIOWR.FVENC    :NL-PERIOWR-FVENC                   
             END-EXEC.                                                          
           IF SQLCODE NOT = 0 AND SQLCODE NOT = 100                             
              DISPLAY W000-PROG ' ERROR AL LEER PERIOWR'                        
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLPERIOWR ')'         
              PERFORM 970-SQL-ERROR.                                            
           IF SQLCODE = 100                                                     
              GO TO 525-0300-TERMINA.                                           
       525-0200-CREA-PERIOWR.                                                   
      *----                                                                     
      *    CHECA NULOS                                                          
      *----                                                                     
           IF NL-PERIOWR-FVIGEN   NOT = 0                                       
               MOVE '0001-01-01'       TO FVIGEN OF DCLPERIOWR.                 
           IF NL-PERIOWR-FVENC    NOT = 0                                       
               MOVE ' '                TO FVENC OF DCLPERIOWR.                  
      *----                                                                     
           MOVE ICONCEPT OF DCLCONCEPT TO ICONCEPT OF DCLPERIOWR                
           EXEC SQL                                                             
               INSERT INTO PERIOWR (ICONCEPT, FVIGEN, FVENC,                    
                                    FREG, IUSUARIO, IPROGRAM)                   
               VALUES (                                                         
                       :DCLPERIOWR.ICONCEPT,                                    
                       :DCLPERIOWR.FVIGEN,                                      
                       :DCLPERIOWR.FVENC,                                       
                       :DCLCONCEPT.FSIST,                                       
                       :DCLCONCEPT.IUSERAUT,                                    
                       'ZM4EHA06')                                              
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL INSERTAR PERIOWR'                   
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLPERIOWR ')'         
              PERFORM 970-SQL-ERROR.                                            
       525-0300-TERMINA.                                                        
           EXEC SQL                                                             
              CLOSE C525-PERIOWR                                                
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG '  ERROR AL CERRAR C525-PERIOWR'                
              PERFORM 970-SQL-ERROR.                                            
       525-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *    LEE CONCEPT POR MEDIO DE: ICONCEPT.                                  
      *----                                                                     
       530-LEE-CONCEPT SECTION.                                                 
       530-0100-INICIO.                                                         
           EXEC SQL                                                             
               SELECT ICONCEPT,                                                 
                      ECONCEPT,                                                 
                      ITIPOCON,                                                 
                      MVALNOM,                                                  
                      ICONCEXP,                                                 
                      IEMISORA,                                                 
                      ISERIE,                                                   
                      ICUPON,                                                   
                      ICONTAB,                                                  
                      ICTAPROV,                                                 
                      ICORRO,                                                   
                      ITIPOVAL,                                                 
                      IVALBM,                                                   
                      FALTA,                                                    
                      FBAJA,                                                    
                      FCOLOCA,                                                  
                      FVENC,                                                    
                      CLOTEMIN,                                                 
                      ABURSA,                                                   
                      AISR,                                                     
                      PCOMIS1,                                                  
                      MLIMCOM,                                                  
                      PCOMIS2,                                                  
                      SCOLOCA,                                                  
                      SCUBMAR,                                                  
                      ITIPOMER,                                                 
                      ITIPOEMI,                                                 
                      ITIPOLP,                                                  
                      SBLOQUEO,                                                 
                      SVALNOM,                                                  
                      MVALNOMB,                                                 
                      FSIST,                                                    
                      SLIQEMI,                                                  
                      SCUSTOD,                                                  
                      ITIPOCLA,                                                 
                      IISIN,                                                    
                      SCOMIS,                                                   
                      ITVBMV                                                    
               INTO   :DCLCONCEPT.ICONCEPT,                                     
                      :DCLCONCEPT.ECONCEPT,                                     
                      :DCLCONCEPT.ITIPOCON,                                     
                      :DCLCONCEPT.MVALNOM,                                      
                      :DCLCONCEPT.ICONCEXP :NL-CONCEPT-ICONCEXP,                
                      :DCLCONCEPT.IEMISORA :NL-CONCEPT-IEMISORA,                
                      :DCLCONCEPT.ISERIE   :NL-CONCEPT-ISERIE,                  
                      :DCLCONCEPT.ICUPON   :NL-CONCEPT-ICUPON,                  
                      :DCLCONCEPT.ICONTAB,                                      
                      :DCLCONCEPT.ICTAPROV :NL-CONCEPT-ICTAPROV,                
                      :DCLCONCEPT.ICORRO   :NL-CONCEPT-ICORRO,                  
                      :DCLCONCEPT.ITIPOVAL :NL-CONCEPT-ITIPOVAL,                
                      :DCLCONCEPT.IVALBM   :NL-CONCEPT-IVALBM,                  
                      :DCLCONCEPT.FALTA,                                        
                      :DCLCONCEPT.FBAJA    :NL-CONCEPT-FBAJA,                   
                      :DCLCONCEPT.FCOLOCA,                                      
                      :DCLCONCEPT.FVENC    :NL-CONCEPT-FVENC,                   
                      :DCLCONCEPT.CLOTEMIN,                                     
                      :DCLCONCEPT.ABURSA   :NL-CONCEPT-ABURSA,                  
                      :DCLCONCEPT.AISR,                                         
                      :DCLCONCEPT.PCOMIS1,                                      
                      :DCLCONCEPT.MLIMCOM,                                      
                      :DCLCONCEPT.PCOMIS2,                                      
                      :DCLCONCEPT.SCOLOCA,                                      
                      :DCLCONCEPT.SCUBMAR,                                      
                      :DCLCONCEPT.ITIPOMER,                                     
                      :DCLCONCEPT.ITIPOEMI,                                     
                      :DCLCONCEPT.ITIPOLP,                                      
                      :DCLCONCEPT.SBLOQUEO,                                     
                      :DCLCONCEPT.SVALNOM,                                      
                      :DCLCONCEPT.MVALNOMB,                                     
                      :DCLCONCEPT.FSIST,                                        
                      :DCLCONCEPT.SLIQEMI,                                      
                      :DCLCONCEPT.SCUSTOD,                                      
                      :DCLCONCEPT.ITIPOCLA,                                     
                      :DCLCONCEPT.IISIN,                                        
                      :DCLCONCEPT.SCOMIS,                                       
                      :DCLCONCEPT.ITVBMV                                        
               FROM   CONCEPT                                                   
               WHERE  ICONCEPT = :DCLCONCEPT.ICONCEPT                           
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               DISPLAY W000-PROG 'NO SE LOCALIZO LA E-S-C EN CONCEPT'           
               DISPLAY ' ICONCEPT (' ICONCEPT OF DCLCONCEPT ')'                 
               PERFORM 970-SQL-ERROR.                                           
      *----                                                                     
      *    CHECA NULOS                                                          
      *----                                                                     
           IF NL-CONCEPT-IEMISORA NOT = 0                                       
               MOVE ' '                TO IEMISORA OF DCLCONCEPT.               
           IF NL-CONCEPT-ISERIE   NOT = 0                                       
               MOVE ' '                TO ISERIE   OF DCLCONCEPT.               
           IF NL-CONCEPT-ICUPON   NOT = 0                                       
               MOVE 0                  TO ICUPON   OF DCLCONCEPT.               
           IF NL-CONCEPT-FBAJA    NOT = 0                                       
               MOVE ' '                TO FBAJA    OF DCLCONCEPT.               
           IF NL-CONCEPT-FVENC    NOT = 0                                       
               MOVE ' '                TO FVENC    OF DCLCONCEPT.               
           IF NL-CONCEPT-ITIPOVAL NOT = 0                                       
               MOVE 0                  TO ITIPOVAL OF DCLCONCEPT.               
           IF NL-CONCEPT-ICONCEXP NOT = 0                                       
               MOVE 0                  TO ICONCEXP OF DCLCONCEPT.               
           IF NL-CONCEPT-ICTAPROV NOT = 0                                       
               MOVE 0                  TO ICTAPROV OF DCLCONCEPT.               
           IF NL-CONCEPT-ICORRO   NOT = 0                                       
               MOVE 0                  TO ICORRO   OF DCLCONCEPT.               
           IF NL-CONCEPT-IVALBM   NOT = 0                                       
               MOVE 0                  TO IVALBM   OF DCLCONCEPT.               
           IF NL-CONCEPT-ABURSA   NOT = 0                                       
               MOVE 0                  TO ABURSA   OF DCLCONCEPT.               
               MOVE ITVBMV   OF DCLCONCEPT  TO W000-AUX-ITVBMV.                 
       530-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       535-LEE-AGPOCON  SECTION.                                                
       535-0100-INICIO.                                                         
           MOVE '0'                    TO S535-EDO-AGPOCON.                     
           EXEC SQL                                                             
               SELECT T2.IGPOCONC                                               
               INTO   :DCLAGPOCON.IGPOCONC                                      
               FROM   GPOCONC T1, AGPOCON T2                                    
               WHERE                                                            
                      T1.IPROCESO = 'CMI'                                       
               AND    T1.IGPOCONC = T2.IGPOCONC                                 
               AND    T2.ICONCEPT = :DCLAGPOCON.ICONCEPT                        
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               AND SQLCODE NOT = 100                                            
               DISPLAY W000-PROG '**********************************'           
               DISPLAY W000-PROG '**  535-LEE-AGPOCON               '           
               DISPLAY W000-PROG 'ICONCEPT = ' ICONCEPT OF DCLAGPOCON           
               PERFORM 970-SQL-ERROR.                                           
           IF SQLCODE = 100                                                     
              MOVE '1'                  TO S535-EDO-AGPOCON.                    
       535-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       540-LEE-PRECIO SECTION.                                                  
       540-0100-INICIO.                                                         
           EXEC SQL                                                             
                OPEN C540-PRECIO                                                
           END-EXEC.                                                            
           EXEC SQL                                                             
               FETCH C540-PRECIO                                                
               INTO   :DCLPRECIO.ICONCEPT,                                      
                      :DCLPRECIO.IEMISORA  :NL-PRECIO-IEMISORA,                 
                      :DCLPRECIO.ISERIE    :NL-PRECIO-ISERIE,                   
                      :DCLPRECIO.ICUPON    :NL-PRECIO-ICUPON,                   
                      :DCLPRECIO.FPRECIO,                                       
                      :DCLPRECIO.HPRECIO,                                       
                      :DCLPRECIO.MPRECOMP,                                      
                      :DCLPRECIO.MPREVTA   :NL-PRECIO-MPREVTA,                  
                      :DCLPRECIO.MVALCURV  :NL-PRECIO-MVALCURV,                 
                      :DCLPRECIO.ACURVA    :NL-PRECIO-ACURVA,                   
                      :DCLPRECIO.MINTCORR  :NL-PRECIO-MINTCORR,                 
                      :DCLPRECIO.CDIASTRA  :NL-PRECIO-CDIASTRA,                 
                      :DCLPRECIO.AREND     :NL-PRECIO-AREND,                    
                      :DCLPRECIO.ARENDS    :NL-PRECIO-ARENDS,                   
                      :DCLPRECIO.ARENDP    :NL-PRECIO-ARENDP,                   
                      :DCLPRECIO.ARENDPS   :NL-PRECIO-ARENDPS,                  
                      :DCLPRECIO.ACOSCASA  :NL-PRECIO-ACOSCASA,                 
                      :DCLPRECIO.ACOSFPRO  :NL-PRECIO-ACOSFPRO,                 
                      :DCLPRECIO.ICONCEXP                                       
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               DISPLAY W000-PROG ' NO SE LOCALIZO LA E-S-C EN PRECIO '          
               DISPLAY ' ICONCEPT (' ICONCEPT OF DCLPRECIO ')'                  
               PERFORM 970-SQL-ERROR.                                           
           EXEC SQL                                                             
                CLOSE C540-PRECIO                                               
           END-EXEC.                                                            
      *----                                                                     
      *    CHECA NULOS                                                          
      *----                                                                     
           IF NL-PRECIO-IEMISORA NOT = 0                                        
               MOVE ' '                TO IEMISORA OF DCLPRECIO.                
           IF NL-PRECIO-ISERIE   NOT = 0                                        
               MOVE ' '                TO ISERIE   OF DCLPRECIO.                
           IF NL-PRECIO-ICUPON   NOT = 0                                        
               MOVE 0                  TO ICUPON   OF DCLPRECIO.                
           IF NL-PRECIO-MPREVTA  NOT = 0                                        
               MOVE 0                  TO MPREVTA  OF DCLPRECIO.                
           IF NL-PRECIO-MVALCURV NOT = 0                                        
               MOVE 0                  TO MVALCURV OF DCLPRECIO.                
           IF NL-PRECIO-ACURVA   NOT = 0                                        
               MOVE 0                  TO ACURVA   OF DCLPRECIO.                
           IF NL-PRECIO-MINTCORR NOT = 0                                        
               MOVE 0                  TO MINTCORR OF DCLPRECIO.                
           IF NL-PRECIO-CDIASTRA NOT = 0                                        
               MOVE 0                  TO CDIASTRA OF DCLPRECIO.                
           IF NL-PRECIO-AREND    NOT = 0                                        
               MOVE 0                  TO AREND    OF DCLPRECIO.                
           IF NL-PRECIO-ARENDS   NOT = 0                                        
               MOVE 0                  TO ARENDS   OF DCLPRECIO.                
           IF NL-PRECIO-ARENDP   NOT = 0                                        
               MOVE 0                  TO ARENDP   OF DCLPRECIO.                
           IF NL-PRECIO-ARENDPS  NOT = 0                                        
               MOVE 0                  TO ARENDPS  OF DCLPRECIO.                
           IF NL-PRECIO-ACOSCASA NOT = 0                                        
               MOVE 0                  TO ACOSCASA OF DCLPRECIO.                
           IF NL-PRECIO-ACOSFPRO NOT = 0                                        
               MOVE 0                  TO ACOSFPRO OF DCLPRECIO.                
       540-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *O-1.2.2.INI                                                              
      *551-OBT-PARAM-H06 SECTION.                                               
      *551-0100-INICIO.                                                         
      *O-1.2.2.FIN                                                              
                                                                                
      *--- SE VERIFICA QUE EL PROCESO PUEDA SER EJECUTADO ---*                  
      *O-1.2.2.INI                                                              
      *    MOVE SPACES                 TO DATOSPAR OF DCLPARAM                  
      *    EXEC SQL                                                             
      *        SELECT DATOSPAR                                                  
      *          INTO :DCLPARAM.DATOSPAR                                        
      *          FROM PARAM                                                     
      *         WHERE ITIPOPAR = 'H06'                                          
      *           AND IPARAM   = 'EEEEEEESSSSSSSS999 '                          
      *    END-EXEC                                                             
      *    IF SQLCODE NOT = ZEROS AND                                           
      *       SQLCODE NOT = 100                                                 
      *       DISPLAY W000-PROG ' ERROR EN LECTURA DE PARAM H06 '               
      *       DISPLAY 'ITIPOPAR ( ' ITIPOPAR OF DCLPARAM ' ) '                  
      *       DISPLAY 'IPARAM   ( ' IPARAM   OF DCLPARAM ' ) '                  
      *       PERFORM 970-SQL-ERROR                                             
      *    END-IF.                                                              
      *    IF SQLCODE = 100                                                     
      *    OR DATOSPAR OF DCLPARAM (51:08) = 'CANCELAR'                         
      *       MOVE +100                TO SQLCODE                               
      *       DISPLAY W000-PROG ' PORC. DIST. COSTO PROMEDIO NO EXISTE'         
      *       DISPLAY W000-PROG ' SE CANCELA EL PROGRAMA '                      
      *       DISPLAY 'SQLCODE  ( +100 ) '                                      
      *       DISPLAY 'ITIPOPAR (  H06                ) '                       
      *       DISPLAY 'IPARAM   (  EEEEEEESSSSSSSS999 ) '                       
      *       DISPLAY 'DATOSPAR ( ' DATOSPAR OF DCLPARAM ' ) '                  
      *       PERFORM 970-SQL-ERROR                                             
      *    END-IF.                                                              
      *O-1.2.2.FIN                                                              
      *                                                                         
      *TMP INI                                                                  
                                                                                
      *O-1.2.2.INI                                                              
      *551-0150-LEE.                                                            
      *    MOVE 'N'                     TO WS-SW-PORC-COSTO-PROM                
      *    MOVE 'H06'                   TO ITIPOPAR OF DCLPARAM                 
      *    MOVE SPACES                  TO IPARAM   OF DCLPARAM                 
      *    MOVE IOEMISOR OF DCLEJEACCI  TO IPARAM   OF DCLPARAM (01:07)         
      *    MOVE IOSERIE  OF DCLEJEACCI  TO IPARAM   OF DCLPARAM (08:08)         
      *    MOVE IOCUPON  OF DCLEJEACCI  TO IPARAM   OF DCLPARAM (16:03)         
      *    MOVE SPACES                  TO DATOSPAR OF DCLPARAM                 
      *    EXEC SQL                                                             
      *        SELECT DATOSPAR                                                  
      *          INTO :DCLPARAM.DATOSPAR                                        
      *          FROM PARAM                                                     
      *         WHERE ITIPOPAR = :DCLPARAM.ITIPOPAR                             
      *           AND IPARAM   = :DCLPARAM.IPARAM                               
      *    END-EXEC.                                                            
      *    IF SQLCODE NOT = ZEROS AND                                           
      *       SQLCODE NOT = 100                                                 
      *       DISPLAY W000-PROG ' ERROR EN LECTURA DE PARAM H06 '               
      *       DISPLAY 'ITIPOPAR ( ' ITIPOPAR OF DCLPARAM ' ) '                  
      *       DISPLAY 'IPARAM   ( ' IPARAM   OF DCLPARAM ' ) '                  
      *       DISPLAY 'SQLCODE  ( ' SQLCODE ' ) '                               
      *       PERFORM 970-SQL-ERROR                                             
      *    END-IF.                                                              
      *    IF SQLCODE = ZEROS                                                   
      *       MOVE DATOSPAR OF DCLPARAM (03:09)                                 
      *                                 TO W000-PORCPP-X                        
      *       IF W000-PORCPP-X IS NUMERIC                                       
      *          MOVE 'S'               TO WS-SW-PORC-COSTO-PROM                
      *       END-IF                                                            
      *    ELSE                                                                 
      *       IF IOEMISOR OF DCLEJEACCI NOT = SPACES AND                        
      *          IOSERIE  OF DCLEJEACCI NOT = SPACES                            
      *          IF T010-NUM-ELEM           = 1                                 
      *             MOVE POTORG OF DCLEJEACCI TO W000-PORCPP-N                  
      *             MOVE W000-PORCPP-N        TO W000-PORCPP-E                  
      *             DISPLAY W000-PROG                                           
      *                         ' PORC. DIST. COSTO PROMEDIO NO EXISTE'         
      *             DISPLAY W000-PROG ' PORCPP <== POTORG DE EJEACCI '          
      *                                 W000-PORCPP-E                           
      *             DISPLAY 'SQLCODE  ( +100 ) '                                
      *             DISPLAY 'ITIPOPAR ( ' ITIPOPAR OF DCLPARAM ' ) '            
      *             DISPLAY 'IPARAM   ( ' IPARAM   OF DCLPARAM ' ) '            
      *             DISPLAY 'T010-NUM-ELEM ( ' T010-NUM-ELEM ' ) '              
      *          ELSE                                                           
      *             DISPLAY W000-PROG                                           
      *                         ' PORC. DIST. COSTO PROMEDIO NO EXISTE'         
      *             DISPLAY W000-PROG ' SE CANCELA EL PROGRAMA '                
      *             DISPLAY 'SQLCODE  ( +100 ) '                                
      *             DISPLAY 'ITIPOPAR ( ' ITIPOPAR OF DCLPARAM ' ) '            
      *             DISPLAY 'IPARAM   ( ' IPARAM   OF DCLPARAM ' ) '            
      *             DISPLAY 'T010-NUM-ELEM ( ' T010-NUM-ELEM ' ) '              
      *             PERFORM 970-SQL-ERROR                                       
      *          END-IF                                                         
      *       END-IF                                                            
      *    END-IF.                                                              
      *    IF WS-SW-PORC-COSTO-PROM = 'N'                                       
      *       MOVE POTORG OF DCLEJEACCI TO W000-PORCPP-N                        
      *    END-IF.                                                              
      *O-1.2.2.FIN                                                              
                                                                                
      *TMP FIN                                                                  
      *                                                                         
       551-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
                                                                                
       550-LEE-PARAMT47 SECTION.                                                
       550-0100-INICIO.                                                         
           MOVE 'T47'                  TO ITIPOPAR OF DCLPARAM                  
           MOVE 'VOBA06E'              TO T47-PROG                              
           MOVE T47-IPARAM             TO IPARAM OF DCLPARAM.                   
       550-0150-LEE.                                                            
           EXEC SQL                                                             
               SELECT DATOSPAR                                                  
               INTO   :T47-DATOSPAR                                             
               FROM   PARAM                                                     
               WHERE  ITIPOPAR = :DCLPARAM.ITIPOPAR AND                         
                      IPARAM   = :DCLPARAM.IPARAM                               
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG ' ERROR EN LECTURA DE PARAM P47 '               
              DISPLAY 'ITIPOPAR ( ' T47-ITIPOPAR ' ) '                          
              DISPLAY 'IPARAM   ( ' T47-IPARAM ' ) '                            
              PERFORM 970-SQL-ERROR.                                            
       550-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       560-LEE-PARAMP65 SECTION.                                                
       560-0100-INICIO.                                                         
           EXEC SQL                                                             
                SELECT DATOSPAR                                                 
                INTO   :DCLPARAM.DATOSPAR                                       
                FROM PARAM                                                      
                WHERE  ITIPOPAR = :DCLPARAM.ITIPOPAR AND                        
                       IPARAM   = :DCLPARAM.IPARAM                              
           END-EXEC                                                             
           IF SQLCODE NOT = 0                                                   
               DISPLAY W000-PROG 'ERROR NO SE LOCALIZO PARAM P65 '              
               DISPLAY ' ITIPOPAR (' ITIPOPAR OF DCLPARAM ')'                   
               PERFORM 970-SQL-ERROR.                                           
           MOVE DATOSPAR OF DCLPARAM       TO W560-DATOSPAR.                    
       560-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *--- LEE PARAM DVO PARA HACER LA EFECTACION COMO DIVIDENDO                
      *    OPCIONAL O COMO CANJE REAL                                           
                                                                                
       565-LEE-PARAM    SECTION.                                                
       565-0100-INICIO.                                                         
           EXEC SQL                                                             
                SELECT DATOSPAR                                                 
                INTO   :DCLPARAM.DATOSPAR                                       
                FROM PARAM                                                      
                WHERE  ITIPOPAR = :DCLPARAM.ITIPOPAR AND                        
                       IPARAM   = :DCLPARAM.IPARAM                              
           END-EXEC                                                             
           IF SQLCODE NOT = 0                                                   
              AND SQLCODE NOT = 100                                             
               DISPLAY W000-PROG 'ERROR AL LEER PARAM DVO '                     
               DISPLAY W000-PROG '    565-LEE-PARAM       '                     
               DISPLAY ' ITIPOPAR (' ITIPOPAR OF DCLPARAM ')'                   
               DISPLAY ' IPARAM   (' IPARAM   OF DCLPARAM ')'                   
               PERFORM 970-SQL-ERROR                                            
           ELSE                                                                 
              IF SQLCODE = 0                                                    
                 MOVE SPACES                  TO W000-SUCURSAL                  
                 MOVE '0'                     TO S000-DIV-OPC                   
                 DISPLAY 'ITIPOPAR>' ITIPOPAR OF DCLPARAM                       
                 DISPLAY 'IPARAM  >' IPARAM   OF DCLPARAM                       
              ELSE                                                              
                 MOVE 'CTD'                   TO W000-SUCURSAL                  
                 MOVE '1'                     TO S000-DIV-OPC                   
                 DISPLAY 'SUCURSAL - CTD'                                       
              END-IF                                                            
           END-IF.                                                              
       565-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *--- LEE APLIDER EN CANJE DIV OPCIONAL PARA VALIDAR SI SE OTORGA          
      *    MISMA EMISORA                                                        
                                                                                
       568-LEE-APLIDER  SECTION.                                                
       568-0100-INICIO.                                                         
           EXEC SQL                                                             
                SELECT INEMISOR, INSERIE, INCUPON,                              
                       IOEMISOR, IOSERIE, IOCUPON                               
                INTO   :DCLAPLIDER.INEMISOR, :DCLAPLIDER.INSERIE,               
                       :DCLAPLIDER.INCUPON , :DCLAPLIDER.IOEMISOR,              
                       :DCLAPLIDER.IOSERIE , :DCLAPLIDER.IOCUPON                
                FROM APLIDER                                                    
                WHERE  INEMISOR  = :DCLAPLIDER.INEMISOR                         
                  AND  INSERIE   = :DCLAPLIDER.INSERIE                          
                  AND  INCUPON   = :DCLAPLIDER.INCUPON                          
                  AND  IOEMISOR  = :DCLAPLIDER.IOEMISOR                         
                  AND  IOSERIE   = :DCLAPLIDER.IOSERIE                          
                  AND  IOCUPON   = :DCLAPLIDER.IOCUPON                          
                  AND  FEJERCIC  = :DCLAPLIDER.FEJERCIC                         
           END-EXEC                                                             
           IF SQLCODE NOT = 0                                                   
              AND SQLCODE NOT = 100                                             
               DISPLAY W000-PROG 'ERROR AL LEER APLIDER   '                     
               DISPLAY W000-PROG '    568-LEE-APLIDER     '                     
               DISPLAY ' ICONCEPT (' ICONCEPT OF DCLAPLIDER ')'                 
               PERFORM 970-SQL-ERROR                                            
           ELSE                                                                 
              IF SQLCODE = 0                                                    
                 DISPLAY W000-PROG 'SE OTORGA A MISMA EMISORA'                  
                 MOVE '1'      TO  S000-EDO-APLIDER                             
              ELSE                                                              
                 DISPLAY W000-PROG 'SE OTORGA DIFERENTE EMISORA'                
                 MOVE '0'      TO  S000-EDO-APLIDER                             
              END-IF                                                            
           END-IF.                                                              
       568-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       570-LEE-CTLPROC SECTION.                                                 
       570-0100-INICIO.                                                         
           EXEC SQL                                                             
               SELECT IULTLLA, IDATO1, IDATO2, IDATO3, IDATO4, IDATO5,          
                      IDATO6, IDATO7, IDATO8, IDATO9, IDATO10, IDATO11,         
                      IEMPR                                                     
               INTO   :DCLCTLPROC.IULTLLA, :DCLCTLPROC.IDATO1,                  
                      :DCLCTLPROC.IDATO2, :DCLCTLPROC.IDATO3,                   
                      :DCLCTLPROC.IDATO4, :DCLCTLPROC.IDATO5,                   
                      :DCLCTLPROC.IDATO6, :DCLCTLPROC.IDATO7,                   
                      :DCLCTLPROC.IDATO8, :DCLCTLPROC.IDATO9,                   
                      :DCLCTLPROC.IDATO10, :DCLCTLPROC.IDATO11,                 
                      :DCLCTLPROC.IEMPR                                         
               FROM   CTLPROC                                                   
               WHERE  IAPLICA  = :DCLCTLPROC.IAPLICA  AND                       
                      ISUCCASA = :DCLCTLPROC.ISUCCASA AND                       
                      FEVENTO  = :DCLCTLPROC.FEVENTO  AND                       
                      IEMPR  IN (:WS-EMPRESA, :WS-EMPRESA2)                     
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               AND SQLCODE NOT = 100                                            
                   DISPLAY W000-PROG ' ERROR EN LECTURA DE CTLPROC '            
                   DISPLAY 'IAPLICA  ( ' IAPLICA  OF DCLCTLPROC ' ) '           
                   DISPLAY 'ISUCCASA ( ' ISUCCASA OF DCLCTLPROC ' ) '           
                   DISPLAY 'FEVENTO  ( ' FEVENTO  OF DCLCTLPROC ' ) '           
                   PERFORM 970-SQL-ERROR.                                       
           IF SQLCODE = 100                                                     
              MOVE '1'               TO S570-LEC-EFECTUADA.                     
           IF SQLCODE = 0                                                       
              MOVE '0'               TO S570-LEC-EFECTUADA.                     
       570-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       580-LEE-CARTERA SECTION.                                                 
       580-0100-INICIO.                                                         
           EXEC SQL                                                             
               FETCH  C580-CARTERA                                              
               INTO :DCLCARTERA.ICONCEPT,                                       
                    :DCLCARTERA.CTITEFE,                                        
                    :DCLCARTERA.ICUENTA,                                        
                    :DCLCARTERA.ITIPOSDO,                                       
                    :DCLCARTERA.ITIPOTEN,                                       
                    :DCLCARTERA.IDIACAR,                                        
                    :DCLCARTERA.MCPROEXI,                                       
                    :DCLCARTERA.ICVEOPES,                                       
                    :DCLCARTERA.IFOLOPES,                                       
                    :DCLCARTERA.FULACCPP,                                       
                    :DCLCARTERA.MCPPFA,                                         
                    :DCLCARTERA.MCPPBP                                          
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               AND SQLCODE NOT = 100                                            
                   DISPLAY W000-PROG ' ERROR EN LECTURA DE CARTERA '            
                   DISPLAY W000-PROG ' 580-LEE-CARTERA             '            
                   DISPLAY ' ICONCEPT(' ICONCEPT OF DCLCARTERA ')'              
                   DISPLAY 'ICUENTA  ( ' ICUENTA  OF DCLCARTERA ' ) '           
                   DISPLAY 'ITIPOTEN ( ' ITIPOTEN OF DCLCARTERA ' ) '           
                   DISPLAY 'IFOLOPES ( ' IFOLOPES OF DCLCARTERA ' ) '           
                   DISPLAY ' ICVEOPES(' ICVEOPES OF DCLCARTERA ')'              
                   PERFORM 970-SQL-ERROR.                                       
           IF SQLCODE = 100                                                     
               MOVE '1'                    TO S580-EDO-CARTERA                  
               MOVE HIGH-VALUES            TO I580-ID-LEI.                      
           IF SQLCODE = 0                                                       
             IF WS-IEMPR-CTA = 'CBP' OR SPACES                                  
               ADD 1 TO A000-CLIE-PROC-EMP1                                     
             ELSE                                                               
               ADD 1 TO A000-CLIE-PROC-EMP2                                     
             END-IF                                                             
               ADD  1 TO A990-REG-LEI-CARTERA                                   
               MOVE ICUENTA  OF DCLCARTERA TO I580-ICUENTA-LEI                  
               MOVE ITIPOTEN OF DCLCARTERA TO I580-ITIPOTEN.                    
       580-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       590-LEE-CUENTA SECTION.                                                  
       590-0100-INICIO.                                                         
           MOVE ICUENTA OF DCLCARTERA TO ICUENTA OF DCLCUENTA                   
           EXEC SQL                                                             
               SELECT  NABREV, IRUTA, SLIQUID, ISUCCASA, IPROM,                 
                       IEMPR                                                    
               INTO    :DCLCUENTA.NABREV   :NL-CUENTA-NABREV,                   
                       :DCLCUENTA.IRUTA    :NL-CUENTA-IRUTA,                    
                       :DCLCUENTA.SLIQUID  :NL-CUENTA-SLIQUID,                  
                       :DCLCUENTA.ISUCCASA,                                     
                       :DCLCUENTA.IPROM    :NL-CUENTA-IPROM,                    
                       :DCLCUENTA.IEMPR                                         
               FROM    CUENTA                                                   
               WHERE   ICUENTA = :DCLCUENTA.ICUENTA                             
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               DISPLAY W000-PROG ' NO SE ENCONTRO LA CUENTA EN CUENTA '         
               DISPLAY W000-PROG ' 590-LEE-CUENTA'                              
               DISPLAY W000-PROG ' ICUENTA (' ICUENTA OF DCLCUENTA ') '         
               PERFORM 970-SQL-ERROR.                                           
       590-0150-CHECA-NULOS.                                                    
           IF NL-CUENTA-NABREV NOT = 0                                          
               MOVE ' '                  TO NABREV OF DCLCUENTA.                
           IF NL-CUENTA-IRUTA  NOT = 0                                          
               MOVE ' '                  TO IRUTA  OF DCLCUENTA.                
           IF NL-CUENTA-SLIQUID NOT = 0                                         
               MOVE ' '                  TO SLIQUID OF DCLCUENTA.               
           IF NL-CUENTA-IPROM   NOT = 0                                         
               MOVE 0                    TO IPROM   OF DCLCUENTA.               
       590-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       595-LECTURA-ACT-REGEMOP SECTION.                                         
       595-0100-INICIO.                                                         
      *                                                                         
           EXEC SQL                                                             
               SELECT  FVIGEN, ISEC, SBLOQUEO,                                  
                       CNUMPER, VPERJUR, CNUMEST, VESTMIG, SVIGEN               
                INTO :DCLREGEMOP.FVIGEN,                                        
                     :DCLREGEMOP.ISEC,                                          
                     :DCLREGEMOP.SBLOQUEO,                                      
                     :DCLREGEMOP.CNUMPER,                                       
                     :DCLREGEMOP.VPERJUR,                                       
                     :DCLREGEMOP.CNUMEST,                                       
                     :DCLREGEMOP.VESTMIG,                                       
                     :DCLREGEMOP.SVIGEN                                         
               FROM REGEMOP                                                     
               WHERE ICONCEPT = :W032-ICONCEPT  AND                             
                     ISEC     = :DCLREGEMOP.ISEC AND                            
                     SVIGEN   = 'A'                                             
           END-EXEC.                                                            
      *                                                                         
           IF  NOT (SQLCODE = 0 OR 100)                                         
               DISPLAY W000-PROG '  '                                           
                   'SQL ERROR EN REGEMOP FETCH 595-0100'                        
               DISPLAY W000-PROG 'ICONCEPT (' W032-ICONCEPT ')'                 
               DISPLAY W000-PROG 'ISEC     (' ISEC OF DCLREGEMOP ')'            
               PERFORM 970-SQL-ERROR.                                           
      *                                                                         
           IF  SQLCODE = 100                                                    
               MOVE '1'                   TO S595-EDO                           
               GO TO 595-9900-FIN.                                              
      *                                                                         
       595-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       596-MODIFICAR-REGEMOP SECTION.                                           
       596-0100-INICIO.                                                         
      *                                                                         
           EXEC SQL                                                             
                UPDATE REGEMOP                                                  
                SET SVIGEN = 'B'                                                
                WHERE ICONCEPT = :W032-ICONCEPT  AND                            
                      ISEC     = :DCLREGEMOP.ISEC AND                           
                      SVIGEN   = 'A'                                            
           END-EXEC.                                                            
      *                                                                         
           IF  NOT (SQLCODE = 0)                                                
               DISPLAY W000-PROG '  '                                           
                   'SQL ERROR EN UPDATE REGEMOP 596-0100'                       
               DISPLAY W000-PROG 'ICONCEPT (' W032-ICONCEPT ')'                 
               DISPLAY W000-PROG 'ISEC     (' ISEC   OF DCLREGEMOP ')'          
               PERFORM 970-SQL-ERROR.                                           
      *                                                                         
       596-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       600-ACTUALIZA-APLIDER SECTION.                                           
       600-0100-INICIO.                                                         
           IF ITIPOPRO OF DCLAPLIDER = 'D'                                      
              GO TO 600-0200-DEFINITIVO.                                        
           EXEC SQL                                                             
               UPDATE APLIDER                                                   
               SET   ITIPOPRO = :DCLAPLIDER.ITIPOPRO,                           
                     FSIST    = CURRENT TIMESTAMP,                              
                     IUSERAUT = :DCLAPLIDER.IUSERAUT,                           
                     ITERM    = :DCLAPLIDER.ITERM                               
               WHERE ICONCEPT = :DCLAPLIDER.ICONCEPT AND                        
                     ITIPODER = :DCLAPLIDER.ITIPODER                            
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG 'NO ACTUALIZO ESTADO DE APLIDER'                
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLAPLIDER ')'         
              DISPLAY W000-PROG 'ITIPODER (' ITIPODER OF DCLAPLIDER ')'         
              PERFORM 970-SQL-ERROR.                                            
           GO TO 600-9900-FIN.                                                  
       600-0200-DEFINITIVO.                                                     
           MOVE P05FECHO               TO FEJERCIC OF DCLAPLIDER                
           EXEC SQL                                                             
                SELECT CURRENT TIMESTAMP                                        
                INTO   :WA06-FSIST                                              
                FROM   PARAM                                                    
                WHERE  ITIPOPAR = 'P05'                                         
           END-EXEC                                                             
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG ' NO SE LOCALIZO EN ITIPOPAR '                   
             PERFORM 970-SQL-ERROR                                              
           END-IF                                                               
                                                                                
           MOVE WA06-FSIST             TO WA06-FECHA-SISTEMA                    
           INITIALIZE                     AREA-ENLACE-ZMWBV492                  
           IF WA06-FSIST-HORA  >=  '15.00.00.000000'                            
              MOVE  'H'                      TO  IND-OPCION-ZMWBV492            
              MOVE  P05FECHO                 TO  FECHA-INICIAL-ZMWBV492         
              MOVE  SLIQEMI OF DCLCONCEPT    TO  DIAS-A-CONTAR-ZMWBV492         
              MOVE  SPACES                   TO  FECHA-FINAL-ZMWBV492           
                                                                                
              CALL RUT-ZM6RG042            USING AREA-ENLACE-ZMWBV492           
              IF S000-DIV-OPC = '1'                                             
                 MOVE FECHA-FINAL-ZMWBV492   TO  FCORTE OF DCLAPLIDER           
              ELSE                                                              
                 MOVE P05FECHO               TO  FCORTE OF DCLAPLIDER           
              END-IF                                                            
           ELSE                                                                 
              MOVE  'H'                      TO  IND-OPCION-ZMWBV492            
              MOVE  P05FECHO                 TO  FECHA-INICIAL-ZMWBV492         
              MOVE  SLIQEMI OF DCLCONCEPT    TO  DIAS-A-CONTAR-ZMWBV492         
              MOVE  SPACES                   TO  FECHA-FINAL-ZMWBV492           
                                                                                
              CALL RUT-ZM6RG042            USING AREA-ENLACE-ZMWBV492           
              MOVE FECHA-FINAL-ZMWBV492      TO  WA06-FECHA-HOY                 
      *                                                                         
              MOVE  'H'                      TO  IND-OPCION-ZMWBV492            
              MOVE  WA06-FECHA-HOY           TO  FECHA-INICIAL-ZMWBV492         
              MOVE  -1                       TO  DIAS-A-CONTAR-ZMWBV492         
              MOVE  SPACES                   TO  FECHA-FINAL-ZMWBV492           
                                                                                
              CALL RUT-ZM6RG042             USING AREA-ENLACE-ZMWBV492          
              IF S000-DIV-OPC = '1'                                             
                 MOVE FECHA-FINAL-ZMWBV492   TO  FCORTE OF DCLAPLIDER           
              ELSE                                                              
                 MOVE P05FECHO               TO  FCORTE OF DCLAPLIDER           
              END-IF                                                            
           END-IF                                                               
           EXEC SQL                                                             
               UPDATE APLIDER                                                   
               SET   ITIPOPRO = :DCLAPLIDER.ITIPOPRO,                           
                     FSIST    = CURRENT TIMESTAMP,                              
                     IUSERAUT = :DCLAPLIDER.IUSERAUT,                           
                     FEJERCIC = :DCLAPLIDER.FEJERCIC,                           
                     FCORTE   = :DCLAPLIDER.FCORTE,                             
                     ITERM    = :DCLAPLIDER.ITERM                               
               WHERE ICONCEPT = :DCLAPLIDER.ICONCEPT AND                        
                     ITIPODER = :DCLAPLIDER.ITIPODER                            
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG 'NO ACTUALIZO ESTADO DE APLIDER'                
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLAPLIDER ')'         
              DISPLAY W000-PROG 'ITIPODER (' ITIPODER OF DCLAPLIDER ')'         
              PERFORM 970-SQL-ERROR.                                            
       600-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       610-ACT-CONCEPT SECTION.                                                 
       610-0100-INICIO.                                                         
           EXEC SQL                                                             
                UPDATE CONCEPT                                                  
                SET    FBAJA    = :DCLCONCEPT.FBAJA,                            
                       FSIST    = CURRENT TIMESTAMP,                            
                       IUSERAUT = :DCLCONCEPT.IUSERAUT,                         
                       ITERM    = :DCLCONCEPT.ITERM,                            
                       SBLOQUEO = :DCLCONCEPT.SBLOQUEO                          
                WHERE  ICONCEPT = :DCLCONCEPT.ICONCEPT                          
           END-EXEC                                                             
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG 'ERROR AL ACTUALIZAR CONCEPT '                  
              DISPLAY W000-PROG '610-ACT-CONCEPT             '                  
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLCONCEPT ')'         
              PERFORM 970-SQL-ERROR.                                            
       610-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *                                                                         
       611-GRABA-A6-ZMDT701 SECTION.                                            
       611-0100-INICIO.                                                         
           MOVE W110-ICUENTA            TO A6-LLV-NCTAMUV                       
           MOVE Z800-ICONCEPT           TO A6-LLV-ICONCEPT                      
           MOVE W110-ICONCEPT           TO A6-ICONCEPT                          
           MOVE W110-IEMISORA           TO A6-IEMISORA                          
           MOVE W110-ISERIE             TO A6-ISERIE                            
           MOVE W110-CTITULOS           TO A6-CTITULOS                          
           MOVE W110-TOT-TITOTOR        TO A6-TOT-TITOTOR                       
           EXEC SQL                                                             
               SET :A6-TFREG             = CURRENT TIMESTAMP                    
           END-EXEC                                                             
           MOVE W110-ITIPOTEN           TO A6-ITIPOTEN                          
           MOVE SPACES                  TO A6-ESTATUS-REG                       
      *                                                                         
           WRITE REG-TA6-ZMDT701        FROM A6-REG                             
           IF    W000-ARCH-A6-ST        NOT = '00'                              
              DISPLAY W000-PROG                                                 
                    ' *****  611-GRABA-A6-ZMDT701 ***** '                       
              DISPLAY W000-PROG                                                 
                    ' ERROR AL ESCRIBIR REG-TA6-ZMDT701 '                       
              DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A6-ST               
              PERFORM 980-ABORTA                                                
           END-IF.                                                              
       611-9900-FIN.                                                            
           EXIT.                                                                
      *                                                                         
       615-BORRA-AGPOCON   SECTION.                                             
       615-0100-INICIO.                                                         
           EXEC SQL                                                             
                DELETE                                                          
                FROM AGPOCON                                                    
                WHERE                                                           
                       ICONCEPT = :DCLAGPOCON.ICONCEPT                          
                AND    IGPOCONC = :DCLAGPOCON.IGPOCONC                          
           END-EXEC                                                             
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG 'ERROR AL BORRAR AGPOCON '                      
              DISPLAY W000-PROG '615-BORRA-AGPOCON       '                      
              DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLAGPOCON ')'         
              DISPLAY W000-PROG 'IGPOCONC (' IGPOCONC OF DCLAGPOCON ')'         
              PERFORM 970-SQL-ERROR.                                            
       615-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       620-ALTA-CONCEPT SECTION.                                                
       620-0100-INICIO.                                                         
           EXEC SQL                                                             
               INSERT INTO CONCEPT                                              
                     (ICONCEPT,                                                 
                      ECONCEPT,                                                 
                      ITIPOCON,                                                 
                      MVALNOM,                                                  
                      ICONCEXP,                                                 
                      IEMISORA,                                                 
                      ISERIE,                                                   
                      ICUPON,                                                   
                      ICONTAB,                                                  
                      ICTAPROV,                                                 
                      ICORRO,                                                   
                      ITIPOVAL,                                                 
                      IVALBM,                                                   
                      FALTA,                                                    
                      FBAJA,                                                    
                      FCOLOCA,                                                  
                      FVENC,                                                    
                      CLOTEMIN,                                                 
                      ABURSA,                                                   
                      AISR,                                                     
                      PCOMIS1,                                                  
                      MLIMCOM,                                                  
                      PCOMIS2,                                                  
                      SCOLOCA,                                                  
                      SCUBMAR,                                                  
                      ITIPOMER,                                                 
                      ITIPOEMI,                                                 
                      ITIPOLP,                                                  
                      SBLOQUEO,                                                 
                      SVALNOM,                                                  
                      MVALNOMB,                                                 
                      SLIQEMI,                                                  
                      SCUSTOD,                                                  
                      ITIPOCLA,                                                 
                      FSIST,                                                    
                      IUSERAUT,                                                 
                      ITERM,                                                    
                      IISIN,                                                    
                      SCOMIS,                                                   
                      ITVBMV)                                                   
               VALUES (:DCLCONCEPT.ICONCEPT,                                    
                      :DCLCONCEPT.ECONCEPT,                                     
                      :DCLCONCEPT.ITIPOCON,                                     
                      :DCLCONCEPT.MVALNOM,                                      
                      :DCLCONCEPT.ICONCEXP :NL-CONCEPT-ICONCEXP,                
                      :DCLCONCEPT.IEMISORA :NL-CONCEPT-IEMISORA,                
                      :DCLCONCEPT.ISERIE   :NL-CONCEPT-ISERIE,                  
                      :DCLCONCEPT.ICUPON   :NL-CONCEPT-ICUPON,                  
                      :DCLCONCEPT.ICONTAB,                                      
                      :DCLCONCEPT.ICTAPROV :NL-CONCEPT-ICTAPROV,                
                      :DCLCONCEPT.ICORRO   :NL-CONCEPT-ICORRO,                  
                      :DCLCONCEPT.ITIPOVAL :NL-CONCEPT-ITIPOVAL,                
                      :DCLCONCEPT.IVALBM   :NL-CONCEPT-IVALBM,                  
                      :DCLCONCEPT.FALTA,                                        
                      :DCLCONCEPT.FBAJA    :NL-CONCEPT-FBAJA,                   
                      :DCLCONCEPT.FCOLOCA,                                      
                      :DCLCONCEPT.FVENC    :NL-CONCEPT-FVENC,                   
                      :DCLCONCEPT.CLOTEMIN,                                     
                      :DCLCONCEPT.ABURSA   :NL-CONCEPT-ABURSA,                  
                      :DCLCONCEPT.AISR,                                         
                      :DCLCONCEPT.PCOMIS1,                                      
                      :DCLCONCEPT.MLIMCOM,                                      
                      :DCLCONCEPT.PCOMIS2,                                      
                      :DCLCONCEPT.SCOLOCA,                                      
                      :DCLCONCEPT.SCUBMAR,                                      
                      :DCLCONCEPT.ITIPOMER,                                     
                      :DCLCONCEPT.ITIPOEMI,                                     
                      :DCLCONCEPT.ITIPOLP,                                      
                      :DCLCONCEPT.SBLOQUEO,                                     
                      :DCLCONCEPT.SVALNOM,                                      
                      :DCLCONCEPT.MVALNOMB,                                     
                      :DCLCONCEPT.SLIQEMI,                                      
                      :DCLCONCEPT.SCUSTOD,                                      
                      :DCLCONCEPT.ITIPOCLA,                                     
                       CURRENT TIMESTAMP,                                       
                      :DCLCONCEPT.IUSERAUT,                                     
                      :DCLCONCEPT.ITERM,                                        
                      :DCLCONCEPT.IISIN,                                        
                      :DCLCONCEPT.SCOMIS,                                       
                      :DCLCONCEPT.ITVBMV)                                       
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG ' ERROR AL INSERTAR EN CONCEPT '                 
             DISPLAY W000-PROG ' 620-ACTA-CONCEPT             '                 
             DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLCONCEPT ') '         
             DISPLAY W000-PROG 'IEMISORA (' IEMISORA OF DCLCONCEPT ') '         
             DISPLAY W000-PROG 'ISERIE   (' ISERIE   OF DCLCONCEPT ') '         
             DISPLAY W000-PROG 'ICUPON   (' ICUPON   OF DCLCONCEPT ') '         
             PERFORM 970-SQL-ERROR.                                             
       620-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       625-ALTA-AGPOCON SECTION.                                                
           EXEC SQL                                                             
               INSERT INTO AGPOCON                                              
                     (IGPOCONC,                                                 
                      ICONCEPT,                                                 
                      FREG,                                                     
                      IPROGRAM )                                                
               VALUES (:DCLAGPOCON.IGPOCONC,                                    
                       :DCLAGPOCON.ICONCEPT,                                    
                       CURRENT TIMESTAMP,                                       
                       'ZM4EHA06')                                              
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG '******************************'                 
             DISPLAY W000-PROG ' ERROR AL INSERTAR EN AGPOCON '                 
             DISPLAY W000-PROG ' 625-ALTA-AGPOCON             '                 
             DISPLAY W000-PROG 'IGPOCONC = ' IGPOCONC OF DCLAGPOCON             
             DISPLAY W000-PROG 'ICONCEPT = ' ICONCEPT OF DCLAGPOCON             
             PERFORM 970-SQL-ERROR.                                             
       625-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       630-ALTA-CAMCONC SECTION.                                                
       630-0100-INICIO.                                                         
           EXEC SQL                                                             
               INSERT INTO CAMCONC                                              
                     (ICONCEPT,                                                 
                      ECONCEPT,                                                 
                      ITIPOCON,                                                 
                      MVALNOM,                                                  
                      ICONCEXP,                                                 
                      IEMISORA,                                                 
                      ISERIE,                                                   
                      ICUPON,                                                   
                      ICONTAB,                                                  
                      ICTAPROV,                                                 
                      ICORRO,                                                   
                      ITIPOVAL,                                                 
                      IVALBM,                                                   
                      FALTA,                                                    
                      FBAJA,                                                    
                      FCOLOCA,                                                  
                      FVENC,                                                    
                      CLOTEMIN,                                                 
                      ABURSA,                                                   
                      AISR,                                                     
                      PCOMIS1,                                                  
                      MLIMCOM,                                                  
                      PCOMIS2,                                                  
                      SCOLOCA,                                                  
                      SCUBMAR,                                                  
                      ITIPOMER,                                                 
                      ITIPOEMI,                                                 
                      ITIPOLP,                                                  
                      SBLOQUEO,                                                 
                      SVALNOM,                                                  
                      MVALNOMB,                                                 
                      SLIQEMI,                                                  
                      SCUSTOD,                                                  
                      ITIPOCLA,                                                 
                      FSIST,                                                    
                      IUSERAUT,                                                 
                      ITERM,                                                    
                      STIPOMOV,                                                 
                      IISIN,                                                    
                      SCOMIS)                                                   
               VALUES (:DCLCAMCONC.ICONCEPT,                                    
                      :DCLCAMCONC.ECONCEPT,                                     
                      :DCLCAMCONC.ITIPOCON,                                     
                      :DCLCAMCONC.MVALNOM,                                      
                      :DCLCAMCONC.ICONCEXP :NL-CAMCONC-ICONCEXP,                
                      :DCLCAMCONC.IEMISORA :NL-CAMCONC-IEMISORA,                
                      :DCLCAMCONC.ISERIE   :NL-CAMCONC-ISERIE,                  
                      :DCLCAMCONC.ICUPON   :NL-CAMCONC-ICUPON,                  
                      :DCLCAMCONC.ICONTAB,                                      
                      :DCLCAMCONC.ICTAPROV :NL-CAMCONC-ICTAPROV,                
                      :DCLCAMCONC.ICORRO   :NL-CAMCONC-ICORRO,                  
                      :DCLCAMCONC.ITIPOVAL :NL-CAMCONC-ITIPOVAL,                
                      :DCLCAMCONC.IVALBM   :NL-CAMCONC-IVALBM,                  
                      :DCLCAMCONC.FALTA,                                        
                      :DCLCAMCONC.FBAJA    :NL-CAMCONC-FBAJA,                   
                      :DCLCAMCONC.FCOLOCA,                                      
                      :DCLCAMCONC.FVENC    :NL-CAMCONC-FVENC,                   
                      :DCLCAMCONC.CLOTEMIN,                                     
                      :DCLCAMCONC.ABURSA   :NL-CAMCONC-ABURSA,                  
                      :DCLCAMCONC.AISR,                                         
                      :DCLCAMCONC.PCOMIS1,                                      
                      :DCLCAMCONC.MLIMCOM,                                      
                      :DCLCAMCONC.PCOMIS2,                                      
                      :DCLCAMCONC.SCOLOCA,                                      
                      :DCLCAMCONC.SCUBMAR,                                      
                      :DCLCAMCONC.ITIPOMER,                                     
                      :DCLCAMCONC.ITIPOEMI,                                     
                      :DCLCAMCONC.ITIPOLP,                                      
                      :DCLCAMCONC.SBLOQUEO,                                     
                      :DCLCAMCONC.SVALNOM,                                      
                      :DCLCAMCONC.MVALNOMB,                                     
                      :DCLCAMCONC.SLIQEMI,                                      
                      :DCLCAMCONC.SCUSTOD,                                      
                      :DCLCAMCONC.ITIPOCLA,                                     
                       CURRENT TIMESTAMP,                                       
                      :DCLCAMCONC.IUSERAUT,                                     
                      :DCLCAMCONC.ITERM,                                        
                      :DCLCAMCONC.STIPOMOV,                                     
                      :DCLCAMCONC.IISIN,                                        
                      :DCLCAMCONC.SCOMIS)                                       
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG ' ERROR AL INSERTAR EN CAMCONC '                 
             DISPLAY W000-PROG ' 630-0100                     '                 
             DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLCAMCONC ') '         
             DISPLAY W000-PROG 'IEMISORA (' IEMISORA OF DCLCAMCONC ') '         
             DISPLAY W000-PROG 'ISERIE   (' ISERIE   OF DCLCAMCONC ') '         
             DISPLAY W000-PROG 'ICUPON   (' ICUPON   OF DCLCAMCONC ') '         
             PERFORM 970-SQL-ERROR.                                             
       630-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       640-ALTA-PRECIO SECTION.                                                 
       640-0100-INICIO.                                                         
           EXEC SQL                                                             
               INSERT INTO PRECIO                                               
                     (ICONCEPT,                                                 
                      IEMISORA,                                                 
                      ISERIE,                                                   
                      ICUPON,                                                   
                      FPRECIO,                                                  
                      HPRECIO,                                                  
                      MPRECOMP,                                                 
                      MPREVTA,                                                  
                      MVALCURV,                                                 
                      ACURVA,                                                   
                      MINTCORR,                                                 
                      CDIASTRA,                                                 
                      AREND,                                                    
                      ARENDS,                                                   
                      ARENDP,                                                   
                      ARENDPS,                                                  
                      ACOSCASA,                                                 
                      ACOSFPRO,                                                 
                      ICONCEXP)                                                 
               VALUES (:DCLPRECIO.ICONCEPT,                                     
                      :DCLPRECIO.IEMISORA  :NL-PRECIO-IEMISORA,                 
                      :DCLPRECIO.ISERIE    :NL-PRECIO-ISERIE,                   
                      :DCLPRECIO.ICUPON    :NL-PRECIO-ICUPON,                   
                      :DCLPRECIO.FPRECIO,                                       
                      :DCLPRECIO.HPRECIO,                                       
                      :DCLPRECIO.MPRECOMP,                                      
                      :DCLPRECIO.MPREVTA   :NL-PRECIO-MPREVTA,                  
                      :DCLPRECIO.MVALCURV  :NL-PRECIO-MVALCURV,                 
                      :DCLPRECIO.ACURVA    :NL-PRECIO-ACURVA,                   
                      :DCLPRECIO.MINTCORR  :NL-PRECIO-MINTCORR,                 
                      :DCLPRECIO.CDIASTRA  :NL-PRECIO-CDIASTRA,                 
                      :DCLPRECIO.AREND     :NL-PRECIO-AREND,                    
                      :DCLPRECIO.ARENDS    :NL-PRECIO-ARENDS,                   
                      :DCLPRECIO.ARENDP    :NL-PRECIO-ARENDP,                   
                      :DCLPRECIO.ARENDPS   :NL-PRECIO-ARENDPS,                  
                      :DCLPRECIO.ACOSCASA  :NL-PRECIO-ACOSCASA,                 
                      :DCLPRECIO.ACOSFPRO  :NL-PRECIO-ACOSFPRO,                 
                      :DCLPRECIO.ICONCEXP)                                      
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
             DISPLAY W000-PROG ' ERROR AL INSERTAR EN PRECIO '                  
             DISPLAY W000-PROG ' 640-0100                    '                  
             DISPLAY W000-PROG 'ICONCEPT (' ICONCEPT OF DCLPRECIO ') '          
             DISPLAY W000-PROG 'IEMISORA (' IEMISORA OF DCLPRECIO ') '          
             DISPLAY W000-PROG 'ISERIE   (' ISERIE   OF DCLPRECIO ') '          
             DISPLAY W000-PROG 'ICUPON   (' ICUPON   OF DCLPRECIO ') '          
             PERFORM 970-SQL-ERROR.                                             
       640-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       650-ALTA-CTLPROC SECTION.                                                
       650-0100-INICIO.                                                         
           MOVE Z800-ICONCEPT          TO W570-ICONCEPT                         
           MOVE 0                      TO W570-ICUENTA                          
           MOVE ' '                    TO W570-ITIPOTEN                         
           MOVE 0                      TO W570-IFOLOPES                         
           MOVE 0                      TO W570-ICVEOPES                         
           MOVE 0                      TO W570-TITOT-1-EMP1                     
           MOVE 0                      TO W570-TITOT-1-EMP2                     
           MOVE 0                      TO W570-TITOT-2-EMP1                     
           MOVE 0                      TO W570-TITOT-2-EMP2                     
           MOVE 0                      TO W570-TITOT-3-EMP1                     
           MOVE 0                      TO W570-TITOT-3-EMP2                     
           MOVE 0                      TO W570-TITOT-4-EMP1                     
           MOVE 0                      TO W570-TITOT-4-EMP2                     
           MOVE 0                      TO W570-CTITULOS-EMP1                    
                                          W570-CTITULOS-EMP2                    
           MOVE 0                      TO W570-CLI-PROC-EMP1                    
                                          W570-CLI-PROC-EMP2                    
           MOVE W570-ULTLLA            TO IULTLLA OF DCLCTLPROC                 
           MOVE SPACES                 TO ITERM OF DCLCTLPROC                   
           MOVE W570-EDATOS            TO W570-EDATOS-C                         
           MOVE W570-IDATO1            TO IDATO1 OF DCLCTLPROC                  
           MOVE W570-IDATO2            TO IDATO2 OF DCLCTLPROC                  
           MOVE W570-IDATO3            TO IDATO3 OF DCLCTLPROC                  
           MOVE W570-IDATO4            TO IDATO4 OF DCLCTLPROC                  
           MOVE W570-IDATO5            TO IDATO5 OF DCLCTLPROC                  
           MOVE W570-IDATO6            TO IDATO6 OF DCLCTLPROC                  
           MOVE W570-IDATO7            TO IDATO7 OF DCLCTLPROC                  
           MOVE W570-IDATO8            TO IDATO8 OF DCLCTLPROC                  
           MOVE W570-IDATO9            TO IDATO9 OF DCLCTLPROC                  
           MOVE W570-IDATO10           TO IDATO10 OF DCLCTLPROC                 
           MOVE W570-IDATO11           TO IDATO11 OF DCLCTLPROC                 
           MOVE Z800-PAR-EMP-PERF      TO IEMPR   OF DCLCTLPROC                 
           EXEC SQL                                                             
                INSERT INTO CTLPROC                                             
                  (IAPLICA, ISUCCASA, FEVENTO, STERMINO,                        
                   HEVENTO, IULTLLA,                                            
                   FSIST, IUSERAUT, ITERM,                                      
                   IDATO1,IDATO2,IDATO3,IDATO4,IDATO5,IDATO6,                   
                   IDATO7,IDATO8,IDATO9,IDATO10,IDATO11,IEMPR)                  
                VALUES                                                          
                  ('A06', ' ', :P05FECHO, 'I',                                  
                   CURRENT TIME, :DCLCTLPROC.IULTLLA,                           
                   CURRENT TIMESTAMP, :W000-PROG, :DCLCTLPROC.ITERM,            
                   :DCLCTLPROC.IDATO1,:DCLCTLPROC.IDATO2,                       
                   :DCLCTLPROC.IDATO3,:DCLCTLPROC.IDATO4,                       
                   :DCLCTLPROC.IDATO5,:DCLCTLPROC.IDATO6,                       
                   :DCLCTLPROC.IDATO7,:DCLCTLPROC.IDATO8,                       
                   :DCLCTLPROC.IDATO9,:DCLCTLPROC.IDATO10,                      
                   :DCLCTLPROC.IDATO11,:DCLCTLPROC.IEMPR)                       
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG ' ERROR AL INSERTAR EN CTLPROC '                
              DISPLAY W000-PROG ' 650-0100                     '                
              DISPLAY 'IAPLICA  (' IAPLICA  OF DCLCTLPROC ')'                   
              DISPLAY 'ISUCCASA (' ISUCCASA OF DCLCTLPROC ')'                   
              DISPLAY 'FEVENTO  (' FEVENTO  OF DCLCTLPROC ')'                   
              PERFORM 970-SQL-ERROR.                                            
           MOVE '0'                    TO S570-LEC-EFECTUADA.                   
           EXEC SQL                                                             
               COMMIT                                                           
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              DISPLAY W000-PROG ' ERROR AL INSERTAR EN CTLPROC -COMMIT-'        
              DISPLAY W000-PROG ' 650-0100                     '                
              DISPLAY 'IAPLICA  (' IAPLICA  OF DCLCTLPROC ')'                   
              DISPLAY 'ISUCCASA (' ISUCCASA OF DCLCTLPROC ')'                   
              DISPLAY 'FEVENTO  (' FEVENTO  OF DCLCTLPROC ')'                   
              PERFORM 970-SQL-ERROR.                                            
       650-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       680-GRABA-A4-CARTERA SECTION.                                            
       680-0100-INICIO.                                                         
           INITIALIZE  A4-REG                                                   
           MOVE P05FECHO               TO A4-FCARTERA                           
           MOVE P05FECHO               TO A4-FULTCOMP                           
           MOVE W110-CTITULOS          TO A4-CTITEFE                            
           IF   W110-MCPROEXI           < ZERO                                  
                MOVE ZERO              TO W110-MCPROEXI                         
           END-IF                                                               
           MOVE W110-MCPROEXI          TO A4-MCPROEXI                           
           MOVE W110-MCPPFA            TO A4-MCPPFA                             
           MOVE W110-MCPPBP            TO A4-MCPPBP                             
           MOVE W110-FULACCPP          TO A4-FULACCPP                           
           MOVE W110-ICUENTA           TO A4-ICUENTA                            
           MOVE W110-ICONCEPT          TO A4-ICONCEPT                           
           MOVE W110-ITIPOTEN          TO A4-ITIPOTEN                           
           MOVE W110-IDIACAR           TO A4-IDIACAR                            
           MOVE W110-IFOLOPES          TO A4-IFOLOPES                           
           MOVE W110-ICVEOPES          TO A4-ICVEOPES                           
           MOVE 'U'                    TO A4-TIPOPER-REG                        
      *                                                                         
           WRITE REG-TA4-CARTERA       FROM A4-REG                              
           IF    W000-ARCH-A4-ST       NOT  = '00'                              
              DISPLAY W000-PROG                                                 
                    ' *****  680-GRABA-A4-CARTERA ***** '                       
              DISPLAY W000-PROG                                                 
                    ' ERROR AL ESCRIBIR REG-TA4-CARTERA '                       
              DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A4-ST               
              PERFORM 980-ABORTA                                                
           END-IF.                                                              
       680-9900-FIN.                                                            
           EXIT.                                                                
      *                                                                         
      *--- SE CAMBIA EL TIPO DE OPER, PARA ACT LA RESEVA                        
       681-GRABA-A4-CARTERA SECTION.                                            
       681-0100-INICIO.                                                         
           INITIALIZE  A4-REG                                                   
           MOVE P05FECHO               TO A4-FCARTERA                           
           MOVE P05FECHO               TO A4-FULTCOMP                           
           MOVE W110-CTITULOS          TO A4-CTITEFE                            
           IF   W110-MCPROEXI           < ZERO                                  
                MOVE ZERO              TO W110-MCPROEXI                         
           END-IF                                                               
           MOVE W110-MCPROEXI          TO A4-MCPROEXI                           
           MOVE W110-MCPPFA            TO A4-MCPPFA                             
           MOVE W110-FULACCPP          TO A4-FULACCPP                           
           MOVE W110-ICUENTA           TO A4-ICUENTA                            
           MOVE W110-ICONCEPT          TO A4-ICONCEPT                           
           MOVE W110-ITIPOTEN          TO A4-ITIPOTEN                           
           MOVE W110-IDIACAR           TO A4-IDIACAR                            
           MOVE W110-IFOLOPES          TO A4-IFOLOPES                           
           MOVE W110-ICVEOPES          TO A4-ICVEOPES                           
           MOVE 'A'                    TO A4-TIPOPER-REG                        
      *                                                                         
           WRITE REG-TA4-CARTERA       FROM A4-REG                              
           IF    W000-ARCH-A4-ST       NOT  = '00'                              
              DISPLAY W000-PROG                                                 
                    ' *****  681-GRABA-A4-CARTERA ***** '                       
              DISPLAY W000-PROG                                                 
                    ' ERROR AL ESCRIBIR REG-TA4-CARTERA '                       
              DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A4-ST               
              PERFORM 980-ABORTA                                                
           END-IF.                                                              
       681-9900-FIN.                                                            
           EXIT.                                                                
      *                                                                         
       685-GRABA-A4-CARTERA SECTION.                                            
       685-0100-INICIO.                                                         
           INITIALIZE  A4-REG                                                   
           MOVE P05FECHO               TO W110-FULACCPP                         
           IF W110-MCPROEXI < 0                                                 
              MOVE 0                   TO W110-MCPROEXI                         
           END-IF                                                               
           MOVE W110-ICUENTA           TO A4-ICUENTA                            
           MOVE W110-SCUENTA           TO A4-SCUENTA                            
           MOVE W110-ICONCEPT          TO A4-ICONCEPT                           
           MOVE W110-SCONCEPT          TO A4-SCONCEPT                           
           MOVE W110-IEMISORA          TO A4-IEMISORA                           
           MOVE W110-ISERIE            TO A4-ISERIE                             
           MOVE W110-ICUPON            TO A4-ICUPON                             
           MOVE W110-FCARTERA          TO A4-FCARTERA                           
           MOVE W110-FULTCOMP          TO A4-FULTCOMP                           
           MOVE W110-ITIPOCAR          TO A4-ITIPOCAR                           
           MOVE W110-ITIPOSDO          TO A4-ITIPOSDO                           
           MOVE W110-ITIPOTEN          TO A4-ITIPOTEN                           
           MOVE W110-IREF              TO A4-IREF                               
           MOVE W110-AREND             TO A4-AREND                              
           MOVE ' '                    TO A4-FVEN                               
           MOVE 0                      TO A4-CDIAPZO                            
           MOVE W110-CTITULOS          TO A4-CTITEFE                            
           MOVE W110-MVALMERC          TO A4-MVALMERC                           
           MOVE W110-MCPROEXI          TO A4-MCPROEXI                           
           MOVE W110-ICONCEXP          TO A4-ICONCEXP                           
           MOVE W110-IDIACAR           TO A4-IDIACAR                            
           MOVE W110-ICVEOPES          TO A4-ICVEOPES                           
           MOVE W110-IFOLOPES          TO A4-IFOLOPES                           
           MOVE W110-FULACCPP          TO A4-FULACCPP                           
           MOVE W110-MCPPFA            TO A4-MCPPFA                             
           MOVE W110-MCPPBP            TO A4-MCPPBP                             
           MOVE 'I'                    TO A4-TIPOPER-REG                        
      *                                                                         
           WRITE REG-TA4-CARTERA       FROM A4-REG                              
           IF    W000-ARCH-A4-ST       NOT  = '00'                              
              DISPLAY W000-PROG                                                 
                    ' *****  685-GRABA-A4-CARTERA ***** '                       
              DISPLAY W000-PROG                                                 
                    ' ERROR AL ESCRIBIR REG-TA4-CARTERA '                       
              DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A4-ST               
              PERFORM 980-ABORTA                                                
           END-IF.                                                              
       685-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *                                                                         
       688-GRABA-A4-CARTERA SECTION.                                            
       688-0100-INICIO.                                                         
           INITIALIZE  A4-REG                                                   
           MOVE W110-ICUENTA           TO A4-ICUENTA                            
           MOVE W110-IDIACAR           TO A4-IDIACAR                            
           MOVE W110-IFOLOPES          TO A4-IFOLOPES                           
           MOVE W110-ICVEOPES          TO A4-ICVEOPES                           
           MOVE W110-ICONCEPT          TO A4-ICONCEPT                           
           MOVE W110-ITIPOTEN          TO A4-ITIPOTEN                           
           MOVE 'D'                    TO A4-TIPOPER-REG                        
      *                                                                         
           WRITE REG-TA4-CARTERA       FROM A4-REG                              
           IF    W000-ARCH-A4-ST       NOT  = '00'                              
              DISPLAY W000-PROG                                                 
                    ' *****  688-GRABA-A4-CARTERA ***** '                       
              DISPLAY W000-PROG                                                 
                    ' ERROR AL ESCRIBIR REG-TA4-CARTERA '                       
              DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A4-ST               
              PERFORM 980-ABORTA                                                
           END-IF.                                                              
       688-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *                                                                         
       690-GRABA-A5-OPERAVA SECTION.                                            
       690-0100-INICIO.                                                         
           IF A5-MCPROEXI < 0                                                   
              MOVE 0                    TO A5-MCPROEXI                          
           END-IF                                                               
           MOVE 1                       TO A5-ISEC                              
           MOVE A5-IREF                 TO A5-IDOCTO                            
           MOVE W000-PROG               TO A5-IUSUARIO                          
           MOVE 1                       TO A5-ICONCEP1                          
           MOVE 0                       TO A5-CANT1                             
           MOVE 0                       TO A5-ICUENTA2                          
           MOVE 0                       TO A5-ACOSCASA                          
           MOVE 0                       TO A5-ACOSFPRO                          
           MOVE 0                       TO A5-ACOSPROM                          
           EXEC SQL                                                             
                SET :A5-FREG             = CURRENT TIMESTAMP                    
           END-EXEC                                                             
           MOVE SPACES                  TO A5-FVENC                             
           MOVE 'C'                     TO A5-SESTATUS                          
           MOVE 'I'                     TO A5-TIPOPER-REG                       
      *                                                                         
           WRITE REG-TA5-OPERAVA        FROM A5-REG                             
           IF    W000-ARCH-A5-ST        NOT  = '00'                             
              DISPLAY W000-PROG                                                 
                    ' *****  690-GRABA-A5-OPERAVA ***** '                       
              DISPLAY W000-PROG                                                 
                    ' ERROR AL ESCRIBIR REG-TA5-OPERAVA '                       
              DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A5-ST               
              PERFORM 980-ABORTA                                                
           END-IF.                                                              
       690-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       697-CREA-REGEMOP SECTION.                                                
       697-0100-INICIO.                                                         
           EXEC SQL                                                             
               INSERT INTO REGEMOP                                              
               (ICONCEPT,FVIGEN, ISEC, SBLOQUEO,                                
                CNUMPER, VPERJUR, CNUMEST, VESTMIG, SVIGEN,                     
                FSIST, IUSERAUT, ITERM)                                         
               VALUES (                                                         
               :DCLREGEMOP.ICONCEPT,                                            
               :DCLREGEMOP.FVIGEN,                                              
               :DCLREGEMOP.ISEC,                                                
               :DCLREGEMOP.SBLOQUEO,                                            
               :DCLREGEMOP.CNUMPER,                                             
               :DCLREGEMOP.VPERJUR,                                             
               :DCLREGEMOP.CNUMEST,                                             
               :DCLREGEMOP.VESTMIG,                                             
               :DCLREGEMOP.SVIGEN,                                              
               CURRENT TIMESTAMP,                                               
               :DCLREGEMOP.IUSERAUT,                                            
               :DCLREGEMOP.ITERM)                                               
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
               DISPLAY W000-PROG 'SQL ERROR EN REGEMOP INSERT 697-0100'         
               PERFORM 970-SQL-ERROR.                                           
       697-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
       698-LEE-FOLIO  SECTION.                                                  
       698-0100-INICIO.                                                         
           INITIALIZE                      ZG11-REGISTRO                        
           MOVE '11'                    TO ZG11-ITIPOFOL                        
           MOVE SPACES                  TO ZG11-ISUCCASA                        
           CALL RUT-ZM6RG012         USING ZG11-REGISTRO                        
                                                                                
           IF ZG11-WCODRET = ZEROS                                              
              MOVE ZG11-SIGFOLIO        TO W000-SIGFOLIO                        
           ELSE                                                                 
              MOVE ZG11-SIGFOLIO        TO W000-SIGFOLIO                        
              DISPLAY W000-PROG '  ERROR EN RUTINA DE FOLIOS '                  
                                                        RUT-ZM6RG012            
              DISPLAY W000-PROG '     ZG11-MENSERR  : ' ZG11-MENSERR            
              DISPLAY W000-PROG '     ZG11-WCODRET  : ' ZG11-WCODRET            
              DISPLAY W000-PROG '     ZG11-SQLCODE  : ' ZG11-SQLCODE            
              DISPLAY W000-PROG '     ZG11-SIGFOLIO : ' ZG11-SIGFOLIO           
              MOVE ZG11-SQLCODE   TO  SQLCODE                                   
              PERFORM 970-SQL-ERROR                                             
           END-IF.                                                              
       698-9900-FIN.                                                            
      /                                                                         
       740-ENCABEZADO-ESTANDAR SECTION.                                         
       740-0100-INICIO.                                                         
           IF WS-IEMPR-CTA = SPACES OR 'CBP'                                    
             MOVE 'CBP'                    TO R1-CVE-EMP                        
             PERFORM 999-CONST-ENCA                                             
             ADD 1 TO R1-NUM-HOJA                                               
             MOVE 12                     TO R1-NUM-LIN                          
             MOVE R1-NUM-HOJA            TO R1-01-NUM-HOJA                      
             WRITE R1-REG                FROM R1-00-BLANCO AFTER PAGE           
             WRITE R1-REG                FROM R1-01-ENCA                        
             WRITE R1-REG                FROM R1-02-ENCA                        
             WRITE R1-REG                FROM R1-03-ENCA                        
             WRITE R1-REG                FROM R1-04-ENCA                        
             WRITE R1-REG                FROM R1-05-ENCA AFTER 2                
             WRITE R1-REG                FROM R1-07-ENCA AFTER 2                
             WRITE R1-REG                FROM R1-08-ENCA                        
             WRITE R1-REG                FROM R1-09-ENCA                        
             WRITE R1-REG                FROM R1-09-ENCA-PCPP                   
             ADD 1                         TO R1-NUM-LIN                        
             WRITE R1-REG                FROM R1-00-BLANCO                      
           ELSE                                                                 
             MOVE WS-IEMPR-CTA             TO R1-CVE-EMP                        
             PERFORM 999-CONST-ENCA                                             
             ADD 1 TO R2-NUM-HOJA                                               
             MOVE 12                     TO R2-NUM-LIN                          
             MOVE R2-NUM-HOJA            TO R1-01-NUM-HOJA                      
             WRITE R2-REG                FROM R1-00-BLANCO AFTER PAGE           
             WRITE R2-REG                FROM R1-01-ENCA                        
             WRITE R2-REG                FROM R1-02-ENCA                        
             WRITE R2-REG                FROM R1-03-ENCA                        
             WRITE R2-REG                FROM R1-04-ENCA                        
             WRITE R2-REG                FROM R1-05-ENCA AFTER 2                
             WRITE R2-REG                FROM R1-07-ENCA AFTER 2                
             WRITE R2-REG                FROM R1-08-ENCA                        
             WRITE R2-REG                FROM R1-09-ENCA                        
             WRITE R2-REG                FROM R1-09-ENCA-PCPP                   
             ADD 1                         TO R2-NUM-LIN                        
             WRITE R2-REG                FROM R1-00-BLANCO                      
           END-IF.                                                              
       740-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
      *----                                                                     
      *    970-SQL-ERROR SECTION.                                               
      *----                                                                     
       COPY ZMWBP001.                                                           
      /                                                                         
       980-ABORTA SECTION.                                                      
       980-0100-INICIO.                                                         
           EXEC SQL                                                             
               ROLLBACK                                                         
           END-EXEC.                                                            
           PERFORM 990-CIF-CTL                                                  
      *                                                                         
           CLOSE   ARCH-A3-CURSORES                                             
              IF   W000-ARCH-A3-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A3-CURSORES'            
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A3-ST            
              END-IF                                                            
           CLOSE   ARCH-A4-CARTERA                                              
              IF   W000-ARCH-A4-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A4-CARTERA'             
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A4-ST            
              END-IF                                                            
           CLOSE   ARCH-A5-OPERAVA                                              
              IF   W000-ARCH-A5-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A5-OPERAVA'             
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A5-ST            
              END-IF                                                            
           CLOSE   ARCH-A6-ZMDT701                                              
              IF   W000-ARCH-A6-ST    NOT EQUAL  '00'                           
                 DISPLAY W000-PROG                                              
                         ' ERROR AL CERRAR ARCHIVO ARCH-A6-ZMDT701'             
                 DISPLAY W000-PROG ' FILE STATUS : ' W000-ARCH-A6-ST            
              END-IF                                                            
      *                                                                         
           IF S700-EDO-R1 NOT = ' '                                             
               CLOSE REPO-R1-CASPRE                                             
                     REPO-R2-BCMPRE                                             
               MOVE ' '                TO S700-EDO-R1.                          
           DISPLAY W000-PROG '  TERMINACION ANORMAL, CODIGO 16'                 
           MOVE 16 TO RETURN-CODE.                                              
       980-9900-FIN.                                                            
           STOP RUN.                                                            
      /                                                                         
       990-CIF-CTL SECTION.                                                     
       990-0100-INICIO.                                                         
           MOVE A990-REG-LEI-CARTERA   TO A990-CIFRA                            
           DISPLAY W000-PROG , '  REG. LEIDOS DE TABLA CARTERA     (' ,         
           A990-CIFRA ')'.                                                      
           MOVE A990-REG-ESC-R1        TO A990-CIFRA                            
           DISPLAY W000-PROG , '  REG. ESCRITOS EN EL REPORTE CBP  (' ,         
           A990-CIFRA ')'.                                                      
           MOVE A990-REG-ESC-R2        TO A990-CIFRA                            
           DISPLAY W000-PROG , '  REG. ESCRITOS EN EL REPORTE BCM  (' ,         
           A990-CIFRA ')'.                                                      
           MOVE A990-NUM-ACT-ORDENES   TO A990-CIFRA                            
           DISPLAY W000-PROG , '  REG. ACT. DE LA TABLA ORDENES    (' ,         
           A990-CIFRA ')'.                                                      
       990-9900-FIN.                                                            
           EXIT.                                                                
      /                                                                         
           EXEC SQL                                                             
               INCLUDE ZMWBP000                                                 
           END-EXEC.                                                            
      /                                                                         
       COPY ZMWBP070.                                                           
      *                                                                         
      *----                                                                     
      *    OBTIENE EL CASILLERO DE CTRL-D PARA LOS REPORTES.                    
      *----                                                                     
      *                                                                         
           EXEC SQL                                                             
                INCLUDE ZMWBP074                                                
           END-EXEC.                                                            
      *                                                                         
      ******************************************************************        
      *                   FIN DEL PROGRAMA ZM4EHA06                    *        
      ******************************************************************        
